{
  "common": {
    "name": "roborock",
    "version": "0.1.4-beta.0",
    "news": {
      "0.1.4-beta.0": {
        "en": "Create and clear update interval for each vacuum correctly\nFix consumables for S6 MaxV\nStart webserver and websocket server only when map creation is enabled\nUpdate homedata without fully reinitializing the adapter\nAdd clean count for room cleaning\nAbility to reset consumables\nAdd clean count for room cleaning\nAdd resume_segment_clean and resume_zoned_clean",
        "de": "Erstellen und klares Update-Intervall für jedes Vakuum korrekt\nVerbrauchsmaterialien für S6 MaxV festsetzen\nStarten Sie Webserver und Websocket Server nur, wenn die Kartenerstellung aktiviert ist\nHomedata aktualisieren, ohne den Adapter vollständig neu zu installieren\nReine Anzahl der Zimmerreinigung hinzufügen\nFähigkeit, Verbrauchsmaterialien zurückzusetzen\nReine Anzahl der Zimmerreinigung hinzufügen\nLebenslauf hinzufügen_segment_clean und Lebenslauf_zoned_clean",
        "ru": "Создавайте и понятный интервал обновления для каждого вакуума правильно\nИсправление расходных материалов для S6 MaxV\nНачните webserver и websocket сервер только тогда, когда создание карты разрешено\nОбновить домашние данные без полностью переинициирования адаптера\nДобавить чистый счет для уборки номеров\nВозможность сброса расходных материалов\nДобавить чистый счет для уборки номеров\nДобавить резюме_сегмент_чисто и резюме_zoned_clean",
        "pt": "Criar e limpar intervalo de atualização para cada vácuo corretamente\nConsumíveis de fixação para S6 MaxV\nIniciar servidor web e servidor websocket somente quando a criação de mapas está ativada\nAtualize os dados de casa sem reiniciar totalmente o adaptador\nAdicionar contagem limpa para limpeza de quartos\nCapacidade de redefinir consumíveis\nAdicionar contagem limpa para limpeza de quartos\nAdicionar currículo_segment_clean e retomar_zoned_clean",
        "nl": "Creëer en duidelijke interval voor elk vacuüm correct\nVertaling:\nBegin met webserver en websocket server alleen als de kaart creatie in staat is\nUpdate homedata zonder de adapter te herstarten\nVoeg schoonmaakmiddel toe\nVermogen om te resetten\nVoeg schoonmaakmiddel toe\nVertaling:",
        "fr": "Créer et préciser l'intervalle de mise à jour pour chaque vide correctement\nConsommables fixes pour S6 MaxV\nDémarrer webserver et serveur websocket seulement lorsque la création de carte est activée\nMettre à jour les homedata sans réinitialiser entièrement l'adaptateur\nAjouter le compte propre pour le nettoyage de la chambre\nCapacité à réinitialiser les consommables\nAjouter le compte propre pour le nettoyage de la chambre\nAjouter resume_segment_clean and resume_zoned_clean",
        "it": "Creare e cancellare l'intervallo di aggiornamento per ogni vuoto correttamente\nRisolvere i materiali di consumo per S6 MaxV\nAvviare webserver e websocket server solo quando la creazione della mappa è abilitata\nAggiornare i dati di casa senza riavviare completamente l'adattatore\nAggiungere il conteggio pulito per la pulizia della camera\nCapacità di ripristinare i materiali di consumo\nAggiungere il conteggio pulito per la pulizia della camera\nAggiungi curriculum_segment_clean e riprendere_zoned_clean",
        "es": "Crear y limpiar el intervalo de actualización para cada vacío correctamente\nConsumibles fijos para S6 MaxV\nInicio servidor web y servidor websocket sólo cuando la creación de mapa está habilitada\nActualizar homedata sin reinicializar completamente el adaptador\nAñadir cuenta limpia para la limpieza de la habitación\nCapacidad para restablecer los bienes fungibles\nAñadir cuenta limpia para la limpieza de la habitación\nAñadir curriculum vitae_segment_clean y curriculum vitae_zoned_clean",
        "pl": "Rozszerzenie i rozdzielenie każdej próżni poprawnie poprawnie\nS6 MaxVable (ang.)\nPoczątkowy serwer internetowy i internetowy tylko wtedy, gdy tworzenie map jest możliwe\nData bez w pełni zainicjowania adaptera\nCzyste konto\nMożliwość resetowania konsumable\nCzyste konto\nAdd wznowił formaty_segment_clean and re_zoned_clean",
        "uk": "Створення та прозорий інтервал оновлення для кожного вакууму правильно\nВиправлення витратних матеріалів для S6 MaxV\nПочати сервер вебсервера і websocket тільки при створенні карт\nОновлення домашньої інформації без повного перевстановлення адаптера\nДодавання чистої кількості для прибирання приміщення\nМожливість скидання витратних матеріалів\nДодавання чистої кількості для прибирання приміщення\nДодати резюме_segment_clean and резюме_zoned_clean",
        "zh-cn": "为每一真空建立明确的最新间隔\nS6 MaxV的固定配量\n只有当地图制作时才能够启动网站维护者和网络服务器\n更新的家政数据没有完全重新启动适应者\n增加清洁房\nA. 重新组合消耗的可能性\n增加清洁房\n增 编"
      },
      "0.1.3": {
        "en": "\"retry\" on getMap() is not an error\nFix *_life calculation\nFix reconnect",
        "de": "retry on getMap() ist kein Fehler\n*_Lebensberechnung\nReconnect aktivieren",
        "ru": "retry on getMap() не ошибка\nFix *_расчёт жизни\nИсправление reconnect",
        "pt": "retry on getMap() não é um erro\nCorrigir cálculo *_life\nCorrigir a conexão",
        "nl": "is geen fout\nVertaling:\nVertaling:",
        "fr": "retry on getMap() n'est pas une erreur\nCalcul *_vie\nReconnexion fixe",
        "it": "retry on getMap() non è un errore\nFissare il calcolo *_life\nRisolvere la connessione",
        "es": "retry on getMap() no es un error\nCorrección *_Cálculo de vida\nReconectar",
        "pl": "Retrygacja na temat getMap() nie jest błędem\nFix *_life calculation (ang.)\nFix reconnect",
        "uk": "птиця на getMap() не є помилкою\nФіксація *_розрахунок\nВиправлення відключення",
        "zh-cn": "对Map(Map)的重新定性并非错误。\n页: 1\nFix 重新连接"
      },
      "0.1.2": {
        "en": "Fix ignoring get_carpet_clean_mode and get_water_box_custom_mode for S6 and older vacuums",
        "de": "Unwissenheit beheben get_carpet_clean_mode und get_water_box_custom_mode für S6 und ältere Vakuume",
        "ru": "Fix игнорирование get_carpet_clean_mode и get_water_box_custom_mode для S6 и старых вакуумов",
        "pt": "Ignoração fixa get_carpet_clean_mode e get_water_box_custom_mode para S6 e aspiradores mais antigos",
        "nl": "Fix negeren _",
        "fr": "En ignorant get_carpet_clean_mode and get_water_box_custom_mode for S6 and older vacuums",
        "it": "Fissare ignorando get_carpet_clean_mode e get_water_box_custom_mode per S6 e vecchi vuoto",
        "es": "Corrección ignorante get_carpet_clean_mode y get_water_box_custom_mode para S6 y vacíos antiguos",
        "pl": "Fix ignorowanie. Get_carpet_clean_mode i get_water_box_custom_mode dla S6 i starszej próżni",
        "uk": "Виправлення ігнорування get_carpet_clean_mode і get_water_box_custom_mode для S6 і старших вакуумів",
        "zh-cn": "不知 获得_carpet_clean_mode and access_water_箱_custom_mode for S6 and Long真空"
      },
      "0.1.1": {
        "en": "Encrypt username & password. This means you need to re-enter username and password in the options\nUse Sentry Plugin instead native sentry\nConvert setInterval()/setTimeout() to this.setInterval()/this.setTimeout()\nCorrectly clear intervals and timeouts on unload and reconnect\nUpdate consumables code",
        "de": "Verschlüsseln Sie Benutzername & Passwort. Dies bedeutet, dass Sie Benutzername und Passwort in den Optionen neu eingeben müssen\nVerwenden Sie Sentry Plugin anstelle nativer Sendry\nSetInterval()/setTimeout in this.setInterval()/this.setTimeout umrechnen\nKorrekt klare Intervalle und Timeouts beim Entladen und Reconnect\nVerbrauchscode aktualisieren",
        "ru": "Зашифровать имя пользователя и пароль. Это означает, что вам нужно повторно ввести имя пользователя и пароль в опциях\nИспользуйте Sentry Plugin вместо родного судоходства\nКонвертировать setInterval()/setTimeout to this.setInterval()/this.setTimeout\nПравильно понятные интервалы и тайм-ауты на разгрузке и повторном подключении\nОбновление расходных материалов код",
        "pt": "Criptografar nome de usuário e senha. Isso significa que você precisa digitar nome de usuário e senha nas opções\nUse Sentry Plugin em vez de sentinela nativa\nConverta setInterval()/setTimeout para this.setInterval()/this.setTimeout\nIntervalos e timeouts corretamente claros sobre descarga e reconectar\nCódigo de consumíveis de atualização",
        "nl": "Encrypt gebruikersnaam wachtwoord. Dit betekent dat je gebruikersnaam en wachtwoord moet herstellen op de opties\nGebruik Sentry Plugin in plaats van inheemse sentiment\nConvert setInterval (setTimeout naar dit\nCorrect duidelijke intervals en time-outs op ontlading en verbinding\nUpdate consumables code",
        "fr": "Décrypter le nom d'utilisateur et mot de passe. Cela signifie que vous devez réentrer le nom d'utilisateur et le mot de passe dans les options\nUtilisez Sentry Plugin au lieu de envoyé native\nConvertir setInterval()/setTimeout en ce.setInterval()/this.setTimeout\nIntervalles et timeouts corrects sur le déchargement et le reconnectement\nMettre à jour le code des consommables",
        "it": "Crittografia nome utente e password. Ciò significa che è necessario inserire nuovamente nome utente e password nelle opzioni\nUtilizzare Sentry Plugin invece inviati nativi\nConvertire setInterval()/setTimeout in questo.setInterval()/this.setTimeout\nIntervalli e timeout correttamente chiari su scarico e ricollegamento\nAggiornare il codice dei materiali di consumo",
        "es": "Encrypt username & password. Esto significa que necesita volver a introducir el nombre de usuario y la contraseña en las opciones\nUse Centry Plugin en su lugar centinela nativa\nConvertir setInterval()/setTimeout en this.setInterval()/this.setTimeout\nIntervalos y timeouts correctos en descarga y reconexión\nActualizar códigos fungibles",
        "pl": "Wszystko o nazwie i hasło. Oznacza to, że potrzebujesz ponownego dostępu do nazwy użytkownika i hasła w opcji\nWykorzystywanie Sentry Plugin zamiast nazw\nZmiany setInterval()/setTimeout na to.setInterval()/thissetTimeout\nOczywiście jasne odstępy i czasy wyładowują i ponownie łączą się\nKod aktualny",
        "uk": "Зашифрувати ім'я користувача та пароль. Це означає, що вам потрібно перереєструвати ім'я користувача та пароль в опції\nВикористовуйте Sentry плагін замість рідного відправника\nПеретворення setInterval()/setTimeout в this.setInterval()/this.setTimeout\nПравильно зрозумілі інтервали і часові маршрути на розвантаження і відключення\nОновлення код витратних матеріалів",
        "zh-cn": "加密用户和密码。 这意味着,你需要在选择中重新命名用户和密码。\n使用Sentry Plugin,而不是土著寄托\n规 律\n适时的间隔时间和时间安排\nA. 最新消耗代码"
      },
      "0.1.0": {
        "en": "* (copystring) Fix a lot of my seriously shitty robot coords and pixel XY code\n* (copystring) Fix connecting to websocket for hosts with more than one network card\n* (copystring) Disable buttons on webinterface when they can't be used\n* (copystring) Improve deleting/addin zones in webinterface\n* (copystring) map_status the currently selected map when bitwise shifted by 2 to the right\n* (copystring) use currently selected map to get floor rooms of selected map\n* (copystring) Update map only once on start of adapter\n\n* (copystring) Automatically send current map to webinterface when updating map* (copystring) Update clean summary only after once after cleaning and once at start\n\n* (copystring) Implement charger and robot angle on map\n* (copystring) Fix zone positions\n* (copystring) Locating should not be an error. Make this an info instead\n* (copystring) Fix robot position and rotation\n* (copystring) Fix mop path detection at start of robot\n* (copystring) Don't process is_Locating for starting the map updater\n* (copystring) Add go to and go to predicted path feature in webinterface\n* (copystring) Make the actual path slightly transparent\n* (copystring) New robot image on map\n* (copystring) Add pause, stop, dock buttons to webinterface\n* (copystring) Reconnect websocket after 10 seconds of disconnection\n* (copystring) Remove unnecessary getMap() calls\n* (copystring) Improve reconnect logic\n* (copystring) Add Sentry\n* (copystring) Correct mop_mode state\n* (copystring) Add consumables life in percent",
        "de": "* (copystring) Korrigiere viele meiner wirklich beschissenen Roboterkoordinaten und Pixel-XY-Code\n* (copystring) Verbindung zum Websocket für Hosts mit mehr als einer Netzwerkkarte behoben\n* (copystring) Deaktiviert Schaltflächen auf der Weboberfläche, wenn sie nicht verwendet werden können\n* (copystring) Verbessertes Löschen/Hinzufügen von Zonen im Webinterface\n* (copystring) map_status die aktuell ausgewählte Map, wenn sie bitweise um 2 nach rechts verschoben wird\n* (Kopierzeichenfolge) verwendet die aktuell ausgewählte Karte, um Stockwerksräume der ausgewählten Karte zu erhalten\n* (copystring) Karte nur einmal beim Start des Adapters aktualisieren\n\n* (copystring) Automatisches Senden der aktuellen Karte an das Webinterface, wenn die Karte aktualisiert wird* (copystring) Aktualisierung der sauberen Zusammenfassung nur einmal nach dem Reinigen und einmal beim Start\n\n* (copystring) Ladegerät und Roboterwinkel auf der Karte implementieren\n* (copystring) Zonenpositionen fixieren\n* (copystring) Lokalisierung sollte kein Fehler sein. Machen Sie dies stattdessen zu einer Info\n* (copystring) Roboterposition und Rotation korrigieren\n* (copystring) Mopppfad-Erkennung beim Start des Roboters behoben\n* (copystring) Verarbeite is_Locating nicht, um den Karten-Updater zu starten\n* (Kopierzeichenfolge) Hinzufügen von Gehe zu und Gehe zu vorhergesagtem Pfad-Feature im Webinterface\n* (copystring) Machen Sie den tatsächlichen Pfad leicht transparent\n* (copystring) Neues Roboterbild auf der Karte\n* (copystring) Hinzufügen von Schaltflächen zum Anhalten, Stoppen und Andocken zum Webinterface\n* (copystring) Verbinden Sie den Websocket nach 10 Sekunden der Trennung erneut\n* (copystring) Unnötige Aufrufe von getMap() entfernen\n* (copystring) Verbesserte Reconnect-Logik\n* (copystring) Sentry hinzufügen\n* (copystring) Korrigieren Sie den Status von mop_mode\n* (copystring) Lebensdauer der Verbrauchsmaterialien in Prozent hinzufügen",
        "ru": "* (copystring) Исправлено множество моих очень дерьмовых координат робота и пиксельный код XY\n* (copystring) Исправлено подключение к веб-сокету для хостов с более чем одной сетевой картой.\n* (copystring) Отключить кнопки в веб-интерфейсе, когда они не могут быть использованы\n* (copystring) Улучшено удаление/добавление зон в веб-интерфейсе\n* (copystring) map_status текущая выбранная карта при побитовом сдвиге на 2 вправо\n* (copystring) использовать текущую выбранную карту, чтобы получить комнаты этажа выбранной карты\n* (copystring) Обновление карты только один раз при запуске адаптера\n\n* (copystring) Автоматически отправлять текущую карту в веб-интерфейс при обновлении карты* (copystring) Обновлять сводку очистки только один раз после очистки и один раз при запуске\n\n* (copystring) Реализовать зарядное устройство и угол робота на карте\n* (copystring) Исправить положение зон\n* (copystring) Поиск не должен быть ошибкой. Вместо этого сделайте это информацией\n* (copystring) Исправить положение и вращение робота\n* (copystring) Исправлено обнаружение пути швабры при запуске робота.\n* (copystring) Не обрабатывать is_Locating для запуска программы обновления карты\n* (copystring) Добавить функцию перехода и перехода к прогнозируемому пути в веб-интерфейсе\n* (copystring) Сделать фактический путь слегка прозрачным\n* (copystring) Новое изображение робота на карте\n* (copystring) Добавить кнопки паузы, остановки, закрепления в веб-интерфейс\n* (copystring) Переподключить веб-сокет через 10 секунд после отключения\n* (copystring) Удалить ненужные вызовы getMap()\n* (copystring) Улучшить логику повторного подключения\n* (copystring) Добавить часового\n* (copystring) Правильное состояние mop_mode\n* (copystring) Добавить ресурс расходников в процентах",
        "pt": "* (copystring) Conserte muitas das minhas coordenadas de robô seriamente ruins e código XY de pixel\n* (copystring) Corrige conexão com websocket para hosts com mais de uma placa de rede\n* (copystring) Desabilita botões na interface web quando eles não podem ser usados\n* (copystring) Melhorar a exclusão/adicionar zonas na interface da web\n* (copystring) map_status o mapa atualmente selecionado quando deslocado bit a bit em 2 para a direita\n* (copystring) use o mapa atualmente selecionado para obter as salas do mapa selecionado\n* (copystring) Atualiza o mapa apenas uma vez na inicialização do adaptador\n\n* (copystring) Envia automaticamente o mapa atual para a interface da web ao atualizar o mapa* (copystring) Atualize o resumo limpo apenas uma vez após a limpeza e uma vez no início\n\n* (copystring) Implemente o carregador e o ângulo do robô no mapa\n* (copystring) Corrigir as posições da zona\n* (copystring) A localização não deve ser um erro. Faça disso uma informação\n* (copystring) Corrige a posição e rotação do robô\n* (copystring) Corrige a detecção do caminho do esfregão no início do robô\n* (copystring) Não processar is_Locating para iniciar o atualizador de mapa\n* (copystring) Adicionar ir para e ir para o recurso de caminho previsto na interface da web\n* (copystring) Torna o caminho atual ligeiramente transparente\n* (copystring) Nova imagem do robô no mapa\n* (copystring) Adicionar botões de pausa, parada e encaixe à interface da web\n* (copystring) Reconectar websocket após 10 segundos de desconexão\n* (copystring) Remova chamadas getMap() desnecessárias\n* (copystring) Melhorar a lógica de reconexão\n* (copystring) Adicionar Sentinela\n* (copystring) Corrigir estado mop_mode\n* (copystring) Adiciona a vida útil dos consumíveis em porcentagem",
        "nl": "* (copystring) Repareer veel van mijn serieus waardeloze robotcoördinaten en pixel XY-code\n* (copystring) Verbinding met websocket repareren voor hosts met meer dan één netwerkkaart\n* (copystring) Schakel knoppen op webinterface uit wanneer ze niet kunnen worden gebruikt\n* (copystring) Verbeter het verwijderen/toevoegen van zones in de webinterface\n* (copystring) map_status de huidig ​​geselecteerde kaart wanneer bitsgewijs 2 naar rechts verschoven\n* (copystring) gebruik de momenteel geselecteerde kaart om verdiepingsruimten van de geselecteerde kaart te krijgen\n* (copystring) Update de kaart slechts één keer bij het starten van de adapter\n\n* (copystring) Stuur huidige kaart automatisch naar webinterface bij het updaten van de kaart* (copystring) Update schone samenvatting slechts een keer na het opschonen en een keer bij het starten\n\n* (copystring) Implementeer lader en robothoek op de kaart\n* (copystring) Fix zoneposities\n* (copystring) Lokaliseren zou geen fout moeten zijn. Maak dit in plaats daarvan een info\n* (copystring) Bevestig de positie en rotatie van de robot\n* (copystring) Detectie dweilpad repareren bij starten van robot\n* (copystring) Verwerk is_Locating niet voor het starten van de kaartupdater\n* (copystring) Toevoegen ga naar en ga naar voorspelde pad-functie in webinterface\n* (copystring) Maak het eigenlijke pad enigszins transparant\n* (copystring) Nieuwe robotafbeelding op kaart\n* (copystring) Voeg pauze-, stop-, dock-knoppen toe aan webinterface\n* (copystring) Sluit de websocket opnieuw aan na 10 seconden loskoppeling\n* (copystring) Verwijder onnodige getMap()-aanroepen\n* (copystring) Verbeter de logica voor opnieuw verbinden\n* (copystring) Voeg schildwacht toe\n* (copystring) Correcte status mop_mode\n* (copystring) Levensduur verbruiksartikelen in procenten toevoegen",
        "fr": "* (copystring) Corrige beaucoup de mes coords de robot sérieusement merdiques et du code pixel XY\n* (copystring) Correction de la connexion au websocket pour les hôtes avec plus d'une carte réseau\n* (copystring) Désactiver les boutons sur l'interface Web lorsqu'ils ne peuvent pas être utilisés\n* (copystring) Améliorer la suppression/ajout de zones dans l'interface Web\n* (copystring) map_status la carte actuellement sélectionnée lorsqu'elle est décalée au niveau du bit de 2 vers la droite\n* (copystring) utilise la carte actuellement sélectionnée pour obtenir les pièces au sol de la carte sélectionnée\n* (copystring) Mettre à jour la carte une seule fois au démarrage de l'adaptateur\n\n* (copystring) Envoyer automatiquement la carte actuelle à l'interface Web lors de la mise à jour de la carte * (copystring) Mettre à jour le résumé propre uniquement après une fois après le nettoyage et une fois au démarrage\n\n* (copystring) Mettre en œuvre le chargeur et l'angle du robot sur la carte\n* (copystring) Correction des positions de zone\n* (copystring) La localisation ne doit pas être une erreur. Faites-en une info à la place\n* (copystring) Correction de la position et de la rotation du robot\n* (copystring) Correction de la détection du chemin de la vadrouille au démarrage du robot\n* (copystring) Ne pas traiter is_Locating pour démarrer le programme de mise à jour de la carte\n* (copystring) Ajouter aller à et aller à la fonction de chemin prévu dans l'interface Web\n* (copystring) Rendre le chemin réel légèrement transparent\n* (copystring) Nouvelle image du robot sur la carte\n* (copystring) Ajouter des boutons de pause, d'arrêt et d'ancrage à l'interface Web\n* (copystring) Reconnectez le websocket après 10 secondes de déconnexion\n* (copystring) Supprime les appels getMap() inutiles\n* (copystring) Améliorer la logique de reconnexion\n* (copystring) Ajouter une sentinelle\n* (copystring) Corriger l'état de mop_mode\n* (copystring) Ajouter la durée de vie des consommables en pourcentage",
        "it": "* (copystring) Risolvi molte delle mie coordinate di robot seriamente di merda e il codice pixel XY\n* (copystring) Corretta la connessione al websocket per gli host con più di una scheda di rete\n* (copystring) Disattiva i pulsanti sull'interfaccia web quando non possono essere utilizzati\n* (copystring) Migliora l'eliminazione/aggiunta di zone nell'interfaccia web\n* (copystring) map_status la mappa attualmente selezionata quando viene spostata bit per bit di 2 a destra\n* (copystring) utilizza la mappa attualmente selezionata per ottenere le stanze del piano della mappa selezionata\n* (copystring) Aggiorna la mappa solo una volta all'avvio dell'adattatore\n\n* (copystring) Invia automaticamente la mappa corrente all'interfaccia web durante l'aggiornamento della mappa* (copystring) Aggiorna il riepilogo della pulizia solo una volta dopo la pulizia e una volta all'avvio\n\n* (copystring) Implementa il caricabatterie e l'angolazione del robot sulla mappa\n* (copystring) Fissa le posizioni delle zone\n* (copystring) La localizzazione non dovrebbe essere un errore. Rendilo invece un'informazione\n* (copystring) Fissa la posizione e la rotazione del robot\n* (copystring) Corretto il rilevamento del percorso del mop all'avvio del robot\n* (copystring) Non elaborare is_Locating per l'avvio del programma di aggiornamento della mappa\n* (copystring) Aggiunta la funzionalità vai a e vai al percorso previsto nell'interfaccia web\n* (copystring) Rende il percorso effettivo leggermente trasparente\n* (copystring) Nuova immagine del robot sulla mappa\n* (copystring) Aggiungi i pulsanti pausa, stop, dock all'interfaccia web\n* (copystring) Riconnettere websocket dopo 10 secondi di disconnessione\n* (copystring) Rimuove le chiamate getMap() non necessarie\n* (copystring) Migliora la logica di riconnessione\n* (copystring) Aggiungi sentinella\n* (copystring) Correggere lo stato mop_mode\n* (copystring) Aggiungi la durata dei consumabili in percentuale",
        "es": "* (copystring) Arreglar muchas de mis coordenadas de robot y el código XY de píxeles.\n* (copystring) Arreglar la conexión a websocket para hosts con más de una tarjeta de red\n* (copystring) Deshabilitar botones en la interfaz web cuando no se pueden usar\n* (copystring) Mejorar eliminar/agregar zonas en la interfaz web\n* (cadena de copia) map_status el mapa actualmente seleccionado cuando bit a bit se desplaza 2 a la derecha\n* (copystring) use el mapa seleccionado actualmente para obtener las habitaciones del piso del mapa seleccionado\n* (copystring) Actualizar el mapa solo una vez al iniciar el adaptador\n\n* (cadena de copia) Enviar automáticamente el mapa actual a la interfaz web al actualizar el mapa* (cadena de copia) Actualizar el resumen de limpieza solo una vez después de la limpieza y una vez al inicio\n\n* (copystring) Implemente el cargador y el ángulo del robot en el mapa\n* (copystring) Fijar posiciones de zona\n* (copystring) La localización no debería ser un error. Haz de esto una información en su lugar\n* (copystring) Corregir la posición y rotación del robot\n* (copystring) Arreglar la detección de la ruta del trapeador al inicio del robot\n* (copystring) No procesar is_Locating para iniciar el actualizador de mapas\n* (copystring) Agregue ir a e ir a la función de ruta predicha en la interfaz web\n* (copystring) Hace que la ruta real sea ligeramente transparente\n* (copystring) Nueva imagen de robot en el mapa\n* (copystring) Agregar pausa, detener, botones de acoplamiento a la interfaz web\n* (copystring) Vuelva a conectar websocket después de 10 segundos de desconexión\n* (copystring) Eliminar llamadas innecesarias a getMap()\n* (copystring) Mejorar la lógica de reconexión\n* (cadena de texto) Agregar centinela\n* (copystring) Estado correcto de mop_mode\n* (cadena de texto) Agregue la vida útil de los consumibles en porcentaje",
        "pl": "* (copystring) Napraw wiele moich naprawdę gównianych współrzędnych robota i kodu XY pikseli\n* (copystring) Naprawiono łączenie się z websocket dla hostów z więcej niż jedną kartą sieciową\n* (copystring) Wyłącz przyciski na interfejsie internetowym, gdy nie można ich użyć\n* (copystring) Usprawniono usuwanie/dodawanie stref w interfejsie WWW\n* (copystring) map_status aktualnie wybrana mapa po przesunięciu bitowym o 2 w prawo\n* (copystring) użyj aktualnie wybranej mapy, aby uzyskać pokoje na piętrze wybranej mapy\n* (copystring) Aktualizuj mapę tylko raz podczas uruchamiania adaptera\n\n* (copystring) Automatycznie wysyłaj bieżącą mapę do interfejsu sieciowego podczas aktualizacji mapy* (copystring) Aktualizuj czyste podsumowanie tylko raz po czyszczeniu i raz na początku\n\n* (copystring) Ładowarka narzędzia i kąt robota na mapie\n* (copystring) Napraw pozycje stref\n* (copystring) Lokalizacja nie powinna być błędem. Zamiast tego ustaw to jako informację\n* (copystring) Napraw pozycję i obrót robota\n* (copystring) Naprawiono wykrywanie ścieżki mopa na starcie robota\n* (copystring) Nie przetwarzaj is_Locating w celu uruchomienia aktualizatora map\n* (copystring) Dodaj funkcję przejścia do i przejścia do przewidywanej ścieżki w interfejsie internetowym\n* (copystring) Spraw, aby rzeczywista ścieżka była nieco przezroczysta\n* (copystring) Nowy obraz robota na mapie\n* (copystring) Dodaj przyciski pauzy, stopu i stacji dokującej do interfejsu internetowego\n* (copystring) Ponownie podłącz websocket po 10 sekundach rozłączenia\n* (copystring) Usuń niepotrzebne wywołania funkcji getMap().\n* (copystring) Popraw logikę ponownego łączenia\n* (copystring) Dodaj Sentry\n* (copystring) Poprawny stan mop_mode\n* (copystring) Dodaj żywotność materiałów eksploatacyjnych w procentach",
        "uk": "* (копіювальний рядок) Виправити багато моїх серйозно поганих координат робота та піксельного коду XY\n* (copystring) Виправлено підключення до websocket для хостів з більш ніж однією мережевою картою\n* (копіювальний рядок) Вимкніть кнопки у веб-інтерфейсі, якщо ними не можна скористатися\n* (копіювальний рядок) Покращено зони видалення/додавання у веб-інтерфейсі\n* (копіювальний рядок) map_status поточна вибрана карта при побітовому зсуві на 2 вправо\n* (рядок копіювання) використовувати поточну вибрану карту, щоб отримати поверхи вибраної карти\n* (copystring) Оновлювати карту лише один раз під час запуску адаптера\n\n* (copystring) Автоматично надсилати поточну карту до веб-інтерфейсу під час оновлення карти* (copystring) Оновлювати чистий підсумок лише один раз після очищення та один раз на початку\n\n* (копіювальний рядок) Кут зарядного пристрою та робота на карті\n* (copystring) Виправити позиції зон\n* (copystring) Пошук не має бути помилкою. Натомість зробіть це інформацією\n* (копіювальний рядок) Виправлення положення та обертання робота\n* (копіювальний рядок) Виправлено виявлення швабри під час запуску робота\n* (копіювальний рядок) Не обробляти is_Locating для запуску програми оновлення карти\n* (копіювальний рядок) Додайте функцію переходу до передбаченого шляху та переходу до нього у веб-інтерфейсі\n* (копіювальний рядок) Зробіть фактичний шлях трохи прозорим\n* (копіювальний рядок) Нове зображення робота на карті\n* (копіювальний рядок) Додайте кнопки паузи, зупинки та закріплення до веб-інтерфейсу\n* (копіювальний рядок) Повторно підключіть веб-сокет через 10 секунд після відключення\n* (copystring) Видаліть непотрібні виклики getMap().\n* (копіювальний рядок) Покращено логіку повторного підключення\n* (копіювальний рядок) Додати Sentry\n* (копіювальний рядок) Правильний стан mop_mode\n* (рядок копіювання) Додати ресурс витратних матеріалів у відсотках",
        "zh-cn": "* (copystring) 修复了很多我严重糟糕的机器人坐标和像素 XY 代码\n* (copystring) 修复连接到具有多个网卡的主机的 websocket\n* (copystring) 无法使用时禁用 web 界面上的按钮\n* (copystring) 改进网络界面中的删除/添加区域\n* (copystring) map_status 按位向右移动 2 时当前选择的地图\n* (copystring) 使用当前选中的地图获取选中地图的楼层房间\n* (copystring) 仅在适配器启动时更新地图一次\n\n*（copystring）更新地图时自动将当前地图发送到网络界面*（copystring）仅在清洁后和开始时更新清洁摘要\n\n* (copystring) 在地图上实现充电器和机器人角度\n*（复制字符串）固定区域位置\n* (copystring) 定位应该不会出错。改为将其设为信息\n* (copystring) 固定机器人位置和旋转\n* (copystring) 修复机器人启动时的拖把路径检测\n* (copystring) 不要处理 is_Locating 以启动地图更新程序\n* (copystring) 在 web 界面中添加 go to 和 go to predicted path 功能\n* (copystring) 使实际路径稍微透明\n*（复制字符串）地图上的新机器人图像\n* (copystring) 添加暂停、停止、停靠按钮到 web 界面\n* (copystring) 断开连接 10 秒后重新连接 websocket\n* (copystring) 删除不必要的 getMap() 调用\n* (copystring) 改进重连逻辑\n* (copystring) 添加哨兵\n* (copystring) 正确的 mop_mode 状态\n* (copystring) 添加耗材寿命百分比"
      },
      "0.0.10-alpha.0": {
        "en": "Fix a few lint errors and fix bugs regarding zone cleaning (JSON conversion to string and back to JSON)",
        "de": "Behoben Sie ein paar lint Fehler und beheben Fehler in Bezug auf die Zonenreinigung (JSON Konvertierung in String und zurück zu JSON)",
        "ru": "Исправление нескольких ошибок мазь и исправление ошибок относительно очистки зоны (Конверсия JSON в строку и обратно в JSON)",
        "pt": "Corrigir alguns erros de lint e corrigir bugs sobre limpeza de zona (conversão JSON para string e volta para JSON)",
        "nl": "Maak een paar lint fouten en maak insecten met betrekking tot het schoonmaken van de zone",
        "fr": "Correction de quelques erreurs lint et correction de bugs concernant le nettoyage des zones (conversion JSON à chaîne et retour à JSON)",
        "it": "Risolvi alcuni errori lint e correggi i bug relativi alla pulizia della zona (conversione JSON alla stringa e ritorno a JSON)",
        "es": "Arregla algunos errores de lint y corrige fallos relativos a la limpieza de zonas (conversión de JSON a cadena y regreso a JSON)",
        "pl": "Fix kilka błędów lintowych i naprawia błędy dotyczące oczyszczania strefy (JSON) na smycz i z powrotem do JSON)",
        "uk": "Виправлення декількох помилок і виправлення помилок щодо очищення зони (перетворення JSON на рядок і назад в JSON)",
        "zh-cn": "在清理区(JSON转成特区和后回合)方面,有几处错误和固定装置。"
      },
      "0.0.9-alpha.0": {
        "en": "Added zone cleaning",
        "de": "Reinigung der Zone",
        "ru": "Добавлена уборка зоны",
        "pt": "Limpeza de zona adicionada",
        "nl": "Gevoegd zone schoonmaken",
        "fr": "Nettoyage des zones",
        "it": "Pulizia zona aggiuntiva",
        "es": "Limpieza de zona",
        "pl": "Strefa sprzątania",
        "uk": "Додана зона очищення",
        "zh-cn": "增加清理区"
      }
    },
    "titleLang": {
      "en": "Roborock",
      "de": "Roborock",
      "ru": "Роборок",
      "pt": "Roborock",
      "nl": "Roborock",
      "fr": "Roborock",
      "it": "Roborock",
      "es": "roborock",
      "pl": "Roborock",
      "uk": "Роборок",
      "zh-cn": "石头"
    },
    "desc": {
      "en": "roborock",
      "de": "Roborock",
      "ru": "роборок",
      "pt": "roborock",
      "nl": "roborock",
      "fr": "roborock",
      "it": "Roborock",
      "es": "roborock",
      "pl": "roborock",
      "uk": "Роборок",
      "zh-cn": "机器人摇滚"
    },
    "authors": [
      "copystring <copystring@gmail.com>"
    ],
    "keywords": [
      "roborock",
      "template",
      "home automation"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "roborock.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/copystring/ioBroker.roborock/main/admin/roborock.png",
    "readme": "https://github.com/copystring/ioBroker.roborock/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "household",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.13"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://40474f3cac0c421c85afce616de6ec2d@o4504748727664640.ingest.sentry.io/4504748727664640"
      }
    }
  },
  "encryptedNative": [
    "username",
    "password"
  ],
  "protectedNative": [
    "username",
    "password"
  ],
  "native": {
    "enable_map_creation": false,
    "map_creation_interval": 2,
    "map_scale": 2,
    "updateInterval": 60,
    "webserverPort": 6824
  },
  "objects": [],
  "instanceObjects": []
}
