{
  "meta": {
    "languages": [
      "zh",
      "en",
      "fr",
      "de",
      "es",
      "ko",
      "ru",
      "he",
      "id",
      "pl",
      "ro",
      "th",
      "uk",
      "it",
      "ja",
      "vi",
      "pt",
      "ms",
      "tr",
      "es-LA",
      "ar",
      "zh-Hant",
      "cs",
      "hu",
      "sk",
      "da",
      "fi",
      "nb",
      "nl",
      "sv"
    ],
    "generated": "2026-01-03T20:45:22.399Z"
  },
  "fault_codes": {
    "0": {
      "internal": "F_0"
    },
    "407": {
      "internal": "F_407",
      "zh": {
        "title": "机器人运行中，本次定时任务取消"
      },
      "en": {
        "title": "Cleaning in progress. Scheduled cleanup ignored."
      },
      "fr": {
        "title": "Nettoyage en cours. Nettoyage programmé ignoré."
      },
      "de": {
        "title": "Reinigung läuft. Geplante Reinigung ignoriert."
      },
      "es": {
        "title": "Limpieza en curso. Se ha ignorado la limpieza programada."
      },
      "ko": {
        "title": "현재 기기가 청소 중이므로 예약 청소를 수행할 수 없습니다."
      },
      "ru": {
        "title": "Робот выполняет уборку. Запланированная уборка не будет выполнена."
      },
      "he": {
        "title": "הניקיון בעיצומו. מתעלם מהניקיון המתוזמן."
      },
      "id": {
        "title": "Pembersihan sedang berlangsung. Pembersihan terjadwal diabaikan."
      },
      "pl": {
        "title": "Sprzątanie w toku. Zaplanowane sprzątanie zostało zignorowane."
      },
      "ro": {
        "title": "Curățare în curs. Curățarea planificată a fost ignorată."
      },
      "th": {
        "title": "กำลังดำเนินการทำความสะอาด ละทิ้งการทำความสะอาดตามกำหนดเวลาแล้ว"
      },
      "uk": {
        "title": "Триває прибирання. Заплановане прибирання проігноровано."
      },
      "it": {
        "title": "Pulizia in corso. Pulizia programmata ignorata."
      },
      "ja": {
        "title": "ロボット掃除機は現在掃除中なので、予約した掃除は無効になります。"
      },
      "vi": {
        "title": "Đang làm sạch. Đã bỏ qua dọn dẹp theo lịch."
      },
      "pt": {
        "title": "Limpeza em curso. Limpeza programada ignorada."
      },
      "ms": {
        "title": "Pembersihan sedang dijalankan. Pembersihan berjadual diabaikan."
      },
      "tr": {
        "title": "Temizlik devam ediyor. Programlanmış temizlik göz ardı edildi."
      },
      "es-LA": {
        "title": "Limpieza en curso. La limpieza programada se ha ignorado."
      },
      "ar": {
        "title": "جارٍ التنظيف. تم تجاهل التنظيف المجدول."
      },
      "zh-Hant": {
        "title": "掃地機器人運作中，本次排程任務取消"
      },
      "cs": {
        "title": "Probíhá úklid. Plánovaný úklid ignorován."
      },
      "hu": {
        "title": "Takarítás folyamatban. A beütemezett takarítás figyelmen kívül hagyva."
      },
      "sk": {
        "title": "Prebieha čistenie. Naplánované čistenie je ignorované."
      },
      "da": {
        "title": "Rengøring i gang. Planlagt oprydning ignoreret."
      },
      "fi": {
        "title": "Siivous käynnissä. Ajastettu siivous ohitettu."
      },
      "nb": {
        "title": "Rengjøring pågår. Planlagt rengjøring ignorert."
      },
      "nl": {
        "title": "Reiniging wordt uitgevoerd. Geplande reinigingsbeurt genegeerd."
      },
      "sv": {
        "title": "Städning pågår. Schemalagd städning ignoreras."
      }
    },
    "500": {
      "internal": "F_500",
      "zh": {
        "title": "请拨动激光测距传感器，确认无遮挡或被卡住",
        "summary": "激光测距传感器被遮挡或被异物卡住，请拨动激光头，清除遮挡物或异物；\\n如无需清除，请移到新位置启动。"
      },
      "en": {
        "title": "LiDAR turret or laser blocked. Check for obstruction and retry.",
        "summary": "LiDAR sensor obstructed or stuck. Remove foreign objects if any. If the problem persists, move the robot away and restart."
      },
      "fr": {
        "title": "Tourelle LiDAR ou laser bloqué. Vérifiez qu'il n'y a pas d’obstruction et réessayez.",
        "summary": "Capteur LiDAR obstrué ou coincé. Retirez tout corps étranger. Si le problème persiste, déplacez le robot et redémarrez le nettoyage."
      },
      "de": {
        "title": "LiDAR-Sensor oder Laser blockiert. Prüfe Blockierungen und versuche es erneut.",
        "summary": "LiDAR-Sensor blockiert oder festgefahren. Entferne eventuell vorhandene Fremdkörper. Wenn das Problem weiterhin besteht, bewege den Roboter weg und starte ihn neu."
      },
      "es": {
        "title": "Torre LiDAR o láser bloqueado. Compruebe si hay alguna obstrucción y vuelva a intentarlo.",
        "summary": "El sensor LiDAR está obstruido o atascado. Retire cualquier posible objeto extraño. Si el problema persiste, cambie de sitio el robot aspirador y reinicie."
      },
      "ko": {
        "title": "레이저 거리측정 센서의 헤드를 돌려 가려짐 또는 걸림 현상이 있는지 확인하세요.",
        "summary": "레이저 거리측정 센서가 가려지거나 걸렸다면 레이저 헤드를 돌려 가리는 장애물 또는 이물질을 제거하세요. 그렇지 않으면 기기를 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Заблокирован модуль лидара или лазер. Убедитесь в отсутствии препятствий и повторите попытку.",
        "summary": "Лидар засорен или заблокирован. Проверьте и удалите посторонние предметы. Если проблема сохраняется, переместите робота в другое место и перезапустите."
      },
      "he": {
        "title": "צריח LiDAR או קרן הלייזר חסומים. בדקו אם ישנה חסימה ונסו שנית",
        "summary": "חיישן LiDAR חסום או נתקע. הסירו חפצים זרים אם קיימים. אם הבעיה נמשכת, הרחיקו את רובוט והפעלו מחדש."
      },
      "id": {
        "title": "Menara LiDAR atau laser terhalang. Periksa jika ada penghalang dan coba lagi.",
        "summary": "Sensor LiDAR terhalang atau macet. Singkirkan benda asing, jika ada. Jika masalah tetap berlanjut, pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Wieżyczka lub laser LiDAR są zablokowane. Sprawdź, czy nie ma przeszkód, i spróbuj ponownie.",
        "summary": "Czujnik LiDAR jest zasłonięty lub zablokowany. Usuń wszystkie ciała obce. Jeśli wciąż występuje problem, przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Turelă LiDAR sau laser blocată. Căutați eventualele obstrucții și încercați din nou.",
        "summary": "Senzor LiDAR obstrucționat sau blocat. Îndepărtați obiectele străine, dacă există. Dacă problema persistă, mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "ตัวยิงสัญญาณ LiDAR หรือเลเซอร์ถูกปิดกั้น ตรวจสอบการกีดขวางแล้วลองอีกครั้ง",
        "summary": "เซนเซอร์ LiDAR ถูกกีดขวางหรือติดอยู่ นำวัตถุแปลกปลอมออกหากมี หากยังคงเกิดปัญหา ให้เคลื่อนย้ายหุ่นยนต์ออกแล้วเริ่มใหม่"
      },
      "uk": {
        "title": "Заблоковано систему лазерного локатора або лазер. Перевірте наявність перешкод і повторіть спробу.",
        "summary": "Сенсор лазерного локатора закрито або заблоковано. Видаліть сторонні предмети, якщо такі є. Якщо проблема зберігається, заберіть робота й перезавантажте його."
      },
      "it": {
        "title": "Torretta o laser LiDAR bloccati. Verificare la presenza di una ostruzione e riprovare.",
        "summary": "Sensore LiDAR ostruito o bloccato. Rimuovere eventuali oggetti estranei. Se il problema persiste, allontanare il robot e riavviarlo."
      },
      "ja": {
        "title": "レーザー距離センサーがブロックされました。障害物を確認してから再試行してください。",
        "summary": "LiDARセンサーが遮断されているか、動かなくなっています。異物があれば取り除いてください。問題が解決しない場合は、本体を移動させてから再起動してください。"
      },
      "vi": {
        "title": "Tháp LiDAR hoặc laser bị chặn. Hãy kiểm tra xem có vật cản không và thử lại.",
        "summary": "Cảm biến LiDAR bị cản trở hoặc kẹt. Loại bỏ vật thể lạ nếu có. Nếu sự cố vẫn tiếp diễn, hãy di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "Torre ou laser LiDAR bloqueado. Verifique se existe alguma obstrução e tente novamente.",
        "summary": "Sensor LiDAR obstruído ou preso. Remova objetos estranhos, se existirem. Se o problema persistir, afaste o robô e reinicie."
      },
      "ms": {
        "title": "Turet atau laser LiDAR tersekat. Periksa halangan dan cuba semula.",
        "summary": "Penderia LiDAR terhalang atau tersekat. Alih keluar objek asing jika ada. Jika masalah berlanjutan, alihkan robot ke tempat lain dan mulakan semula."
      },
      "tr": {
        "title": "LiDAR tareti veya lazer engelleniyor. Tıkanıklık olup olmadığını kontrol edin ve yeniden deneyin.",
        "summary": "LiDAR sensörü engellenmiş veya sıkışmış. Varsa yabancı cisimleri çıkarın. Sorun devam ederse, robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "La torreta LiDAR o el láser están bloqueados. Verifique que no haya obstrucciones y vuelva a intentarlo.",
        "summary": "El sensor LiDAR está obstruido o atascado. Si hay objetos extraños, quítelos. Si el problema persiste, aleje el robot y reinícielo."
      },
      "ar": {
        "title": "تم حظر برج LiDAR أو الليزر. تأكد من عدم وجود أي عائق وحاول مرةً أخرى.",
        "summary": "مستشعر LiDAR مسدود أو عالق. أزل الأجسام الغريبة، إن وجدت. إذا استمرت المشكلة، فحرك الروبوت بعيدًا وأعد تشغيله."
      },
      "zh-Hant": {
        "title": "請適當調整雷射測距感測器，確保無遮擋或被卡住",
        "summary": "雷射測距感測器被遮擋或被異物卡住，請調整雷射頭，同時清除遮擋物或異物；如無需清除，請移到新位置後啟動。"
      },
      "cs": {
        "title": "Věž LiDAR nebo laser je blokován. Zkontrolujte, zda není před ním překážka, a zkuste to znovu.",
        "summary": "Snímač LiDAR je zakrytý nebo zaseknutý. Odstraňte případné cizí předměty. Pokud problém přetrvává, robot odsuňte a restartujte."
      },
      "hu": {
        "title": "LiDAR-torony vagy lézer akadályozva. Ellenőrizze, hogy nincs-e akadály, és próbálja meg újra.",
        "summary": "A LiDAR-érzékelő el van takarva vagy beragadt. Távolítsa el az idegen tárgyakat, ha vannak. Ha a probléma továbbra is fennáll, helyezze arrébb a robotot, és indítsa újra."
      },
      "sk": {
        "title": "Zablokovaná veža LiDAR alebo laser. Skontrolujte vzhľadom na prekážky a skúste znova.",
        "summary": "Snímač LiDAR je zablokovaný alebo zaseknutý. Odstráňte prípadné cudzie objekty. Ak problém pretrváva, odsuňte robot a znova ho spustite."
      },
      "da": {
        "title": "LiDAR-tårn eller laserblokeret. Tjek for forhindringer, og prøv igen.",
        "summary": "LiDAR-sensoren er blokeret eller sidder fast. Fjern eventuelle fremmedlegemer. Hvis problemet fortsætter, flyt robotten væk og genstart."
      },
      "fi": {
        "title": "LiDAR-torni tai laser on estynyt. Tarkista esteet ja yritä uudelleen.",
        "summary": "LiDAR-anturi on tukossa tai jumissa. Poista vieraat esineet, jos niitä on. Jos ongelma jatkuu, siirrä robotti pois ja käynnistä uudelleen."
      },
      "nb": {
        "title": "LiDAR dreiesylinder eller laser blokkert. Se etter hindring og prøv på nytt.",
        "summary": "LiDAR-sensoren er blokkert eller sitter fast. Fjern eventuelle fremmedlegemer. Hvis problemet vedvarer, flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "LiDAR-sensor of -laser geblokkeerd. Controleer op belemmeringen en probeer het opnieuw.",
        "summary": "LiDAR-sensor geblokkeerd of vastgelopen. Verwijder eventuele vreemde voorwerpen indien aanwezig. Als het probleem aanhoudt, verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "LiDAR-torn eller laser blockerad. Sök efter hinder och försök igen.",
        "summary": "LiDAR-sensorn är övertäckt eller har fastnat Avlägsna eventuella främmande föremål. Om problemet kvarstår kan du behöva flytta roboten och starta om."
      }
    },
    "501": {
      "internal": "F_501",
      "zh": {
        "title": "主机悬空，请将主机移到新位置启动",
        "summary": "主机悬空，请移动到新位置启动；\\n悬崖传感器太脏也可能导致该故障，请擦拭悬崖传感器排除。"
      },
      "en": {
        "title": "Robot suspended. Move the robot away and restart.",
        "summary": "Robot suspended. Move the robot away and restart. Cliff sensors dirty. Wipe them clean."
      },
      "fr": {
        "title": "Robot suspendu. Déplacez le robot et redémarrez le nettoyage.",
        "summary": "Robot suspendu. Déplacez le robot et redémarrez le nettoyage. Les capteurs de vide sont sales. Essuyez-les pour les nettoyer."
      },
      "de": {
        "title": "Roboter angehalten. Bewege den Roboter und starte ihn neu.",
        "summary": "Roboter angehalten. Bewege den Roboter und starte ihn neu. Klippensensoren schmutzig. Wische sie sauber."
      },
      "es": {
        "title": "Robot suspendido. Traslade el robot aspirador a otra ubicación y reinicie la limpieza.",
        "summary": "Robot suspendido. Traslade el robot aspirador a otra ubicación y reinicie la limpieza. Sensores de desnivel sucios. Límpielos."
      },
      "ko": {
        "title": "본체가 지면과 닿지 않았습니다. 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "본체가 지면과 닿지 않으면 새로운 위치로 옮겨 다시 시작하세요. 낙하 방지 센서가 오염된 경우에도 해당 오류를 유발할 수 있습니다. 낙하 방지 센서를 닦아내세요."
      },
      "ru": {
        "title": "Робот повис в воздухе. Переместите робота в другое место и перезапустите.",
        "summary": "Робот повис в воздухе. Переместите робота в другое место и перезапустите. Загрязнены датчики обнаружения уступов. Протрите их."
      },
      "he": {
        "title": "רובוט מושעה. הרחיקו את רובוט והפעילו מחדש.",
        "summary": "רובוט מושעה. הרחיקו את רובוט. \\\\n חיישני הצוק מלוכלך. נגבו אותם לניקוי."
      },
      "id": {
        "title": "Robot terhenti. Pindahkan robot dan mulai ulang.",
        "summary": "Robot terhenti. Pindahkan robot dan mulai ulang. Sensor turunan kotor. Bersihkan."
      },
      "pl": {
        "title": "Robot zawieszony. Przenieś robota i uruchom ponownie.",
        "summary": "Robot zawieszony. Przenieś robota i uruchom ponownie. Zanieczyszczone czujniki krawędzi. Należy je wyczyścić."
      },
      "ro": {
        "title": "Robot suspendat. Mutați robotul și porniți-l din nou.",
        "summary": "Robot suspendat. Mutați robotul și porniți-l din nou. Senzorii de zonă abruptă sunt murdari. Curățați-i."
      },
      "th": {
        "title": "หุ่นยนต์ระงับการทำงาน ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่",
        "summary": "หุ่นยนต์ระงับการทำงาน ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่ เซนเซอร์จุดตกขอบสกปรก โปรดเช็ดทำความสะอาด"
      },
      "uk": {
        "title": "Робот завис. Заберіть робота й перезавантажте його.",
        "summary": "Робот завис. Заберіть робота й перезавантажте його. Забруднення датчиків перепаду висоти. Витріть їх начисто."
      },
      "it": {
        "title": "Robot sospeso. Allontanare il robot e riavviarlo.",
        "summary": "Robot sospeso. Allontanare il robot e riavviarlo. Sensori di caduta sporchi. Pulirli."
      },
      "ja": {
        "title": "ロボット掃除機が停止しました。ロボット掃除機を移動させてから再起動してください。",
        "summary": "本体が停止しました。本体を移動させてから再起動してください。落下防止センサーが汚れています。きれいに拭いてください。"
      },
      "vi": {
        "title": "Đã tạm ngừng robot. Di chuyển robot ra xa và khởi động lại.",
        "summary": "Đã tạm ngừng robot. Di chuyển robot ra xa và khởi động lại. Cảm biến vách ngăn bị bẩn. Lau sạch."
      },
      "pt": {
        "title": "Robô suspenso. Afaste o robô e reinicie.",
        "summary": "Robô suspenso. Afaste o robô. Sensores de penhasco sujos. Limpe-os."
      },
      "ms": {
        "title": "Robot digantung tugas. Alihkan robot ke tempat lain dan mulakan semula.",
        "summary": "Robot digantung tugas. Alihkan robot ke tempat lain dan mulakan semula. Sensor tebing kotor. Lap sensor hingga bersih."
      },
      "tr": {
        "title": "Robot havada asılı kalmış. Robotu uzaklaştırın ve yeniden başlatın.",
        "summary": "Robot havada asılı kalmış. Robotu uzaklaştırın ve yeniden başlatın. Yükseklik sensörleri kirli. Silerek temizleyin."
      },
      "es-LA": {
        "title": "El robot está suspendido. Aléjelo y reinícielo.",
        "summary": "El robot está suspendido. Aléjelo y reinícielo. Los sensores de precipicio están sucios. Límpielos."
      },
      "ar": {
        "title": "توقف الروبوت. حرك الروبوت بعيدًا وأعد تشغيله.",
        "summary": "توقف الروبوت. حرك الروبوت بعيدًا وأعد تشغيله. مستشعرات المنحدرات متسخة. امسحها لتنظيفها."
      },
      "zh-Hant": {
        "title": "主機懸空，請將主機移到新位置後啟動",
        "summary": "主機懸空，請移動到新位置後啟動；落差感測器過髒也可能導致該故障，請擦拭落差感測器以排除問題。"
      },
      "cs": {
        "title": "Robot se zasekl. Robot odsuňte a restartujte.",
        "summary": "Robot se zasekl. Robot odsuňte a restartujte. Špinavé snímače srázu. Otřete je."
      },
      "hu": {
        "title": "Robot a levegőben. Helyezze arrébb a robotot, és indítsa újra.",
        "summary": "Robot a levegőben. Helyezze arrébb a robotot, és indítsa újra. A peremérzékelők piszkosak. Tisztítsa meg őket."
      },
      "sk": {
        "title": "Robot sa zastavil. Posuňte robot ďalej a reštartujte ho.",
        "summary": "Robot sa zastavil. Posuňte robot ďalej a reštartujte ho. Snímače zrázu sú znečistené. Vyčistite ich."
      },
      "da": {
        "title": "Robot suspenderet. Flyt robotten væk og genstart.",
        "summary": "Robot suspenderet. Flyt robotten væk og genstart. Klippesensorer snavset. Tør dem af."
      },
      "fi": {
        "title": "Robotti ilmassa. Siirrä robotti pois ja käynnistä uudelleen.",
        "summary": "Robotti ilmassa. Siirrä robotti pois ja käynnistä uudelleen. Reuna-anturit ovat likaiset. Pyyhi ne puhtaiksi."
      },
      "nb": {
        "title": "Robot suspendert. Flytt roboten bort og start på nytt.",
        "summary": "Robot suspendert. Flytt roboten bort og start på nytt. Klippesensorer skitne. Tørk dem rene."
      },
      "nl": {
        "title": "Robot opgeschort. Verplaats de robot en start opnieuw op.",
        "summary": "Robot opgeschort. Verplaats de robot en start opnieuw op. Afgrondsensoren zijn vuil. Veeg ze schoon."
      },
      "sv": {
        "title": "Roboten hänger. Flytta roboten och starta om.",
        "summary": "Roboten hänger. Flytta roboten och starta om. Trappsensorerna är smutsiga. Torka rent dem."
      }
    },
    "502": {
      "internal": "F_502",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "503": {
      "internal": "F_503",
      "zh": {
        "title": "请确认尘盒及滤网已安装好",
        "summary": "请装回尘盒及滤网，并确认安装到位；\\n如已安装到位仍然报错，请尝试更换滤网。"
      },
      "en": {
        "title": "Check that the dustbin and filter are installed properly.",
        "summary": "Reinstall the dustbin and filter in place.\\nIf the problem persists, replace the filter."
      },
      "fr": {
        "title": "Vérifiez que le bac à poussière et le filtre sont installés correctement.",
        "summary": "Remettez en place le bac à poussière et le filtre.\\nSi le problème persiste, remplacez le filtre."
      },
      "de": {
        "title": "Überprüfe, ob der Staubbehälter und der Filter ordnungsgemäß installiert sind.",
        "summary": "Installiere den Staubbehälter und den Filter erneut.\\nWenn das Problem weiterhin besteht, ersetze den Filter."
      },
      "es": {
        "title": "Asegúrese de que el depósito de polvo y el filtro estén bien instalados.",
        "summary": "Vuelva a instalar el depósito de polvo y el filtro en su sitio.\\nSi el problema persiste, sustituya el filtro."
      },
      "ko": {
        "title": "먼지통 및 필터가 제대로 장착되었는지 확인하세요.",
        "summary": "먼지통과 필터를 제자리에 정확하게 장착하세요. 정확하게 장착해도 오류가 지속되면 필터를 교체해 보세요"
      },
      "ru": {
        "title": "Убедитесь, что контейнер для сбора пыли и фильтр установлены надлежащим образом.",
        "summary": "Установите контейнер для сбора пыли и фильтр на место.\\nЕсли проблема сохраняется, замените фильтр."
      },
      "he": {
        "title": "בדקו שפח האשפה והפילטר מותקנים כהלכה.",
        "summary": "התקינו מחדש את פח האשפה והפילטר במקום.\\nאם הבעיה נמשכת, החליפו את המסנן."
      },
      "id": {
        "title": "Periksa jika tempat sampah dan filter terpasang dengan benar.",
        "summary": "Pasang kembali tempat sampah dan filter pada tempatnya.\\nJika masalah berlanjut, ganti filternya."
      },
      "pl": {
        "title": "Sprawdź, czy pojemnik na kurz i filtr są poprawnie zamontowane.",
        "summary": "Ponownie zamocuj pojemnik na kurz i filtr.\\nJeśli problem się utrzymuje, wymień filtr."
      },
      "ro": {
        "title": "Verificați dacă coșul de gunoi și filtrul sunt montate corect.",
        "summary": "Remontați coșul de gunoi și filtrul.\\nDacă problema persistă, înlocuiți filtrul."
      },
      "th": {
        "title": "ตรวจสอบว่ากล่องเก็บฝุ่นและไส้กรองติดตั้งอย่างเหมาะสมหรือไม่",
        "summary": "ติดตั้งกล่องเก็บฝุ่นและไส้กรองให้เข้าที่ใหม่อีกครั้ง หากยังคงเกิดปัญหา ให้เปลี่ยนไส้กรอง"
      },
      "uk": {
        "title": "Перевірте правильність установлення пилозбірника та фільтра.",
        "summary": "Установіть пилозбірник і фільтр на місце.\\nЯкщо проблема залишиться, замініть фільтр."
      },
      "it": {
        "title": "Controllare che il cestino della polvere e il filtro siano installati correttamente.",
        "summary": "Reinstallare il cestino della polvere e il filtro al loro posto.\\nSe il problema persiste, sostituire il filtro."
      },
      "ja": {
        "title": "ダストボックスとフィルタが正しく取り付けられていることを確認してください。",
        "summary": "ダストボックスとフィルターを所定の位置に再度取り付けてください。\\n問題が解決しない場合は、フィルターを交換してください。"
      },
      "vi": {
        "title": "Kiểm tra xem thùng đựng bụi và bộ lọc đã được lắp đúng cách chưa.",
        "summary": "Lắp lại thùng đựng bụi và bộ lọc vào đúng vị trí.\\nNếu sự cố vẫn tiếp diễn, hãy thay bộ lọc."
      },
      "pt": {
        "title": "Verifique se o compartimento do lixo e o filtro estão corretamente instalados.",
        "summary": "Reinstale o compartimento do lixo e o filtro corretamente.\\nSe o problema persistir, substitua o filtro."
      },
      "ms": {
        "title": "Periksa sama ada tong sampah dan penapis dipasang dengan betul.",
        "summary": "Pasang semula tong sampah dan penapis di tempatnya.\\nJika masalah berterusan, gantikan penapis."
      },
      "tr": {
        "title": "Çöp kutusunun ve filtrenin doğru takılıp takılmadığını kontrol edin.",
        "summary": "Çöp kutusunun ve filtreyi tekrar yerine takın.\\nSorun devam ederse filtreyi değiştirin."
      },
      "es-LA": {
        "title": "Compruebe que el contenedor de polvo y el filtro estén instalados correctamente.",
        "summary": "Vuelva a colocar el contenedor de polvo y el filtro en su lugar.\\nSi el problema persiste, reemplace el filtro."
      },
      "ar": {
        "title": "تحقق من أن صندوق الأتربة والفلتر مركبان بشكل صحيح.",
        "summary": "أعد تثبيت صندوق الأتربة والفلتر في مكانهما.\\nإذا استمرت المشكلة، فاستبدل الفلتر."
      },
      "zh-Hant": {
        "title": "請確認塵盒及濾網已安裝妥當",
        "summary": "請裝回塵盒及濾網，並確認安裝到位；\\n若已安裝到位仍然提示異常，請嘗試更換濾網。"
      },
      "cs": {
        "title": "Zkontrolujte, zda jsou nádoba na prach a filtr správně nainstalovány.",
        "summary": "Znovu nainstalujte nádobu na prach a filtr na místo.\\nPokud problém přetrvává, vyměňte filtr."
      },
      "hu": {
        "title": "Ellenőrizze, hogy a portartály és a szűrő megfelelően van-e behelyezve.",
        "summary": "Helyezze vissza a portartályt és a szűrőt a helyére.\\nHa a probléma továbbra is fennáll, cserélje ki a szűrőt."
      },
      "sk": {
        "title": "Skontrolujte, či je správne nainštalovaná nádoba na prach a filter.",
        "summary": "Znovu nainštalujte nádobu na prach a filter na miesto.\\nAk problém pretrváva, vymeňte filter."
      },
      "da": {
        "title": "Kontroller, at skraldespanden og filteret er installeret korrekt.",
        "summary": "Geninstaller skraldespanden og filteret på plads.\\nHvis problemet fortsætter, skal du udskifte filteret."
      },
      "fi": {
        "title": "Tarkista, että pölysäiliö ja suodatin on asennettu oikein.",
        "summary": "Asenna pölysäiliö ja suodatin uudelleen paikoilleen.\\nJos ongelma jatkuu, vaihda suodatin."
      },
      "nb": {
        "title": "Kontroller at støvbeholderen og filteret er riktig installert.",
        "summary": "Sett støvbeholderen og filteret på plass igjen.\\nHvis problemet vedvarer, bytt filteret."
      },
      "nl": {
        "title": "Controleer of de stofbak en het filter correct zijn geïnstalleerd.",
        "summary": "Installeer de stofbak en het filter opnieuw op de juiste plaats.\\nAls het probleem aanhoudt, moet u het filter vervangen."
      },
      "sv": {
        "title": "Kontrollera att dammbehållaren och filtret sitter som de ska.",
        "summary": "Sätt tillbaka dammbehållren och filtret.\\nByt ut filtret om problemet kvarstår."
      }
    },
    "504": {
      "internal": "F_504",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "505": {
      "internal": "F_505",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "506": {
      "internal": "F_506",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "507": {
      "internal": "F_507",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "508": {
      "internal": "F_508",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "509": {
      "internal": "F_509",
      "zh": {
        "title": "请擦拭悬崖传感器，并移到新位置启动",
        "summary": "悬崖传感器异常，请擦拭悬崖传感器，并移到新位置启动"
      },
      "en": {
        "title": "Cliff sensors error. Clean them, move the robot away from drops, and restart.",
        "summary": "Cliff sensors error. Clean them, move the robot away from drops, and restart."
      },
      "fr": {
        "title": "Erreur des capteurs de vide. Nettoyez-les, éloignez le robot des risques de chute et redémarrez le nettoyage.",
        "summary": "Erreur des capteurs de vide. Nettoyez-les, éloignez le robot des risques de chute et redémarrez le nettoyage."
      },
      "de": {
        "title": "Klippensensor-Fehler. Reinige die Klippensensoren, bewege den Roboter von Stufen weg und starte ihn neu.",
        "summary": "Klippensensor-Fehler. Reinige die Klippensensoren, bewege den Roboter von Stufen weg und starte ihn neu."
      },
      "es": {
        "title": "Error en sensor de desnivel. Limpie los sensores de desnivel, aleje el robot aspirador de zonas por las que pueda caer y reinicie la limpieza.",
        "summary": "Error en sensor de desnivel. Limpie los sensores de desnivel, aleje el robot aspirador de zonas por las que pueda caer y reinicie la limpieza."
      },
      "ko": {
        "title": "낙하 방지 센서를 닦고 기기를 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "낙하 방지 센서의 오류이면 센서를 닦고 기기를 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Ошибка датчиков обнаружения уступов. Очистите их, переместите робота подальше от уступов и перезапустите.",
        "summary": "Ошибка датчиков обнаружения уступов. Очистите их, переместите робота подальше от уступов и перезапустите."
      },
      "he": {
        "title": "טעות בחיישני צוק. נקו אותם, הרחיקו את רובוט מטיפות והפעילו מחדש.",
        "summary": "טעות בחיישני צוק. נקו אותם, הרחיקו את רובוט מטיפות והפעילו מחדש."
      },
      "id": {
        "title": "Kesalahan sensor turunan. Bersihkan, jauhkan robot dari turunan agar tidak terjatuh, lalu mulai ulang.",
        "summary": "Kesalahan sensor turunan. Bersihkan, jauhkan robot dari turunan agar tidak terjatuh, lalu mulai ulang."
      },
      "pl": {
        "title": "Błąd czujników krawędzi. Oczyść je, zabierz robota z miejsca upadku i uruchom ponownie.",
        "summary": "Błąd czujników krawędzi. Oczyść je, zabierz robota z miejsca upadku i uruchom ponownie."
      },
      "ro": {
        "title": "Eroare la senzorii de zonă abruptă. Curățați-i, mutați robotul departe de zona abruptă și porniți-l din nou.",
        "summary": "Eroare la senzorii de zonă abruptă. Curățați-i, mutați robotul departe de zona abruptă și porniți-l din nou."
      },
      "th": {
        "title": "เซนเซอร์ตรวจจับการตกขอบเกิดข้อผิดพลาด ทำความสะอาดเซนเซอร์ ย้ายหุ่นยนต์จากจุดตกขอบ และเริ่มใหม่",
        "summary": "เซนเซอร์ตรวจจับการตกขอบเกิดข้อผิดพลาด ทำความสะอาดเซนเซอร์ ย้ายหุ่นยนต์จากจุดตกขอบ และเริ่มใหม่"
      },
      "uk": {
        "title": "Помилка датчиків перепаду висоти. Очистьте їх, заберіть робота від місця перепаду висоти й перезавантажте.",
        "summary": "Помилка датчиків перепаду висоти. Очистьте їх, заберіть робота від місця перепаду висоти й перезавантажте."
      },
      "it": {
        "title": "Errore dei sensori di caduta. Pulire i sensori di caduta, spostare il robot dal dislivello e riavviare.",
        "summary": "Errore dei sensori di caduta. Pulire i sensori di caduta, spostare il robot dal dislivello e riavviare."
      },
      "ja": {
        "title": "落下防止センサーのエラーです。落下防止センサーを清掃し、ロボット掃除機を落下した場所から移動させて、再起動してください。",
        "summary": "落下防止センサーのエラーです。落下防止センサーを清掃し、ロボット掃除機を落下した場所から移動させて、再起動してください。"
      },
      "vi": {
        "title": "Lỗi cảm biến vách ngăn. Vệ sinh cảm biến, di chuyển robot ra xa khỏi các điểm rơi và khởi động lại.",
        "summary": "Lỗi cảm biến vách ngăn. Vệ sinh cảm biến, di chuyển robot ra xa khỏi các điểm rơi và khởi động lại."
      },
      "pt": {
        "title": "Erro dos sensores de penhasco. Limpe-os, afaste o robô de locais propícios a quedas e reinicie.",
        "summary": "Erro dos sensores de penhasco. Limpe-os, afaste o robô de locais propícios a quedas e reinicie."
      },
      "ms": {
        "title": "Ralat sensor tebing. Bersihkannya, alihkan robot untuk mengelakkannya terjatuh, dan mulakan semula.",
        "summary": "Ralat sensor tebing. Bersihkannya, alihkan robot untuk mengelakkannya terjatuh, dan mulakan semula."
      },
      "tr": {
        "title": "Yükseklik sensörlerinde hata. Sensörleri temizleyin, robotu düşebileceği noktalardan uzaklaştırın ve yeniden başlatın.",
        "summary": "Yükseklik sensörlerinde hata. Sensörleri temizleyin, robotu düşebileceği noktalardan uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "Error en los sensores de precipicio. Límpielos, aleje el robot de zonas en las que podría caerse y reinícielo.",
        "summary": "Error en los sensores de precipicio. Límpielos, aleje el robot de zonas en las que podría caerse y reinícielo."
      },
      "ar": {
        "title": "خطأ في مستشعرات المنحدرات. نظفها، وحرك الروبوت بعيدًا عن المنحدرات وأعد التشغيل.",
        "summary": "خطأ في مستشعرات المنحدرات. نظفها، وحرك الروبوت بعيدًا عن المنحدرات وأعد التشغيل."
      },
      "zh-Hant": {
        "title": "請擦拭落差感測器，並移到新位置後啟動",
        "summary": "落差感測器異常，請擦拭落差感測器，並移到新位置後啟動"
      },
      "cs": {
        "title": "Chyba snímačů srázu. Vyčistěte je, přemístěte robota z místa, kde hrozí pád, a restartujte ho.",
        "summary": "Chyba snímačů srázu. Vyčistěte je, přemístěte robota z místa, kde hrozí pád, a restartujte ho."
      },
      "hu": {
        "title": "Peremérzékelő-hiba. Tisztítsa meg őket, helyezze át a robotot a peremtől, és indítsa újra.",
        "summary": "Peremérzékelő-hiba. Tisztítsa meg őket, helyezze át a robotot a peremtől, és indítsa újra."
      },
      "sk": {
        "title": "Chyba snímačov zrázu. Vyčistite ich, posuňte robot preč od zrázu a reštartujte ho.",
        "summary": "Chyba snímačov zrázu. Vyčistite ich, posuňte robot preč od zrázu a reštartujte ho."
      },
      "da": {
        "title": "Klippesensorfejl. Rengør dem, flyt robotten væk fra kanter, og genstart.",
        "summary": "Klippesensorfejl. Rengør dem, flyt robotten væk fra kanter, og genstart."
      },
      "fi": {
        "title": "Reuna-antureiden virhe. Puhdista ne, siirrä robotti kauemmas pudotuksista ja käynnistä uudelleen.",
        "summary": "Reuna-antureiden virhe. Puhdista ne, siirrä robotti kauemmas pudotuksista ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Klippesensorer feil. Rengjør dem, flytt roboten bort fra dråper og start på nytt.",
        "summary": "Klippesensorer feil. Rengjør dem, flytt roboten bort fra dråper og start på nytt."
      },
      "nl": {
        "title": "Fout bij afgrondsensoren. Maak ze schoon, verplaats de robot weg van afgronden en start opnieuw op.",
        "summary": "Fout bij afgrondsensoren. Maak ze schoon, verplaats de robot weg van afgronden en start opnieuw op."
      },
      "sv": {
        "title": "Fel med trappsensorerna. Rengör dem, flytta undan robot från sänkor och starta om.",
        "summary": "Fel med trappsensorerna. Rengör dem, flytta undan robot från sänkor och starta om."
      }
    },
    "510": {
      "internal": "F_510",
      "zh": {
        "title": "请检查并轻拍碰撞缓冲器，确认未卡住",
        "summary": "碰撞缓冲器被卡住，请多次轻拍排除异物；\\n如无异物，请移动到新位置启动。"
      },
      "en": {
        "title": "Bumper stuck. Clean it and lightly tap to release it.",
        "summary": "Bumper stuck. Tap it repeatedly to release it. If no foreign object exists, move the robot away and restart."
      },
      "fr": {
        "title": "Pare-chocs coincé. Nettoyez-le et tapotez délicatement dessus pour le libérer.",
        "summary": "Pare-chocs coincé. Tapotez dessus à plusieurs reprises pour le libérer. Si aucun corps étranger n'est présent, déplacez le robot et redémarrez le nettoyage."
      },
      "de": {
        "title": "Stoßfänger klemmt. Reinige ihn und klopfe leicht gegen ihn, um ihn zu lösen.",
        "summary": "Stoßfänger klemmt. Tippe wiederholt darauf, um ihn zu lösen. Wenn kein Fremdkörper vorhanden ist, bewege den Roboter weg und starte ihn neu."
      },
      "es": {
        "title": "Parachoques atascado. Límpielo y dele suaves golpecitos para desatascarlo.",
        "summary": "Parachoques atascado. Dele suaves golpecitos para soltarlo. Si no hay objetos extraños, cambie de sitio el robot aspirador y reinicie."
      },
      "ko": {
        "title": "범퍼를 검사하고 가볍게 두드려 걸림 현상이 있는지 확인하세요.",
        "summary": "범퍼가 걸린 경우 여러 번 가볍게 두드려 이물질을 제거하세요. 이물질이 없으면 기기를 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Заклинило бампер. Очистите бампер и осторожно постучите по бамперу, чтобы освободить его.",
        "summary": "Заклинило бампер. Постучите по нему несколько раз, чтобы восстановить подвижность. Если посторонних предметов нет, переместите робота в другое место и перезапустите."
      },
      "he": {
        "title": "הפגוש נתקע. נקו את הפגוש והקישו עליו קלות לשחרור.",
        "summary": "הפגוש תקוע. הקשו עליו מספר פעמים כדי לשחרר אותו.\\\\n\\nאם חפץ זר לא נמצא, הרחקו את הרובוט."
      },
      "id": {
        "title": "Bumper macet. Bersihkan, lalu ketuk perlahan untuk melepaskannya.",
        "summary": "Bumper macet. Ketuk berulang kali untuk melepaskannya. Jika tidak ada benda asing yang menghalangi, pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Zderzak zakleszczony. Wyczyść zderzak i lekko w niego postukaj, aby go uwolnić.",
        "summary": "Zderzak zakleszczony. Stuknij w niego kilka razy, aby go uwolnić. Jeśli nie ma ciał obcych, przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Bară de protecție blocată. Curățați-o și apăsați-o ușor pentru a o elibera.",
        "summary": "Bară de protecție blocată. Apăsați-o ușor în mod repetat pentru a o elibera. Dacă nu există obiecte străine, mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "กันชนติด ทำความสะอาดแล้วเคาะเบาๆ เพื่อให้หลุดออก",
        "summary": "กันชนติด เคาะซ้ำๆ เพื่อให้หลุดออก หากไม่มีวัตถุแปลกปลอม ให้ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่"
      },
      "uk": {
        "title": "Застряг бампер. Очистьте його й злегка постукайте, щоб звільнити.",
        "summary": "Застряг бампер. Постукайте кілька разів, щоб звільнити. Якщо сторонніх предметів немає, заберіть робота й перезавантажте його."
      },
      "it": {
        "title": "Paraurti bloccato. Pulire il paraurti e batterlo leggermente per liberarlo.",
        "summary": "Paraurti bloccato. Batterlo ripetutamente per liberarlo. Se non sono presenti oggetti estranei, allontanare il robot e riavviarlo."
      },
      "ja": {
        "title": "衝突バンパーを確認し、軽く叩いて詰まりがないことを確認してください。",
        "summary": "バンパーが動かなくなっています。軽く叩いて異物を取り除いてください。異物が見当たらない場合は、別の場所に移動して再起動してください。"
      },
      "vi": {
        "title": "Bộ đệm bị kẹt. Làm sạch và nhấn nhẹ để tháo.",
        "summary": "Bộ đệm bị kẹt. Nhấn liên tục để tháo. Nếu không có vật thể lạ nào, hãy di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "O para-choques ficou preso. Limpe-o e toque ligeiramente para o libertar.",
        "summary": "O para-choques ficou preso. Toque-lhe repetidamente para o libertar. Se não existir nenhum objeto estranho, afaste o robô e reinicie."
      },
      "ms": {
        "title": "Bampar tersekat. Bersihkannya dan ketuk dengan perlahan untuk melepaskannya.",
        "summary": "Bampar tersekat. Ketuk berulang kali untuk melepaskannya. Jika tiada objek asing, alihkan robot ke tempat lain dan mulakan semula."
      },
      "tr": {
        "title": "Tampon sıkışmış. Temizleyin ve serbest bırakmak için hafifçe vurun.",
        "summary": "Tampon sıkışmış. Serbest bırakmak için tekrar tekrar dokunun. Yabancı bir nesne yoksa robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "El parachoques está atascado. Límpielo y golpéelo suavemente para desatascarlo.",
        "summary": "El parachoques está atascado. Límpielo y golpéelo suavemente varias veces para desatascarlo. Si no hay ningún objeto extraño, aleje el robot y reinícielo."
      },
      "ar": {
        "title": "المصد عالق. قم بتنظيفه واضغط برفق لتحريره.",
        "summary": "المصد عالق. اضغط عليه بشكل متكرر لتحريره. إذا لم تكن هناك أجسام غريبة، فحرك الروبوت بعيدًا وأعد تشغيله."
      },
      "zh-Hant": {
        "title": "請檢查並輕拍碰撞緩衝器，確認並未卡住",
        "summary": "碰撞緩衝器被卡住，請多次輕拍以排除異物；如無異物，請移動到新位置後啟動。"
      },
      "cs": {
        "title": "Nárazník se zasekl. Vyčistěte jej a lehce poklepejte, aby se uvolnil.",
        "summary": "Nárazník se zasekl. Opakovaně na něj poklepejte, aby se uvolnil. Pokud se zde nenachází žádný cizí předmět, robot odsuňte a restartujte."
      },
      "hu": {
        "title": "Beragadt ütköző. Tisztítsa meg, és enyhén kocogtassa meg, hogy kioldjon.",
        "summary": "Beragadt ütköző. Koppintson rá többször a kioldáshoz. Ha nem talál idegen tárgyat, helyezze arrébb a robotot, és indítsa újra."
      },
      "sk": {
        "title": "Zaseknutý nárazník. Vyčistite ho a ľahkým klepnutím ho uvoľnite.",
        "summary": "Zaseknutý nárazník. Opakovaným klepnutím naň ho uvoľnite. Ak sa v ňom nenachádza žiadny cudzí predmet, odsuňte robota a reštartujte ho."
      },
      "da": {
        "title": "Kofanger sidder fast. Rengør den, og tryk let for at frigøre den.",
        "summary": "Kofanger sidder fast. Tryk gentagne gange på den for at slippe den. Hvis der ikke findes fremmedlegemer, skal du flytte robotten væk og genstarte."
      },
      "fi": {
        "title": "Puskuri on jumissa. Puhdista se ja napauta kevyesti vapauttaaksesi sen.",
        "summary": "Puskuri on jumissa. Napauta sitä toistuvasti irrottamiseksi. Jos vierasesinettä ei ole, siirrä robotti pois ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Støtfanger hektet seg opp. Rengjør og dunk lett i den for å frigjøre den.",
        "summary": "Støtfanger hektet seg opp. Trykk på den gjentatte ganger for å slippe den. Hvis det ikke finnes fremmedlegemer, flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "Stootrand zit vast. Reinig hem en tik lichtjes om hem los te maken.",
        "summary": "Stootrand zit vast. Tik er herhaaldelijk op om het los te maken. Als er geen vreemd voorwerp is, verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "Stötfångare fastnat. Rengör och knacka lätt tills den lossnar.",
        "summary": "Stötfångare fastnat. Tryck på den tills den lossnar. Om det inte finns några främmande föremål kan du flytta på roboten och starta om."
      }
    },
    "511": {
      "internal": "F_511",
      "zh": {
        "title": "回充失败，请将主机放回基站",
        "summary": "回充失败，请清理充电座附近障碍物及充电接触区域，并将主机放回基站。"
      },
      "en": {
        "title": "Docking error. Put the robot on the dock.",
        "summary": "Docking error. Clear obstacles around the dock, clean charging contacts, and put the robot on the dock."
      },
      "fr": {
        "title": "Erreur de retour à la station. Placez le robot sur la station.",
        "summary": "Erreur de retour à la station. Éliminez les obstacles autour de la station, nettoyez les contacts de rechargement et placez le robot sur la station."
      },
      "de": {
        "title": "Andocken fehlgeschlagen. Stelle den Roboter auf die Dockingstation.",
        "summary": "Andocken fehlgeschlagen. Beseitige Hindernisse um die Dockingstation, reinige die Ladekontakte und stelle den Roboter auf die Dockingstation."
      },
      "es": {
        "title": "Error durante la vuelta a la base. Coloque el robot aspirador en la base.",
        "summary": "Error durante la vuelta a la base. Despeje los obstáculos a su alrededor, limpie los contactos de carga y coloque el robot aspirador en la base."
      },
      "ko": {
        "title": "충전을 위한 복귀가 실패하였습니다. 본체를 도크에 올려놓으세요.",
        "summary": "충전을 위한 복귀가 실패하면 도크 근처의 장애물 및 충전 접점을 청소하고 본체를 도크에 올려놓으세요."
      },
      "ru": {
        "title": "Ошибка возврата на док-станцию. Поместите робота на док-станцию.",
        "summary": "Ошибка возврата на док-станцию. Уберите препятствия вокруг док-станции, очистите зарядные контакты и поместите робота на док-станцию."
      },
      "he": {
        "title": "הפרעה בתחנת העגינה. הניחו את הרובוט על תחנת העגינה.",
        "summary": "הפרעה בתחנת העגינה. נקו מכשולים סביב תחנת העגינה, נקו את מגעי הטעינה והנחו את רובוט על תחנת העגינה."
      },
      "id": {
        "title": "Kesalahan kembali ke dok. Letakkan robot di dok.",
        "summary": "Kesalahan kembali ke dok. Sisihkan penghalang di sekitar dok, bersihkan kontak pengisian daya, lalu letakkan robot di dok."
      },
      "pl": {
        "title": "Błąd dokowania. Podłącz robota do stacji dokującej.",
        "summary": "Błąd dokowania. Usuń przeszkody w pobliżu stacji dokującej, wyczyść styki ładowania, a następnie podłącz robota do stacji dokującej."
      },
      "ro": {
        "title": "Eroare de andocare. Așezați robotul la stația de andocare.",
        "summary": "Eroare de andocare. Îndepărtați obstacolele din jurul stației de andocare, curățați contactele de încărcare și așezați robotul la stația de andocare."
      },
      "th": {
        "title": "ข้อผิดพลาดการกลับเข้าแท่นชาร์จ วางหุ่นยนต์บนแท่นชาร์จ",
        "summary": "ข้อผิดพลาดการกลับเข้าแท่นชาร์จ เก็บสิ่งกีดขวางรอบแท่นชาร์จ ทำความสะอาดหน้าสัมผัสการชาร์จ แล้ววางหุ่นยนต์บนแท่นชาร์จ"
      },
      "uk": {
        "title": "Помилка приєднання до базової станції. Помістіть робот-пилосос на базову станцію.",
        "summary": "Помилка приєднання до базової станції. Приберіть перешкоди навколо базової станції, прочистьте зарядні контакти й помістіть робот-пилосос на базову станцію."
      },
      "it": {
        "title": "Errore nella stazione di ricarica. Posizionare il robot nella stazione di ricarica.",
        "summary": "Errore nella stazione di ricarica. Rimuovere gli ostacoli attorno alla stazione di ricarica, pulire i contatti di ricarica e posizionare il robot sulla stazione."
      },
      "ja": {
        "title": "充電ドックに戻れませんでした。本体をドックに戻してください。",
        "summary": "充電に失敗しました。ドック周辺の障害物を取り除き、充電端子を清掃してから、本体をドックに戻してください。"
      },
      "vi": {
        "title": "Lỗi trở về dock sạc. Đặt robot lên dock sạc.",
        "summary": "Lỗi trở về dock sạc. Dọn sạch chướng ngại vật xung quanh dock sạc, vệ sinh các đầu tiếp xúc sạc và đặt robot vào dock sạc."
      },
      "pt": {
        "title": "Erro ao voltar para a estação. Coloque o robô na estação.",
        "summary": "Erro ao voltar para a estação. Remova os obstáculos à volta da estação, limpe os contactos de carregamento e coloque o robô na estação."
      },
      "ms": {
        "title": "Ralat pengedokan. Letakkan robot pada dok tersebut.",
        "summary": "Ralat pengedokan. Buang halangan di sekeliling dok, bersihkan tempat sentuhan pengecasan dan letakkan robot pada dok."
      },
      "tr": {
        "title": "Bağlantı istasyonu hatası. Robotu bağlantı istasyonuna yerleştirin.",
        "summary": "Bağlantı istasyonu hatası. Bağlantı istasyonunun etrafındaki engelleri temizleyin, şarj temas noktalarını temizleyin ve robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Error al regresar a la base. Coloque el robot en la base.",
        "summary": "Error al regresar a la base. Retire los obstáculos alrededor de la base, limpie los contactos de carga y ponga el robot en la base."
      },
      "ar": {
        "title": "خطأ في العودة إلى قاعدة الشحن. ضع الروبوت على القاعدة.",
        "summary": "خطأ في العودة إلى قاعدة الشحن. أزل العوائق الموجودة حول القاعدة، ونظف مواضع تلامس الشحن وضع الروبوت على القاعدة."
      },
      "zh-Hant": {
        "title": "返回充電失敗，請將主機放回基座",
        "summary": "返回充電失敗，請將充電座附近障礙物及充電接觸區域周遭清空，並將主機放回基座。"
      },
      "cs": {
        "title": "Chyba dokování. Robot dejte do dokovací stanice.",
        "summary": "Chyba dokování. Odstraňte překážky kolem dokovací stanice, vyčistěte nabíjecí kontakty a umístěte robota na dokovací stanici."
      },
      "hu": {
        "title": "Dokkolási hiba. Helyezze a robotot a dokkolóba.",
        "summary": "Dokkolási hiba. Távolítsa el az akadályokat a dokkoló körül, tisztítsa meg a töltőérintkezőket, és helyezze a robotot a dokkolóba."
      },
      "sk": {
        "title": "Chyba návratu do dokovacej stanice. Umiestnite robot do dokovacej stanice.",
        "summary": "Chyba návratu do doku. Odstráňte prekážky v okolí doku, vyčistite nabíjacie kontakty a umiestnite robota na doku."
      },
      "da": {
        "title": "Dockingfejl. Sæt robotten på docken.",
        "summary": "Dockingfejl. Fjern forhindringer omkring docken, rengør opladningskontakter, og sæt robotten på docken."
      },
      "fi": {
        "title": "Telakointivirhe. Aseta robotti telakkaan.",
        "summary": "Telakointivirhe. Poista telakan ympäriltä esteet, puhdista latauskoskettimet ja aseta robotti telakkaan."
      },
      "nb": {
        "title": "Ladestasjonsfeil. Sett roboten på ladestasjonen.",
        "summary": "Ladestasjonsfeil. Fjern hindringer rundt dokken, rengjør ladekontakter og sett roboten på ladestasjonen."
      },
      "nl": {
        "title": "Dockingfout. Plaats de robot op het dockingstation.",
        "summary": "Dockingfout. Verwijder obstakels rond het dockingstation, reinig de oplaadcontacten en plaats de robot op het dockingstation."
      },
      "sv": {
        "title": "Dockningsfel. Placera roboten i laddningsstationen.",
        "summary": "Dockningsfel. Ta bort hinder runt laddningsstationen, rengör laddningskontakterna och sätt roboten på laddningsstationen."
      }
    },
    "512": {
      "internal": "F_512",
      "zh": {
        "title": "回充失败，请将主机放回基站",
        "summary": "回充失败，请清理充电座附近障碍物及充电接触区域，并将主机放回基站。"
      },
      "en": {
        "title": "Docking error. Put the robot on the dock.",
        "summary": "Docking error. Clear obstacles around the dock, clean charging contacts, and put the robot on the dock."
      },
      "fr": {
        "title": "Erreur de retour à la station. Placez le robot sur la station.",
        "summary": "Erreur de retour à la station. Éliminez les obstacles autour de la station, nettoyez les contacts de rechargement et placez le robot sur la station."
      },
      "de": {
        "title": "Andocken fehlgeschlagen. Stelle den Roboter auf die Dockingstation.",
        "summary": "Andocken fehlgeschlagen. Beseitige Hindernisse um die Dockingstation, reinige die Ladekontakte und stelle den Roboter auf die Dockingstation."
      },
      "es": {
        "title": "Error durante la vuelta a la base. Coloque el robot aspirador en la base.",
        "summary": "Error durante la vuelta a la base. Despeje los obstáculos a su alrededor, limpie los contactos de carga y coloque el robot aspirador en la base."
      },
      "ko": {
        "title": "충전을 위한 복귀가 실패하였습니다. 본체를 도크에 올려놓으세요.",
        "summary": "충전을 위한 복귀가 실패하면 도크 근처의 장애물 및 충전 접점을 청소하고 본체를 도크에 올려놓으세요."
      },
      "ru": {
        "title": "Ошибка возврата на док-станцию. Поместите робота на док-станцию.",
        "summary": "Ошибка возврата на док-станцию. Уберите препятствия вокруг док-станции, очистите зарядные контакты и поместите робота на док-станцию."
      },
      "he": {
        "title": "הפרעה בתחנת העגינה. הניחו את הרובוט על תחנת העגינה.",
        "summary": "הפרעה בתחנת העגינה. נקו מכשולים סביב תחנת העגינה, נקו את מגעי הטעינה והנחו את רובוט על תחנת העגינה."
      },
      "id": {
        "title": "Kesalahan kembali ke dok. Letakkan robot di dok.",
        "summary": "Kesalahan kembali ke dok. Sisihkan penghalang di sekitar dok, bersihkan kontak pengisian daya, lalu letakkan robot di dok."
      },
      "pl": {
        "title": "Błąd dokowania. Podłącz robota do stacji dokującej.",
        "summary": "Błąd dokowania. Usuń przeszkody w pobliżu stacji dokującej, wyczyść styki ładowania, a następnie podłącz robota do stacji dokującej."
      },
      "ro": {
        "title": "Eroare de andocare. Așezați robotul la stația de andocare.",
        "summary": "Eroare de andocare. Îndepărtați obstacolele din jurul stației de andocare, curățați contactele de încărcare și așezați robotul la stația de andocare."
      },
      "th": {
        "title": "ข้อผิดพลาดการกลับเข้าแท่นชาร์จ วางหุ่นยนต์บนแท่นชาร์จ",
        "summary": "ข้อผิดพลาดการกลับเข้าแท่นชาร์จ เก็บสิ่งกีดขวางรอบแท่นชาร์จ ทำความสะอาดหน้าสัมผัสการชาร์จ แล้ววางหุ่นยนต์บนแท่นชาร์จ"
      },
      "uk": {
        "title": "Помилка приєднання до базової станції. Помістіть робот-пилосос на базову станцію.",
        "summary": "Помилка приєднання до базової станції. Приберіть перешкоди навколо базової станції, прочистьте зарядні контакти й помістіть робот-пилосос на базову станцію."
      },
      "it": {
        "title": "Errore nella stazione di ricarica. Posizionare il robot nella stazione di ricarica.",
        "summary": "Errore nella stazione di ricarica. Rimuovere gli ostacoli attorno alla stazione di ricarica, pulire i contatti di ricarica e posizionare il robot sulla stazione."
      },
      "ja": {
        "title": "充電ドックに戻れませんでした。本体をドックに戻してください。",
        "summary": "充電に失敗しました。ドック周辺の障害物を取り除き、充電端子を清掃してから、本体をドックに戻してください。"
      },
      "vi": {
        "title": "Lỗi trở về dock sạc. Đặt robot lên dock sạc.",
        "summary": "Lỗi trở về dock sạc. Dọn sạch chướng ngại vật xung quanh dock sạc, vệ sinh các đầu tiếp xúc sạc và đặt robot vào dock sạc."
      },
      "pt": {
        "title": "Erro ao voltar para a estação. Coloque o robô na estação.",
        "summary": "Erro ao voltar para a estação. Remova os obstáculos à volta da estação, limpe os contactos de carregamento e coloque o robô na estação."
      },
      "ms": {
        "title": "Ralat pengedokan. Letakkan robot pada dok tersebut.",
        "summary": "Ralat pengedokan. Buang halangan di sekeliling dok, bersihkan tempat sentuhan pengecasan dan letakkan robot pada dok."
      },
      "tr": {
        "title": "Bağlantı istasyonu hatası. Robotu bağlantı istasyonuna yerleştirin.",
        "summary": "Bağlantı istasyonu hatası. Bağlantı istasyonunun etrafındaki engelleri temizleyin, şarj temas noktalarını temizleyin ve robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Error al regresar a la base. Coloque el robot en la base.",
        "summary": "Error al regresar a la base. Retire los obstáculos alrededor de la base, limpie los contactos de carga y ponga el robot en la base."
      },
      "ar": {
        "title": "خطأ في العودة إلى قاعدة الشحن. ضع الروبوت على القاعدة.",
        "summary": "خطأ في العودة إلى قاعدة الشحن. أزل العوائق الموجودة حول القاعدة، ونظف مواضع تلامس الشحن وضع الروبوت على القاعدة."
      },
      "zh-Hant": {
        "title": "返回充電失敗，請將主機放回基座",
        "summary": "返回充電失敗，請將充電座附近障礙物及充電接觸區域周遭清空，並將主機放回基座。"
      },
      "cs": {
        "title": "Chyba dokování. Robot dejte do dokovací stanice.",
        "summary": "Chyba dokování. Odstraňte překážky kolem dokovací stanice, vyčistěte nabíjecí kontakty a umístěte robota na dokovací stanici."
      },
      "hu": {
        "title": "Dokkolási hiba. Helyezze a robotot a dokkolóba.",
        "summary": "Dokkolási hiba. Távolítsa el az akadályokat a dokkoló körül, tisztítsa meg a töltőérintkezőket, és helyezze a robotot a dokkolóba."
      },
      "sk": {
        "title": "Chyba návratu do dokovacej stanice. Umiestnite robot do dokovacej stanice.",
        "summary": "Chyba návratu do doku. Odstráňte prekážky v okolí doku, vyčistite nabíjacie kontakty a umiestnite robota na doku."
      },
      "da": {
        "title": "Dockingfejl. Sæt robotten på docken.",
        "summary": "Dockingfejl. Fjern forhindringer omkring docken, rengør opladningskontakter, og sæt robotten på docken."
      },
      "fi": {
        "title": "Telakointivirhe. Aseta robotti telakkaan.",
        "summary": "Telakointivirhe. Poista telakan ympäriltä esteet, puhdista latauskoskettimet ja aseta robotti telakkaan."
      },
      "nb": {
        "title": "Ladestasjonsfeil. Sett roboten på ladestasjonen.",
        "summary": "Ladestasjonsfeil. Fjern hindringer rundt dokken, rengjør ladekontakter og sett roboten på ladestasjonen."
      },
      "nl": {
        "title": "Dockingfout. Plaats de robot op het dockingstation.",
        "summary": "Dockingfout. Verwijder obstakels rond het dockingstation, reinig de oplaadcontacten en plaats de robot op het dockingstation."
      },
      "sv": {
        "title": "Dockningsfel. Placera roboten i laddningsstationen.",
        "summary": "Dockningsfel. Ta bort hinder runt laddningsstationen, rengör laddningskontakterna och sätt roboten på laddningsstationen."
      }
    },
    "513": {
      "internal": "F_513",
      "zh": {
        "title": "可能卡住或困住，请移到新位置启动",
        "summary": "可能卡住或困住，请清除主机周围障碍物；如无法清除，请移动到新位置启动。"
      },
      "en": {
        "title": "Robot trapped. Move the robot away and restart.",
        "summary": "Robot trapped. Clear obstacles around robot or move robot away and restart."
      },
      "fr": {
        "title": "Robot coincé. Déplacez le robot et redémarrez le nettoyage.",
        "summary": "Robot coincé. Éliminez les obstacles autour du robot ou déplacez-le et redémarrez le nettoyage."
      },
      "de": {
        "title": "Roboter verfangen. Bewege den Roboter und starte ihn neu.",
        "summary": "Roboter verfangen. Beseitige Hindernisse um den Roboter oder bewege den Roboter weg und starte neu."
      },
      "es": {
        "title": "Robot atascado. Traslade el robot aspirador a otra ubicación y reinicie.",
        "summary": "Robot atascado. Despeje los obstáculos alrededor del robot o cambie de sitio el robot aspirador y reinicie."
      },
      "ko": {
        "title": "기기가 걸렸거나 막혔을 수 있습니다. 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "기기가 걸렸거나 막혔다면 본체 근처의 장애물을 정리하세요. 정리할 수 없으면 기기를 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Робот застрял. Переместите робота в другое место и перезапустите.",
        "summary": "Робот застрял. Уберите препятствия вокруг робота или переместите его в другое место и перезапустите."
      },
      "he": {
        "title": "רובוט תקוע. הרחקו את רובוט והפעילו מחדש.",
        "summary": "הרובוט תקוע. הסירו מכשולים סביב רובוט או הרחקו את רובוט והפעלו מחדש."
      },
      "id": {
        "title": "Robot terjebak. Pindahkan robot dan mulai ulang.",
        "summary": "Robot terjebak. Sisihkan penghalang di sekitar robot atau pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Robot uwięziony. Przenieś robota i uruchom ponownie.",
        "summary": "Robot uwięziony. Usuń przeszkody w pobliżu robota lub przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Robot blocat. Mutați robotul într-o altă locație și porniți-l din nou.",
        "summary": "Robot blocat. Îndepărtați obiectele din jurul robotului sau mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "หุ่นยนต์ติดกับ ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่",
        "summary": "หุ่นยนต์ติดกับ นำสิ่งกีดขวางรอบๆ หุ่นยนต์ออก หรือย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่"
      },
      "uk": {
        "title": "Робот застряг. Заберіть робота й перезавантажте його.",
        "summary": "Робот застряг. Усуньте перешкоди навколо робота або заберіть його та перезапустіть."
      },
      "it": {
        "title": "Robot intrappolato. Allontanare il robot e riavviarlo.",
        "summary": "Robot intrappolato. Eliminare gli ostacoli attorno al robot oppure allontanarlo e riavviarlo."
      },
      "ja": {
        "title": "ロボット掃除機が動けなくなりました。ロボット掃除機を移動させてから再起動してください。",
        "summary": "本体が動けなくなっています。本体の周りの障害物を取り除くか、本体を移動させてください。"
      },
      "vi": {
        "title": "Robot bị mắc kẹt. Di chuyển robot ra xa và khởi động lại.",
        "summary": "Robot bị mắc kẹt. Dọn sạch chướng ngại vật xung quanh robot hoặc di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "Robô preso. Afaste o robô e reinicie.",
        "summary": "Robô preso. Remova os obstáculos à volta do robô ou afaste-o e reinicie."
      },
      "ms": {
        "title": "Robot terperangkap. Alihkan robot ke tempat lain dan mulakan semula.",
        "summary": "Robot terperangkap. Hapuskan halangan di sekeliling robot atau alihkan robot dan mulakan semula."
      },
      "tr": {
        "title": "Robot çıkamadığı bir alanda kalmış. Robotu uzaklaştırın ve yeniden başlatın.",
        "summary": "Robot çıkamadığı bir alanda kalmış. Robotun etrafındaki engelleri temizleyin veya robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "El robot está atascado. Aléjelo y reinícielo.",
        "summary": "El robot está atascado. Retire los obstáculos alrededor del robot, aléjelo y reinícielo."
      },
      "ar": {
        "title": "الروبوت محاصر. حرك الروبوت بعيدًا وأعد تشغيله.",
        "summary": "الروبوت محاصر. أزل العوائق الموجودة حول الروبوت أو حرك الروبوت بعيدًا ثم أعد تشغيله."
      },
      "zh-Hant": {
        "title": "可能卡住或困住，請移到新位置後啟動",
        "summary": "可能卡住或困住，請清空主機周圍障礙物；如無法清空，請移動到新位置後啟動。"
      },
      "cs": {
        "title": "Robot uvízl. Robot odsuňte a restartujte.",
        "summary": "Robot uvízl. Odstraňte překážky kolem robota nebo robot přemístěte a restartujte."
      },
      "hu": {
        "title": "A robot beszorult. Helyezze arrébb a robotot, és indítsa újra.",
        "summary": "A robot beszorult. Távolítsa el az akadályokat a robot körül, vagy helyezze arrébb a robotot, majd indítsa újra."
      },
      "sk": {
        "title": "Robot uviazol. Posuňte robot ďalej a reštartujte ho.",
        "summary": "Robot uviazol. Odstráňte prekážky okolo robota alebo odsuňte robot a reštartujte ho."
      },
      "da": {
        "title": "Robot fanget. Flyt robotten væk og genstart.",
        "summary": "Robot fanget. Fjern forhindringer omkring robotten, eller flyt robotten væk og genstart."
      },
      "fi": {
        "title": "Robotti jumissa. Siirrä robotti pois ja käynnistä uudelleen.",
        "summary": "Robotti jumissa. Poista esteet robotin ympäriltä tai siirrä robotti ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Robot innestengt. Flytt roboten bort og start på nytt.",
        "summary": "Robot innestengt. Fjern hindringer rundt roboten eller flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "Robot zit vast. Verplaats de robot en start opnieuw op.",
        "summary": "Robot zit vast. Verwijder obstakels rond de robot of verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "Robot fastnat. Flytta roboten och starta om.",
        "summary": "Robot fastnat. Ta bort hinder runt roboten eller flytta på roboten och starta om."
      }
    },
    "514": {
      "internal": "F_514",
      "zh": {
        "title": "可能卡住或困住，请移到新位置启动",
        "summary": "可能卡住或困住，请清除主机周围障碍物；如无法清除，请移动到新位置启动。"
      },
      "en": {
        "title": "Robot trapped. Move the robot away and restart.",
        "summary": "Robot trapped. Clear obstacles around robot or move robot away and restart."
      },
      "fr": {
        "title": "Robot coincé. Déplacez le robot et redémarrez le nettoyage.",
        "summary": "Robot coincé. Éliminez les obstacles autour du robot ou déplacez-le et redémarrez le nettoyage."
      },
      "de": {
        "title": "Roboter verfangen. Bewege den Roboter und starte ihn neu.",
        "summary": "Roboter verfangen. Beseitige Hindernisse um den Roboter oder bewege den Roboter weg und starte neu."
      },
      "es": {
        "title": "Robot atascado. Traslade el robot aspirador a otra ubicación y reinicie.",
        "summary": "Robot atascado. Despeje los obstáculos alrededor del robot o cambie de sitio el robot aspirador y reinicie."
      },
      "ko": {
        "title": "기기가 걸렸거나 막혔을 수 있습니다. 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "기기가 걸렸거나 막혔다면 본체 근처의 장애물을 정리하세요. 정리할 수 없으면 기기를 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Робот застрял. Переместите робота в другое место и перезапустите.",
        "summary": "Робот застрял. Уберите препятствия вокруг робота или переместите его в другое место и перезапустите."
      },
      "he": {
        "title": "רובוט תקוע. הרחקו את רובוט והפעילו מחדש.",
        "summary": "הרובוט תקוע. הסירו מכשולים סביב רובוט או הרחקו את רובוט והפעלו מחדש."
      },
      "id": {
        "title": "Robot terjebak. Pindahkan robot dan mulai ulang.",
        "summary": "Robot terjebak. Sisihkan penghalang di sekitar robot atau pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Robot uwięziony. Przenieś robota i uruchom ponownie.",
        "summary": "Robot uwięziony. Usuń przeszkody w pobliżu robota lub przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Robot blocat. Mutați robotul într-o altă locație și porniți-l din nou.",
        "summary": "Robot blocat. Îndepărtați obiectele din jurul robotului sau mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "หุ่นยนต์ติดกับ ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่",
        "summary": "หุ่นยนต์ติดกับ นำสิ่งกีดขวางรอบๆ หุ่นยนต์ออก หรือย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่"
      },
      "uk": {
        "title": "Робот застряг. Заберіть робота й перезавантажте його.",
        "summary": "Робот застряг. Усуньте перешкоди навколо робота або заберіть його та перезапустіть."
      },
      "it": {
        "title": "Robot intrappolato. Allontanare il robot e riavviarlo.",
        "summary": "Robot intrappolato. Eliminare gli ostacoli attorno al robot oppure allontanarlo e riavviarlo."
      },
      "ja": {
        "title": "ロボット掃除機が動けなくなりました。ロボット掃除機を移動させてから再起動してください。",
        "summary": "本体が動けなくなっています。本体の周りの障害物を取り除くか、本体を移動させてください。"
      },
      "vi": {
        "title": "Robot bị mắc kẹt. Di chuyển robot ra xa và khởi động lại.",
        "summary": "Robot bị mắc kẹt. Dọn sạch chướng ngại vật xung quanh robot hoặc di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "Robô preso. Afaste o robô e reinicie.",
        "summary": "Robô preso. Remova os obstáculos à volta do robô ou afaste-o e reinicie."
      },
      "ms": {
        "title": "Robot terperangkap. Alihkan robot ke tempat lain dan mulakan semula.",
        "summary": "Robot terperangkap. Hapuskan halangan di sekeliling robot atau alihkan robot dan mulakan semula."
      },
      "tr": {
        "title": "Robot çıkamadığı bir alanda kalmış. Robotu uzaklaştırın ve yeniden başlatın.",
        "summary": "Robot çıkamadığı bir alanda kalmış. Robotun etrafındaki engelleri temizleyin veya robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "El robot está atascado. Aléjelo y reinícielo.",
        "summary": "El robot está atascado. Retire los obstáculos alrededor del robot, aléjelo y reinícielo."
      },
      "ar": {
        "title": "الروبوت محاصر. حرك الروبوت بعيدًا وأعد تشغيله.",
        "summary": "الروبوت محاصر. أزل العوائق الموجودة حول الروبوت أو حرك الروبوت بعيدًا ثم أعد تشغيله."
      },
      "zh-Hant": {
        "title": "可能卡住或困住，請移到新位置後啟動",
        "summary": "可能卡住或困住，請清空主機周圍障礙物；如無法清空，請移動到新位置後啟動。"
      },
      "cs": {
        "title": "Robot uvízl. Robot odsuňte a restartujte.",
        "summary": "Robot uvízl. Odstraňte překážky kolem robota nebo robot přemístěte a restartujte."
      },
      "hu": {
        "title": "A robot beszorult. Helyezze arrébb a robotot, és indítsa újra.",
        "summary": "A robot beszorult. Távolítsa el az akadályokat a robot körül, vagy helyezze arrébb a robotot, majd indítsa újra."
      },
      "sk": {
        "title": "Robot uviazol. Posuňte robot ďalej a reštartujte ho.",
        "summary": "Robot uviazol. Odstráňte prekážky okolo robota alebo odsuňte robot a reštartujte ho."
      },
      "da": {
        "title": "Robot fanget. Flyt robotten væk og genstart.",
        "summary": "Robot fanget. Fjern forhindringer omkring robotten, eller flyt robotten væk og genstart."
      },
      "fi": {
        "title": "Robotti jumissa. Siirrä robotti pois ja käynnistä uudelleen.",
        "summary": "Robotti jumissa. Poista esteet robotin ympäriltä tai siirrä robotti ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Robot innestengt. Flytt roboten bort og start på nytt.",
        "summary": "Robot innestengt. Fjern hindringer rundt roboten eller flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "Robot zit vast. Verplaats de robot en start opnieuw op.",
        "summary": "Robot zit vast. Verwijder obstakels rond de robot of verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "Robot fastnat. Flytta roboten och starta om.",
        "summary": "Robot fastnat. Ta bort hinder runt roboten eller flytta på roboten och starta om."
      }
    },
    "515": {
      "internal": "F_515",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "517": {
      "internal": "F_517",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "518": {
      "internal": "F_518",
      "zh": {
        "title": "电量不足，请充电",
        "summary": "电量不足，请将主机放到基站充电至20%再启动。"
      },
      "en": {
        "title": "Low battery. Recharge now.",
        "summary": "Battery low. Put the robot on the dock to charge it to 20% before starting."
      },
      "fr": {
        "title": "Batterie faible. Rechargez-la maintenant.",
        "summary": "Batterie faible. Placez le robot sur la station d’accueil et rechargez-le à 20 % avant de démarrer le nettoyage."
      },
      "de": {
        "title": "Niedriger Akkustand. Jetzt aufladen.",
        "summary": "Akkustand niedrig. Stelle den Roboter in die Dockingstation und lade ihn vor Gebrauch auf 20 % auf."
      },
      "es": {
        "title": "Batería baja. Recargue ahora.",
        "summary": "Batería baja. Coloque el robot aspirador en la base y cárguelo hasta el 20 % antes de comenzar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 충전하세요.",
        "summary": "배터리 잔량이 부족하면 본체를 도크에 놓고 20%까지 충전한 후 다시 시작하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Зарядите как можно скорее.",
        "summary": "Низкий уровень заряда аккумулятора. Поставьте робота на док-станцию и зарядите его до 20 %, прежде чем использовать."
      },
      "he": {
        "title": "הסוללה חלשה. הטען עכשיו.",
        "summary": "הסוללה חלשה. הניחו את רובוט על תחנת העגינה כדי לטעון אותו ל-20% לפני ההתחלה."
      },
      "id": {
        "title": "Baterai lemah. Isi ulang daya sekarang.",
        "summary": "Baterai lemah. Letakkan robot di dok untuk mengisi dayanya hingga 20% sebelum menyalakan."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Naładuj teraz.",
        "summary": "Niski poziom naładowania akumulatora. Umieść robota w stacji dokującej, aby naładować go do 20% przed uruchomieniem."
      },
      "ro": {
        "title": "Baterie descărcată. Reîncărcați acum.",
        "summary": "Baterie descărcată. Andocați robotul pentru a se încărca până la 20% înainte de pornire."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ชาร์จไฟตอนนี้",
        "summary": "แบตเตอรี่ต่ำ นำหุ่นยนต์กลับไปที่แท่นชาร์จเพื่อชาร์จไฟให้ถึง 20% ก่อนเริ่มต้น"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Виконайте підзаряджання.",
        "summary": "Низький рівень заряду акумулятора. Перенесіть робота на базову станцію, щоб зарядити до 20% перед використанням."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Ricaricare immediatamente.",
        "summary": "Basso livello di carica della batteria. Porre il robot sulla stazione di ricarica e ricaricarlo del 20% prima di avviarlo."
      },
      "ja": {
        "title": "バッテリーが低下しています。今すぐ充電してください。",
        "summary": "バッテリー残量が不足しています。本体を充電ドックに置き、20％以上充電してから再起動してください。"
      },
      "vi": {
        "title": "Pin yếu. Sạc lại ngay.",
        "summary": "Pin yếu. Đặt robot lên dock sạc để sạch tới mức 20% trước khi bắt đầu."
      },
      "pt": {
        "title": "Bateria fraca. Recarregue agora.",
        "summary": "Bateria fraca. Coloque o robô na estação e carregue-o a 20% antes de iniciar."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Cas semula sekarang.",
        "summary": "Kuasa bateri lemah. Letakkan robot pada dok untuk mengecasnya sehingga 20% sebelum memulakan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Hemen şarj edin.",
        "summary": "Pil seviyesi düşüktür. Başlamadan önce %20 şarj etmek için robotu bağlantı istasyonuna yerleştirin."
      },
      "es-LA": {
        "title": "Batería baja. Recárguela ahora.",
        "summary": "Batería baja. Coloque el robot en la base y cárguelo al 20 % antes de iniciarlo."
      },
      "ar": {
        "title": "البطارية ضعيفة. أعد الشحن الآن.",
        "summary": "البطارية ضعيفة. ضع الروبوت على القاعدة لشحنه حتى 20% قبل الاستخدام."
      },
      "zh-Hant": {
        "title": "電量不足，請充電",
        "summary": "電量不足，請將主機放至基座充電至 20% 再啟動。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Dobijte.",
        "summary": "Baterie je téměř vybitá. Před spuštěním umístěte robota na dokovací stanici a nabijte jej na 20 %."
      },
      "hu": {
        "title": "Alacsony töltöttség. Töltse fel most.",
        "summary": "Alacsony töltöttség. Az indítás előtt helyezze a robotot a dokkolóba, és töltse fel 20%-ra."
      },
      "sk": {
        "title": "Slabá batéria. Ihneď ju nabite.",
        "summary": "Slabá batéria. Pred spustením robota ho položte na dokovaciu stanicu, aby sa nabil na 20 %."
      },
      "da": {
        "title": "Lavt batteri. Genoplad nu.",
        "summary": "Lavt batteriniveau. Sæt robotten på docken for at oplade den til 20%, før du starter."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Lataa nyt.",
        "summary": "Akku vähissä. Aseta robotti telakkaan ja lataa se 20 %:iin ennen aloittamista."
      },
      "nb": {
        "title": "Lavt batteri: Ny lad opp nå.",
        "summary": "Lavt batteri. Sett roboten i ladestasjonen, for å lade den til 20% før du starter."
      },
      "nl": {
        "title": "Batterij bijna leeg. Nu opladen.",
        "summary": "Batterij bijna leeg. Plaats de robot op het dockingstation om deze tot 20% op te laden voordat u begint."
      },
      "sv": {
        "title": "Lågt batteri. Ladda nu.",
        "summary": "Batteri är lågt. Placera roboten i laddningsstationen och ladda den till 20 % innan start."
      }
    },
    "519": {
      "internal": "F_519"
    },
    "520": {
      "internal": "F_520"
    },
    "521": {
      "internal": "F_521"
    },
    "522": {
      "internal": "F_522",
      "zh": {
        "title": "请确认拖布已装好",
        "summary": "拖布未安装，请装回拖布"
      },
      "en": {
        "title": "Check that the mop is properly installed.",
        "summary": "Mop not installed. Reinstall it."
      },
      "fr": {
        "title": "Vérifiez que la serpillière est correctement installée.",
        "summary": "Serpillière non installée. Réinstallez-la."
      },
      "de": {
        "title": "Überprüfe, ob der Mopp ordnungsgemäß installiert ist.",
        "summary": "Mopp nicht installiert. Bitte einsetzen."
      },
      "es": {
        "title": "Asegúrese de que la mopa esté correctamente instalada.",
        "summary": "Mopa no instalada. Vuelva a instalarla."
      },
      "ko": {
        "title": "물걸레가 제대로 장착되었는지 확인하세요.",
        "summary": "물걸레가 장착되지 않았다면 제대로 장착하세요."
      },
      "ru": {
        "title": "Убедитесь, что протирочная салфетка установлена надлежащим образом.",
        "summary": "Протирочная салфетка не установлена. Установите на место."
      },
      "he": {
        "title": "בדקו שהמגב מותקן כראוי",
        "summary": "מגב לא מותקן. התקינו אותו מחדש."
      },
      "id": {
        "title": "Periksa jika pel terpasang dengan benar.",
        "summary": "Pel tidak terpasang. Pasang kembali."
      },
      "pl": {
        "title": "Sprawdź, czy mop jest poprawnie zamontowany.",
        "summary": "Nie zainstalowano mopa. Zainstaluj ponownie."
      },
      "ro": {
        "title": "Verificați dacă mopul este montat corect.",
        "summary": "Mopul nu este montat Remontați-l."
      },
      "th": {
        "title": "ตรวจสอบว่าติดตั้งผ้าถูพื้นอย่างเหมาะสมหรือไม่",
        "summary": "ไม่ได้ติดตั้งผ้าถูพื้น ติดตั้งใหม่อีกครั้ง"
      },
      "uk": {
        "title": "Переконайтеся, що швабру правильно встановлено.",
        "summary": "Швабру не встановлено. Встановіть її на місце."
      },
      "it": {
        "title": "Verificare che il panno sia installato correttamente.",
        "summary": "Panno non installato. Reinstallarlo."
      },
      "ja": {
        "title": "モップが正しく取り付けられていることを確認してください。",
        "summary": "モップが取り付けられていません。再度取り付けてください。"
      },
      "vi": {
        "title": "Kiểm tra xem giẻ lau đã được lắp đúng cách chưa.",
        "summary": "Chưa lắp giẻ lau. Lắp lại."
      },
      "pt": {
        "title": "Verifique se a mopa está corretamente instalada.",
        "summary": "Mopa não instalada. Volte a colocá-la."
      },
      "ms": {
        "title": "Periksa sama ada mop telah dipasang dengan betul.",
        "summary": "Mop tidak dipasang. Pasangkan semula."
      },
      "tr": {
        "title": "Paspasın düzgün takılıp takılmadığını kontrol edin.",
        "summary": "Paspas takılı değil. Yeniden takın."
      },
      "es-LA": {
        "title": "Compruebe que la mopa esté instalada correctamente.",
        "summary": "La mopa no está instalada. Instálela."
      },
      "ar": {
        "title": "تحقق من أن الممسحة مُثبتة بشكل صحيح.",
        "summary": "الممسحة غير مُثبتة. أعد تثبيتها."
      },
      "zh-Hant": {
        "title": "請確認拖布已安裝妥當",
        "summary": "拖布未安裝，請裝回拖布"
      },
      "cs": {
        "title": "Zkontrolujte, zda je mop správně nainstalován.",
        "summary": "Mop není nainstalován. Znovu ho nainstalujte."
      },
      "hu": {
        "title": "Ellenőrizze, hogy a mop megfelelően van-e rögzítve.",
        "summary": "A mop nincs rögzítve. Rögzítse újra."
      },
      "sk": {
        "title": "Skontrolujte, či je mop riadne vložený.",
        "summary": "Mop nie je vložený. Vložte ho."
      },
      "da": {
        "title": "Kontroller, at moppen er korrekt installeret.",
        "summary": "Moppe ikke installeret. Geninstaller det."
      },
      "fi": {
        "title": "Tarkista, että moppi on asennettu oikein.",
        "summary": "Moppia ei ole asennettu. Asenna se uudelleen."
      },
      "nb": {
        "title": "Kontroller at moppen er riktig installert.",
        "summary": "Mopp ikke installert. Monter den på nytt."
      },
      "nl": {
        "title": "Controleer of de dweil correct is geïnstalleerd.",
        "summary": "Dweil niet geïnstalleerd. Installeer deze opnieuw."
      },
      "sv": {
        "title": "Kontrollera att moppen sitter som den ska.",
        "summary": "Moppen är inte monterad. Sätt tillbaka den."
      }
    },
    "523": {
      "internal": "F_523"
    },
    "525": {
      "internal": "F_525"
    },
    "526": {
      "internal": "F_526"
    },
    "527": {
      "internal": "F_527"
    },
    "528": {
      "internal": "F_528"
    },
    "529": {
      "internal": "F_529"
    },
    "530": {
      "internal": "F_530"
    },
    "531": {
      "internal": "F_531"
    },
    "532": {
      "internal": "F_532"
    },
    "533": {
      "internal": "F_533",
      "zh": {
        "title": "长时间休眠，即将关机",
        "summary": "主机长时间休眠，即将关机，请将主机保持充电状态。"
      },
      "en": {
        "title": "About to shut down after a long time of sleep",
        "summary": "About to shut down after a long time of sleep. Charge the robot."
      },
      "fr": {
        "title": "Le robot va s'arrêter après une longue période d'inactivité prolongée.",
        "summary": "Le robot va s'arrêter après une longue période d'inactivité prolongée. Rechargez le robot."
      },
      "de": {
        "title": "Schaltet sich nach langer Zeit im Schlafmodus aus",
        "summary": "Schaltet sich nach langer Zeit im Schlafmodus aus. Lade den Roboter auf."
      },
      "es": {
        "title": "El robot lleva mucho tiempo en suspensión y va a apagarse",
        "summary": "El robot lleva mucho tiempo en suspensión y va a apagarse. Cargue el robot."
      },
      "ko": {
        "title": "절전 상태가 오래 지속되어 전원을 곧 차단합니다.",
        "summary": "절전 상태가 오래 지속되어 전원을 곧 차단합니다. 본체의 충전 상태를 유지하세요."
      },
      "ru": {
        "title": "Робот скоро выключится в связи с длительным простоем",
        "summary": "Робот скоро выключится в связи с длительным простоем. Зарядите робота."
      },
      "he": {
        "title": "עומד להיכבות לאחר מצב שינה לזמן ארוך.",
        "summary": "עומד להיכבות לאחר מצב שינה לזמן ארוך."
      },
      "id": {
        "title": "Akan segera dimatikan setelah sekian lama dalam mode tidur",
        "summary": "Akan segera dimatikan setelah sekian lama dalam mode tidur. Isi ulang daya robot."
      },
      "pl": {
        "title": "Robot zaraz się wyłączy po długim uśpieniu",
        "summary": "Robot zaraz się wyłączy po długim uśpieniu. Naładuj robota."
      },
      "ro": {
        "title": "Pe punctul de a fi scos din funcțiune după o perioadă lungă de repaus",
        "summary": "Pe punctul de a fi scos din funcțiune după o perioadă lungă de repaus. Încărcați robotul."
      },
      "th": {
        "title": "กำลังจะปิดเครื่องหลังเข้าสู่โหมดสลีปเป็นเวลานาน",
        "summary": "กำลังจะปิดเครื่องหลังเข้าสู่โหมดสลีปเป็นเวลานาน ชาร์จหุ่นยนต์"
      },
      "uk": {
        "title": "Скоро вимкнеться після тривалого перебування в режимі сну",
        "summary": "Скоро вимкнеться після тривалого перебування в режимі сну. Зарядіть робота."
      },
      "it": {
        "title": "Sta per spegnersi dopo un lungo periodo di sospensione",
        "summary": "Sta per spegnersi dopo un lungo periodo di sospensione. Ricaricare il robot."
      },
      "ja": {
        "title": "長時間スリープした後にシャットダウンしようとしています",
        "summary": "長時間スリープした後にシャットダウンしようとしています。本体を充電してください。"
      },
      "vi": {
        "title": "Sắp tắt sau thời gian dài ở chế độ Ngủ",
        "summary": "Sắp tắt sau thời gian dài ở chế độ Ngủ. Sạc robot."
      },
      "pt": {
        "title": "Está prestes a desligar-se após um longo período de suspensão",
        "summary": "Está prestes a desligar-se após um longo período de suspensão. Carregue o robô."
      },
      "ms": {
        "title": "Akan dimatikan selepas tidur untuk tempoh yang lama",
        "summary": "Akan dimatikan selepas tidur untuk tempoh yang lama. Caskan robot."
      },
      "tr": {
        "title": "Cihaz uzun süredir uyku modunda ve kapanmak üzere",
        "summary": "Cihaz uzun süredir uyku modunda ve kapanmak üzeredir. Robotu şarj edin."
      },
      "es-LA": {
        "title": "Está a punto de apagarse después de un período prolongado en suspensión",
        "summary": "Está a punto de apagarse después de un período prolongado en suspensión. Cargue el robot."
      },
      "ar": {
        "title": "على وشك إيقاف التشغيل بعد فترة سكون طويلة",
        "summary": "على وشك إيقاف التشغيل بعد فترة سكون طويلة. اشحن الروبوت."
      },
      "zh-Hant": {
        "title": "長時間休眠，即將關機",
        "summary": "主機長時間休眠，即將關機，請讓主機維持充電狀態。"
      },
      "cs": {
        "title": "Po dlouhé době nečinnosti se chystá k ukončení činnosti",
        "summary": "Po dlouhé době nečinnosti se chystá k ukončení činnosti. Nabijte robota."
      },
      "hu": {
        "title": "A hosszú alvást követően hamarosan leáll",
        "summary": "A hosszú alvást követően hamarosan leáll. Töltse fel a robotot."
      },
      "sk": {
        "title": "Po dlhom čase spánku sa čoskoro vypne",
        "summary": "Po dlhom čase spánku sa čoskoro vypne. Nabite robot."
      },
      "da": {
        "title": "Ved at lukke ned efter lang tids søvn",
        "summary": "Ved at lukke ned efter lang tids søvn. Oplad robotten."
      },
      "fi": {
        "title": "Sammutetaan pitkän lepo-tilan jälkeen",
        "summary": "Sammutetaan pitkän lepo-tilan jälkeen. Lataa robotti."
      },
      "nb": {
        "title": "I ferd med å slå seg av etter lang tids søvn",
        "summary": "I ferd med å slå seg av etter lang tids søvn. Lad roboten."
      },
      "nl": {
        "title": "Gaat uitschakelen na een lange slaapstand",
        "summary": "Gaat uitschakelen na een lange slaapstand. Laad de robot op."
      },
      "sv": {
        "title": "Stänger snart av efter att ha varit i viloläge länge",
        "summary": "Stänger snart av efter att ha varit i viloläge länge. Ladda roboten."
      }
    },
    "534": {
      "internal": "F_534",
      "zh": {
        "title": "电量过低，即将关机",
        "summary": "主机电量过低，即将关机，请将主机保持充电状态。"
      },
      "en": {
        "title": "Low battery. Turning off.",
        "summary": "About to shut down due to low battery. Charge the robot."
      },
      "fr": {
        "title": "Batterie faible. Arrêt du robot.",
        "summary": "Le robot va s'arrêter car sa batterie est faible. Rechargez le robot."
      },
      "de": {
        "title": "Niedriger Akkustand. Ausgeschaltet",
        "summary": "Schaltet sich wegen schwachem Akku aus. Lade den Roboter auf."
      },
      "es": {
        "title": "Batería baja. Apagando.",
        "summary": "El nivel de batería es bajo y el robot va a apagarse. Cargue el robot."
      },
      "ko": {
        "title": "배터리 잔량이 낮아 전원을 곧 차단합니다.",
        "summary": "배터리 잔량이 낮아 전원을 곧 차단합니다. 본체의 충전 상태를 유지하세요."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Завершение работы.",
        "summary": "Робот выключится из-за низкого заряда аккумулятора. Зарядите робота."
      },
      "he": {
        "title": "הסוללה חלשה. מכבה.",
        "summary": "הסוללה חלשה מידי. הרובוט עומד להיגבות. טענו אותו."
      },
      "id": {
        "title": "Baterai lemah. Mematikan.",
        "summary": "Akan segera dimatikan karena baterai lemah. Isi ulang daya robot."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Wyłączanie.",
        "summary": "Urządzenie zostanie wyłączone z powodu niskiego poziomu naładowania akumulatora. Naładuj robota."
      },
      "ro": {
        "title": "Baterie descărcată. Oprire în curs.",
        "summary": "Pe punctul de a fi scos din funcțiune din cauza bateriei descărcate. Încărcați robotul."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย กำลังปิดเครื่อง",
        "summary": "กำลังจะปิดเครื่องเนื่องจากแบตเตอรี่เหลือน้อย ชาร์จหุ่นยนต์"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Вимкнення.",
        "summary": "Майже вимикається через низький заряд акумулятора. Зарядіть робота."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Spegnimento in corso.",
        "summary": "Spegnimento imminente a causa del basso livello di carica della batteria. Ricaricare il robot."
      },
      "ja": {
        "title": "バッテリー残量が少なくなっています。電源をオフにします。",
        "summary": "バッテリー残量が少なくなっているため、シャットダウンしようとしています。本体を充電してください。"
      },
      "vi": {
        "title": "Pin yếu. Robot sắp tắt.",
        "summary": "Sắp tắt do pin yếu. Sạc robot."
      },
      "pt": {
        "title": "Bateria fraca. A desligar.",
        "summary": "Está prestes a desligar-se devido a bateria fraca. Carregue o robô."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Mematikan.",
        "summary": "Akan dimatikan kerana kuasa bateri lemah. Caskan robot."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Kapatılıyor.",
        "summary": "Düşük pil seviyesi nedeniyle kapanmak üzere. Robotu şarj edin."
      },
      "es-LA": {
        "title": "Batería baja. Apagando.",
        "summary": "Está a punto de apagarse debido a que el nivel de batería es bajo. Cargue el robot."
      },
      "ar": {
        "title": "البطارية ضعيفة. إيقاف التشغيل.",
        "summary": "على وشك إيقاف التشغيل بسبب انخفاض مستوى البطارية. اشحن الروبوت."
      },
      "zh-Hant": {
        "title": "電量過低，即將關機",
        "summary": "主機電量過低，即將關機，請讓主機維持充電狀態。"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Vypnutí.",
        "summary": "Brzy se vypne kvůli vybití baterie. Nabijte robota."
      },
      "hu": {
        "title": "Alacsony töltöttség. Kikapcsolás.",
        "summary": "Az alacsony akkumulátortöltöttség miatt hamarosan leáll. Töltse fel a robotot."
      },
      "sk": {
        "title": "Slabá batéria. Vypnutie.",
        "summary": "Z dôvodu slabej batérie sa čoskoro vypne. Nabite robota."
      },
      "da": {
        "title": "Lavt batteri. Slukke.",
        "summary": "Ved at lukke ned på grund af lavt batteri. Oplad robotten."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Sammutetaan.",
        "summary": "Sammutetaan akun alhaisen varauksen vuoksi. Lataa robotti."
      },
      "nb": {
        "title": "Lavt batteri: Deaktivere.",
        "summary": "I ferd med å slå seg av på grunn av lavt batteri. Lad roboten."
      },
      "nl": {
        "title": "Batterij bijna leeg. Uitschakelen.",
        "summary": "Gaat uitschakelen vanwege een bijna lege batterij. Laad de robot op."
      },
      "sv": {
        "title": "Lågt batteri. Stänger av.",
        "summary": "Stänger snart av på grund av lågt batteri. Ladda roboten."
      }
    },
    "535": {
      "internal": "F_535"
    },
    "536": {
      "internal": "F_536"
    },
    "540": {
      "internal": "F_540"
    },
    "541": {
      "internal": "F_541"
    },
    "542": {
      "internal": "F_542"
    },
    "550": {
      "internal": "F_550"
    },
    "551": {
      "internal": "F_551"
    },
    "559": {
      "internal": "F_559"
    },
    "560": {
      "internal": "F_560",
      "zh": {
        "title": "边刷可能缠绕异物，请拆卸并清理",
        "summary": "边刷可能缠绕异物，请取下边刷并清理"
      },
      "en": {
        "title": "Side brush entangled. Remove and clean it.",
        "summary": "Side brush entangled. Remove and clean it."
      },
      "fr": {
        "title": "Enchevêtrement au niveau de la brosse latérale. Retirez-la et nettoyez-la.",
        "summary": "Enchevêtrement au niveau de la brosse latérale. Retirez-la et nettoyez-la."
      },
      "de": {
        "title": "Seitenbürste verheddert. Entferne und reinige sie.",
        "summary": "Seitenbürste verheddert. Entferne und reinige sie."
      },
      "es": {
        "title": "Cepillo lateral enredado. Retírelo y límpielo.",
        "summary": "Cepillo lateral enredado. Retírelo y límpielo."
      },
      "ko": {
        "title": "사이드 브러시에 이물질이 감겼을 수 있습니다. 분리하여 이물질을 제거하세요.",
        "summary": "사이드 브러시에 이물질이 감겼을 수 있습니다. 해당 브러시를 분리하여 이물질을 제거하세요."
      },
      "ru": {
        "title": "Запуталась боковая щетка. Извлеките и очистите щетку.",
        "summary": "Запуталась боковая щетка. Извлеките и очистите щетку."
      },
      "he": {
        "title": "מברשת צדדית הסתבכה. הוציאו ונקו אותה.",
        "summary": "מברשת צדדית הסתבכה. הוציאו ונקו אותה."
      },
      "id": {
        "title": "Sikat samping tersangkut. Lepaskan dan bersihkan.",
        "summary": "Sikat samping tersangkut. Lepaskan dan bersihkan."
      },
      "pl": {
        "title": "Szczotka boczna jest zaplątana. Zdejmij i wyczyść.",
        "summary": "Szczotka boczna jest zaplątana. Zdejmij i wyczyść."
      },
      "ro": {
        "title": "Perie laterală blocată. Scoateți-o și curățați-o.",
        "summary": "Perie laterală blocată. Scoateți-o și curățați-o."
      },
      "th": {
        "title": "แปรงด้านข้างติดพัน โปรดถอดและทำความสะอาด",
        "summary": "แปรงด้านข้างติดพัน โปรดถอดและทำความสะอาด"
      },
      "uk": {
        "title": "На бічну щітку намоталося сміття. Зніміть і очистьте її.",
        "summary": "На бічну щітку намоталося сміття. Зніміть і очистьте її."
      },
      "it": {
        "title": "Spazzola laterale impigliata. Rimuoverla e pulirla.",
        "summary": "Spazzola laterale impigliata. Rimuoverla e pulirla."
      },
      "ja": {
        "title": "サイドブラシが絡まっています。サイドブラシを取り外して、掃除してください。",
        "summary": "サイドブラシが絡まっています。サイドブラシを取り外して、掃除してください。"
      },
      "vi": {
        "title": "Chổi bên bị rối. Hãy tháo và làm sạch.",
        "summary": "Chổi bên bị rối. Hãy tháo và làm sạch."
      },
      "pt": {
        "title": "Escova lateral emaranhada. Remova e limpe.",
        "summary": "Escova lateral emaranhada. Remova e limpe."
      },
      "ms": {
        "title": "Berus sisi tersangkut. Alih keluar dan bersihkannya.",
        "summary": "Berus sisi tersangkut. Alih keluar dan bersihkannya."
      },
      "tr": {
        "title": "Yan fırça sıkışmış. Çıkarın ve temizleyin.",
        "summary": "Yan fırça sıkışmış. Çıkarın ve temizleyin."
      },
      "es-LA": {
        "title": "El cepillo lateral está enredado. Quítelo y límpielo.",
        "summary": "El cepillo lateral está enredado. Quítelo y límpielo."
      },
      "ar": {
        "title": "الفرشاة الجانبية عالقة. أزلها ونظفها.",
        "summary": "الفرشاة الجانبية عالقة. أزلها ونظفها."
      },
      "zh-Hant": {
        "title": "邊刷可能纏繞異物，請取下邊刷並清理",
        "summary": "邊刷可能纏繞異物，請取下邊刷並清理"
      },
      "cs": {
        "title": "Boční kartáč se zamotal. Vyjměte ho a vyčistěte.",
        "summary": "Boční kartáč se zamotal. Vyjměte ho a vyčistěte."
      },
      "hu": {
        "title": "Az oldalkefe beakadt. Távolítsa el és tisztítsa meg.",
        "summary": "Az oldalkefe beakadt. Távolítsa el és tisztítsa meg."
      },
      "sk": {
        "title": "Bočná kefa je zamotaná. Vyberte ju a vyčistite.",
        "summary": "Bočná kefa je zamotaná. Vyberte ju a vyčistite."
      },
      "da": {
        "title": "Sidebørsten sammenfiltrede. Fjern og rengør det.",
        "summary": "Sidebørsten sammenfiltrede. Fjern og rengør det."
      },
      "fi": {
        "title": "Sivuharjassa on kietoutumia. Irrota ja puhdista se.",
        "summary": "Sivuharjassa on kietoutumia. Irrota ja puhdista se."
      },
      "nb": {
        "title": "Sidebørsten viklet seg inn. Fjern og rengjør den.",
        "summary": "Sidebørsten viklet seg inn. Fjern og rengjør den."
      },
      "nl": {
        "title": "Zijborstel vastgelopen. Verwijder en maak schoon.",
        "summary": "Zijborstel vastgelopen. Verwijder en maak schoon."
      },
      "sv": {
        "title": "Sidoborsten har fastnat. Ta bort och rengör den.",
        "summary": "Sidoborsten har fastnat. Ta bort och rengör den."
      }
    },
    "561": {
      "internal": "F_561"
    },
    "562": {
      "internal": "F_562"
    },
    "563": {
      "internal": "F_563"
    },
    "564": {
      "internal": "F_564"
    },
    "565": {
      "internal": "F_565"
    },
    "566": {
      "internal": "F_566"
    },
    "567": {
      "internal": "F_567"
    },
    "568": {
      "internal": "F_568",
      "zh": {
        "title": "请检查并清理驱动轮，并移到新位置启动",
        "summary": "请检查并清理驱动轮，并移到新位置启动"
      },
      "en": {
        "title": "Clean main wheels, move the robot away and restart.",
        "summary": "Clean main wheels, move the robot away and restart."
      },
      "fr": {
        "title": "Nettoyez les roulettes principales, déplacez le robot et redémarrez le nettoyage.",
        "summary": "Nettoyez les roulettes principales, déplacez le robot et redémarrez le nettoyage."
      },
      "de": {
        "title": "Reinige die Haupträder, bewege den Roboter weg und starte ihn neu.",
        "summary": "Reinige die Haupträder, bewege den Roboter weg und starte ihn neu."
      },
      "es": {
        "title": "Limpie las ruedas principales, traslade el robot aspirador a otra ubicación y reinicie.",
        "summary": "Limpie las ruedas principales, traslade el robot aspirador a otra ubicación y reinicie."
      },
      "ko": {
        "title": "구동 바퀴를 점검 및 청소하고 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "구동 바퀴를 점검 및 청소하고 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Очистите основные колеса, переместите робота в другое место и перезапустите.",
        "summary": "Очистите основные колеса, переместите робота в другое место и перезапустите."
      },
      "he": {
        "title": "נקו את הגלגלים הראשיים, הזיזו את רובוט והפעילו מחדש.",
        "summary": "נקו את הגלגלים הראשיים, הזיזו את רובוט והפעילו מחדש."
      },
      "id": {
        "title": "Bersihkan roda utama, pindahkan robot, lalu mulai ulang.",
        "summary": "Bersihkan roda utama, pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Wyczyść kółka główne, przenieś robota i uruchom ponownie.",
        "summary": "Wyczyść kółka główne, przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Curățați roțile principale, mutați robotul într-o altă locație și porniți-l din nou.",
        "summary": "Curățați roțile principale, mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "ทำความสะอาดล้อหลัก ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่",
        "summary": "ทำความสะอาดล้อหลัก ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่"
      },
      "uk": {
        "title": "Очистьте основні колеса, заберіть робота й перезавантажте його.",
        "summary": "Очистьте основні колеса, заберіть робота й перезавантажте його."
      },
      "it": {
        "title": "Pulire le ruote principali, allontanare il robot e riavviarlo.",
        "summary": "Pulire le ruote principali, allontanare il robot e riavviarlo."
      },
      "ja": {
        "title": "後輪を掃除し、本体を移動させてから再起動してください。",
        "summary": "後輪を掃除し、本体を移動させてから再起動してください。"
      },
      "vi": {
        "title": "Vệ sinh bánh xe chính, di chuyển robot ra xa và khởi động lại.",
        "summary": "Vệ sinh bánh xe chính, di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "Limpe as rodas principais, afaste o robô e reinicie.",
        "summary": "Limpe as rodas principais, afaste o robô e reinicie."
      },
      "ms": {
        "title": "Bersihkan roda utama, alihkan robot ke tempat lain dan mulakan semula.",
        "summary": "Bersihkan roda utama, alihkan robot ke tempat lain dan mulakan semula."
      },
      "tr": {
        "title": "Ana tekerlekleri temizleyin, robotu uzaklaştırın ve yeniden başlatın.",
        "summary": "Ana tekerlekleri temizleyin, robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "Limpie las ruedas principales, aleje el robot y reinícielo.",
        "summary": "Limpie las ruedas principales, aleje el robot y reinícielo."
      },
      "ar": {
        "title": "نظف العجلات الرئيسية، وحرك الروبوت بعيدًا وأعد تشغيله.",
        "summary": "نظف العجلات الرئيسية، وحرك الروبوت بعيدًا وأعد تشغيله."
      },
      "zh-Hant": {
        "title": "請檢查並清理驅動輪，並移到新位置後啟動",
        "summary": "請檢查並清理驅動輪，並移到新位置後啟動"
      },
      "cs": {
        "title": "Vyčistěte hlavní kola, odsuňte robot a restartujte.",
        "summary": "Vyčistěte hlavní kola, odsuňte robot a restartujte."
      },
      "hu": {
        "title": "Tisztítsa meg a fő kerekeket, helyezze arrébb a robotot, és indítsa újra.",
        "summary": "Tisztítsa meg a fő kerekeket, helyezze arrébb a robotot, és indítsa újra."
      },
      "sk": {
        "title": "Vyčistite hlavné kolieska, odsuňte robota a reštartujte ho.",
        "summary": "Vyčistite hlavné kolieska, odsuňte robot a reštartujte ho."
      },
      "da": {
        "title": "Rengør hovedhjulene, flyt robotten væk og genstart.",
        "summary": "Rengør hovedhjulene, flyt robotten væk og genstart."
      },
      "fi": {
        "title": "Puhdista päärenkaat, siirrä robotti pois ja käynnistä uudelleen.",
        "summary": "Puhdista päärenkaat, siirrä robotti pois ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Rengjør hovedhjulene, flytt roboten bort og start på nytt.",
        "summary": "Rengjør hovedhjulene, flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "Reinig de hoofdwielen, verplaats de robot en start opnieuw op.",
        "summary": "Reinig de hoofdwielen, verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "Rengör huvudhjulen, ta bort roboten och starta om.",
        "summary": "Rengör huvudhjulen, ta bort roboten och starta om."
      }
    },
    "569": {
      "internal": "F_569",
      "zh": {
        "title": "请检查并清理驱动轮，并移到新位置启动",
        "summary": "请检查并清理驱动轮，并移到新位置启动"
      },
      "en": {
        "title": "Clean main wheels, move the robot away and restart.",
        "summary": "Clean main wheels, move the robot away and restart."
      },
      "fr": {
        "title": "Nettoyez les roulettes principales, déplacez le robot et redémarrez le nettoyage.",
        "summary": "Nettoyez les roulettes principales, déplacez le robot et redémarrez le nettoyage."
      },
      "de": {
        "title": "Reinige die Haupträder, bewege den Roboter weg und starte ihn neu.",
        "summary": "Reinige die Haupträder, bewege den Roboter weg und starte ihn neu."
      },
      "es": {
        "title": "Limpie las ruedas principales, traslade el robot aspirador a otra ubicación y reinicie.",
        "summary": "Limpie las ruedas principales, traslade el robot aspirador a otra ubicación y reinicie."
      },
      "ko": {
        "title": "구동 바퀴를 점검 및 청소하고 새로운 위치로 옮겨 다시 시작하세요.",
        "summary": "구동 바퀴를 점검 및 청소하고 새로운 위치로 옮겨 다시 시작하세요."
      },
      "ru": {
        "title": "Очистите основные колеса, переместите робота в другое место и перезапустите.",
        "summary": "Очистите основные колеса, переместите робота в другое место и перезапустите."
      },
      "he": {
        "title": "נקו את הגלגלים הראשיים, הזיזו את רובוט והפעילו מחדש.",
        "summary": "נקו את הגלגלים הראשיים, הזיזו את רובוט והפעילו מחדש."
      },
      "id": {
        "title": "Bersihkan roda utama, pindahkan robot, lalu mulai ulang.",
        "summary": "Bersihkan roda utama, pindahkan robot, lalu mulai ulang."
      },
      "pl": {
        "title": "Wyczyść kółka główne, przenieś robota i uruchom ponownie.",
        "summary": "Wyczyść kółka główne, przenieś robota i uruchom ponownie."
      },
      "ro": {
        "title": "Curățați roțile principale, mutați robotul într-o altă locație și porniți-l din nou.",
        "summary": "Curățați roțile principale, mutați robotul într-o altă locație și porniți-l din nou."
      },
      "th": {
        "title": "ทำความสะอาดล้อหลัก ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่",
        "summary": "ทำความสะอาดล้อหลัก ย้ายหุ่นยนต์ออกจากตำแหน่งปัจจุบันและเริ่มต้นใหม่"
      },
      "uk": {
        "title": "Очистьте основні колеса, заберіть робота й перезавантажте його.",
        "summary": "Очистьте основні колеса, заберіть робота й перезавантажте його."
      },
      "it": {
        "title": "Pulire le ruote principali, allontanare il robot e riavviarlo.",
        "summary": "Pulire le ruote principali, allontanare il robot e riavviarlo."
      },
      "ja": {
        "title": "後輪を掃除し、本体を移動させてから再起動してください。",
        "summary": "後輪を掃除し、本体を移動させてから再起動してください。"
      },
      "vi": {
        "title": "Vệ sinh bánh xe chính, di chuyển robot ra xa và khởi động lại.",
        "summary": "Vệ sinh bánh xe chính, di chuyển robot ra xa và khởi động lại."
      },
      "pt": {
        "title": "Limpe as rodas principais, afaste o robô e reinicie.",
        "summary": "Limpe as rodas principais, afaste o robô e reinicie."
      },
      "ms": {
        "title": "Bersihkan roda utama, alihkan robot ke tempat lain dan mulakan semula.",
        "summary": "Bersihkan roda utama, alihkan robot ke tempat lain dan mulakan semula."
      },
      "tr": {
        "title": "Ana tekerlekleri temizleyin, robotu uzaklaştırın ve yeniden başlatın.",
        "summary": "Ana tekerlekleri temizleyin, robotu uzaklaştırın ve yeniden başlatın."
      },
      "es-LA": {
        "title": "Limpie las ruedas principales, aleje el robot y reinícielo.",
        "summary": "Limpie las ruedas principales, aleje el robot y reinícielo."
      },
      "ar": {
        "title": "نظف العجلات الرئيسية، وحرك الروبوت بعيدًا وأعد تشغيله.",
        "summary": "نظف العجلات الرئيسية، وحرك الروبوت بعيدًا وأعد تشغيله."
      },
      "zh-Hant": {
        "title": "請檢查並清理驅動輪，並移到新位置後啟動",
        "summary": "請檢查並清理驅動輪，並移到新位置後啟動"
      },
      "cs": {
        "title": "Vyčistěte hlavní kola, odsuňte robot a restartujte.",
        "summary": "Vyčistěte hlavní kola, odsuňte robot a restartujte."
      },
      "hu": {
        "title": "Tisztítsa meg a fő kerekeket, helyezze arrébb a robotot, és indítsa újra.",
        "summary": "Tisztítsa meg a fő kerekeket, helyezze arrébb a robotot, és indítsa újra."
      },
      "sk": {
        "title": "Vyčistite hlavné kolieska, odsuňte robota a reštartujte ho.",
        "summary": "Vyčistite hlavné kolieska, odsuňte robot a reštartujte ho."
      },
      "da": {
        "title": "Rengør hovedhjulene, flyt robotten væk og genstart.",
        "summary": "Rengør hovedhjulene, flyt robotten væk og genstart."
      },
      "fi": {
        "title": "Puhdista päärenkaat, siirrä robotti pois ja käynnistä uudelleen.",
        "summary": "Puhdista päärenkaat, siirrä robotti pois ja käynnistä uudelleen."
      },
      "nb": {
        "title": "Rengjør hovedhjulene, flytt roboten bort og start på nytt.",
        "summary": "Rengjør hovedhjulene, flytt roboten bort og start på nytt."
      },
      "nl": {
        "title": "Reinig de hoofdwielen, verplaats de robot en start opnieuw op.",
        "summary": "Reinig de hoofdwielen, verplaats de robot en start opnieuw op."
      },
      "sv": {
        "title": "Rengör huvudhjulen, ta bort roboten och starta om.",
        "summary": "Rengör huvudhjulen, ta bort roboten och starta om."
      }
    },
    "570": {
      "internal": "F_570",
      "zh": {
        "title": "主刷可能缠绕异物，请拆卸主刷并清理刷毛及轴承",
        "summary": "主刷可能缠绕异物，请拆卸主刷并清理刷毛及轴承"
      },
      "en": {
        "title": "Main brush entangled. Remove and clean it and its bearing.",
        "summary": "Main brush entangled. Remove and clean it and its bearing."
      },
      "fr": {
        "title": "Enchevêtrement au niveau de la brosse principale. Retirez-la et nettoyez-la ainsi que son roulement.",
        "summary": "Enchevêtrement au niveau de la brosse principale. Retirez-la et nettoyez-la ainsi que son roulement."
      },
      "de": {
        "title": "Hauptbürste verheddert. Entferne und reinige sie sowie das Lager.",
        "summary": "Hauptbürste verheddert. Entferne und reinige sie sowie das Lager."
      },
      "es": {
        "title": "Cepillo principal enredado. Retírelo y limpie el cepillo principal y el cojinete.",
        "summary": "Cepillo principal enredado. Retírelo y limpie el cepillo principal y el cojinete."
      },
      "ko": {
        "title": "메인 브러시에 이물질이 감겼을 수 있습니다. 분리하여 브러시 및 베어링을 청소하세요.",
        "summary": "메인 브러시에 이물질이 감겼을 수 있습니다. 분리하여 브러시 및 베어링을 청소하세요."
      },
      "ru": {
        "title": "Запуталась основная щетка. Извлеките и очистите ее вместе с подшипниками.",
        "summary": "Запуталась основная щетка. Извлеките и очистите ее вместе с подшипниками."
      },
      "he": {
        "title": "מברשת ראשית הסתבכה. הסירו ונקו אותו ואת המיסב.",
        "summary": "מברשת ראשית הסתבכה. הסירו ונקו אותו ואת המיסב."
      },
      "id": {
        "title": "Sikat utama tersangkut. Lepaskan, lalu bersihkan sikat utama dan bantalannya.",
        "summary": "Sikat utama tersangkut. Lepaskan, lalu bersihkan sikat utama dan bantalannya."
      },
      "pl": {
        "title": "Szczotka główna jest zaplątana. Wyjmij i wyczyść ją oraz jej łożysko.",
        "summary": "Szczotka główna jest zaplątana. Wyjmij i wyczyść ją oraz jej łożysko."
      },
      "ro": {
        "title": "Perie principală blocată. Scoateți și curățați peria și rulmentul.",
        "summary": "Perie principală blocată. Scoateți și curățați peria și rulmentul."
      },
      "th": {
        "title": "แปรงหลักติดพัน โปรดถอดและทำความสะอาดทั้งตัวแปรงและแบริ่ง",
        "summary": "แปรงหลักติดพัน โปรดถอดและทำความสะอาดทั้งตัวแปรงและแบริ่ง"
      },
      "uk": {
        "title": "На основну щітку намоталося сміття. Зніміть щітку й очистьте її разом із валом.",
        "summary": "На основну щітку намоталося сміття. Зніміть щітку й очистьте її разом із валом."
      },
      "it": {
        "title": "Spazzola principale impigliata. Rimuoverla e pulirla insieme al relativo cuscinetto.",
        "summary": "Spazzola principale impigliata. Rimuoverla e pulirla insieme al relativo cuscinetto."
      },
      "ja": {
        "title": "メインブラシが絡まっています。メインブラシとベアリングを取り外して掃除してください。",
        "summary": "メインブラシが絡まっています。メインブラシとベアリングを取り外して掃除してください。"
      },
      "vi": {
        "title": "Chổi chính bị rối. Tháo và vệ sinh chổi chính và vòng bi của chổi.",
        "summary": "Chổi chính bị rối. Tháo và vệ sinh chổi chính và vòng bi của chổi."
      },
      "pt": {
        "title": "Escova principal emaranhada. Remova-a e limpe-a, bem como o respetivo rolamento.",
        "summary": "Escova principal emaranhada. Remova-a e limpe-a, bem como o respetivo rolamento."
      },
      "ms": {
        "title": "Berus utama tersangkut. Keluarkan dan bersihkan berus serta galasnya.",
        "summary": "Berus utama tersangkut. Keluarkan dan bersihkan berus serta galasnya."
      },
      "tr": {
        "title": "Ana fırça sıkışmış. Sökün ve rulmanını temizleyin.",
        "summary": "Ana fırça sıkışmış. Sökün ve rulmanını temizleyin."
      },
      "es-LA": {
        "title": "El cepillo lateral está atascado. Quítelo y límpielo, junto con su cojinete.",
        "summary": "El cepillo principal está atascado. Quítelo y límpielo, junto con su cojinete."
      },
      "ar": {
        "title": "الفرشاة الرئيسية عالقة. أزلها ونظفها ونظف المحمل.",
        "summary": "الفرشاة الرئيسية عالقة. أزلها ونظفها ونظف المحمل."
      },
      "zh-Hant": {
        "title": "主刷可能纏繞異物，請拆卸主刷並清理刷毛及軸承",
        "summary": "主刷可能纏繞異物，請拆卸主刷並清理刷毛及軸承"
      },
      "cs": {
        "title": "Hlavní kartáč se zamotal. Vyjměte jej a vyčistěte včetně jeho ložiska.",
        "summary": "Hlavní kartáč se zamotal. Vyjměte jej a vyčistěte včetně jeho ložiska."
      },
      "hu": {
        "title": "A fő kefe beakadt. Távolítsa el és tisztítsa meg a csapággyal együtt.",
        "summary": "A fő kefe beakadt. Távolítsa el és tisztítsa meg a csapággyal együtt."
      },
      "sk": {
        "title": "Hlavná kefa je zamotaná. Vyberte a vyčistite ju a jej ložisko.",
        "summary": "Hlavná kefa je zamotaná. Vyberte a vyčistite ju a jej ložisko."
      },
      "da": {
        "title": "Hovedbørsten sammenfiltrede. Fjern og rengør den og dens leje.",
        "summary": "Hovedbørsten sammenfiltrede. Fjern og rengør den og dens leje."
      },
      "fi": {
        "title": "Pääharjassa on kietoutumia. Irrota ja puhdista se sekä sen laakeri.",
        "summary": "Pääharjassa on kietoutumia. Irrota ja puhdista se sekä sen laakeri."
      },
      "nb": {
        "title": "Hovedbørsten viklet seg inn. Fjern og rengjør den og lageret.",
        "summary": "Hovedbørsten viklet seg inn. Fjern og rengjør den og lageret."
      },
      "nl": {
        "title": "Hoofdborstel vastgelopen. Verwijder en reinig deze en het lager.",
        "summary": "Hoofdborstel vastgelopen. Verwijder en reinig deze en het lager."
      },
      "sv": {
        "title": "Huvudborsten har fastnat. Ta bort och rengör den och dess lager.",
        "summary": "Huvudborsten har fastnat. Ta bort och rengör den och dess lager."
      }
    },
    "571": {
      "internal": "F_571"
    },
    "572": {
      "internal": "F_572",
      "zh": {
        "title": "检测到禁区或虚拟墙，请将主机搬离此区域",
        "summary": "检测到禁区或虚拟墙，请将主机搬离此区域"
      },
      "en": {
        "title": "Main brush entangled. Remove and clean it and its bearing.",
        "summary": "Main brush entangled. Remove and clean it and its bearing."
      },
      "fr": {
        "title": "Enchevêtrement au niveau de la brosse principale. Retirez-la et nettoyez-la ainsi que son roulement.",
        "summary": "Enchevêtrement au niveau de la brosse principale. Retirez-la et nettoyez-la ainsi que son roulement."
      },
      "de": {
        "title": "Hauptbürste verheddert. Entferne und reinige sie sowie das Lager.",
        "summary": "Hauptbürste verheddert. Entferne und reinige sie sowie das Lager."
      },
      "es": {
        "title": "Cepillo principal enredado. Retírelo y limpie el cepillo principal y el cojinete.",
        "summary": "Cepillo principal enredado. Retírelo y limpie el cepillo principal y el cojinete."
      },
      "ko": {
        "title": "진입 금지 영역 또는 가상 벽이 감지되었습니다. 본체를 현재 위치에서 옮기세요.",
        "summary": "진입 금지 영역 또는 가상 벽이 감지되었습니다. 본체를 현재 위치에서 옮기세요."
      },
      "ru": {
        "title": "Запуталась основная щетка. Извлеките и очистите ее вместе с подшипниками.",
        "summary": "Запуталась основная щетка. Извлеките и очистите ее вместе с подшипниками."
      },
      "he": {
        "title": "מברשת ראשית הסתבכה. הסירו ונקו אותו ואת המיסב.",
        "summary": "מברשת ראשית הסתבכה. הסירו ונקו אותו ואת המיסב."
      },
      "id": {
        "title": "Sikat utama tersangkut. Lepaskan, lalu bersihkan sikat utama dan bantalannya.",
        "summary": "Sikat utama tersangkut. Lepaskan, lalu bersihkan sikat utama dan bantalannya."
      },
      "pl": {
        "title": "Szczotka główna jest zaplątana. Wyjmij i wyczyść ją oraz jej łożysko.",
        "summary": "Szczotka główna jest zaplątana. Wyjmij i wyczyść ją oraz jej łożysko."
      },
      "ro": {
        "title": "Perie principală blocată. Scoateți și curățați peria și rulmentul.",
        "summary": "Perie principală blocată. Scoateți și curățați peria și rulmentul."
      },
      "th": {
        "title": "แปรงหลักติดพัน โปรดถอดและทำความสะอาดทั้งตัวแปรงและแบริ่ง",
        "summary": "แปรงหลักติดพัน โปรดถอดและทำความสะอาดทั้งตัวแปรงและแบริ่ง"
      },
      "uk": {
        "title": "На основну щітку намоталося сміття. Зніміть щітку й очистьте її разом із валом.",
        "summary": "На основну щітку намоталося сміття. Зніміть щітку й очистьте її разом із валом."
      },
      "it": {
        "title": "Spazzola principale impigliata. Rimuoverla e pulirla insieme al relativo cuscinetto.",
        "summary": "Spazzola principale impigliata. Rimuoverla e pulirla insieme al relativo cuscinetto."
      },
      "ja": {
        "title": "進入禁止エリアまたはバーチャルウォールが検出されました。ロボット掃除機を移動させてください。",
        "summary": "進入禁止エリアまたはバーチャルウォールが検出されました。ロボット掃除機を移動させてください。"
      },
      "vi": {
        "title": "Chổi chính bị rối. Tháo và vệ sinh chổi chính và vòng bi của chổi.",
        "summary": "Chổi chính bị rối. Tháo và vệ sinh chổi chính và vòng bi của chổi."
      },
      "pt": {
        "title": "Escova principal emaranhada. Remova-a e limpe-a, bem como o respetivo rolamento.",
        "summary": "Escova principal emaranhada. Remova-a e limpe-a, bem como o respetivo rolamento."
      },
      "ms": {
        "title": "Berus utama tersangkut. Keluarkan dan bersihkan berus serta galasnya.",
        "summary": "Berus utama tersangkut. Keluarkan dan bersihkan berus serta galasnya."
      },
      "tr": {
        "title": "Ana fırça sıkışmış. Sökün ve rulmanını temizleyin.",
        "summary": "Ana fırça sıkışmış. Sökün ve rulmanını temizleyin."
      },
      "es-LA": {
        "title": "El cepillo principal está atascado. Quítelo y límpielo, junto con su cojinete.",
        "summary": "El cepillo principal está atascado. Quítelo y límpielo, junto con su cojinete."
      },
      "ar": {
        "title": "الفرشاة الرئيسية عالقة. أزلها ونظفها ونظف المحمل.",
        "summary": "الفرشاة الرئيسية عالقة. أزلها ونظفها ونظف المحمل."
      },
      "zh-Hant": {
        "title": "偵測到禁區或虛擬牆，請將主機搬離此區域",
        "summary": "偵測到禁區或虛擬牆，請將主機搬離此區域"
      },
      "cs": {
        "title": "Hlavní kartáč se zamotal. Vyjměte jej a vyčistěte včetně jeho ložiska.",
        "summary": "Hlavní kartáč se zamotal. Vyjměte jej a vyčistěte včetně jeho ložiska."
      },
      "hu": {
        "title": "A fő kefe beakadt. Távolítsa el és tisztítsa meg a csapággyal együtt.",
        "summary": "A fő kefe beakadt. Távolítsa el és tisztítsa meg a csapággyal együtt."
      },
      "sk": {
        "title": "Hlavná kefa je zamotaná. Vyberte a vyčistite ju a jej ložisko.",
        "summary": "Hlavná kefa je zamotaná. Vyberte a vyčistite ju a jej ložisko."
      },
      "da": {
        "title": "Hovedbørsten sammenfiltrede. Fjern og rengør den og dens leje.",
        "summary": "Hovedbørsten sammenfiltrede. Fjern og rengør den og dens leje."
      },
      "fi": {
        "title": "Pääharjassa on kietoutumia. Irrota ja puhdista se sekä sen laakeri.",
        "summary": "Pääharjassa on kietoutumia. Irrota ja puhdista se sekä sen laakeri."
      },
      "nb": {
        "title": "Hovedbørsten viklet seg inn. Fjern og rengjør den og lageret.",
        "summary": "Hovedbørsten viklet seg inn. Fjern og rengjør den og lageret."
      },
      "nl": {
        "title": "Hoofdborstel vastgelopen. Verwijder en reinig deze en het lager.",
        "summary": "Hoofdborstel vastgelopen. Verwijder en reinig deze en het lager."
      },
      "sv": {
        "title": "Huvudborsten har fastnat. Ta bort och rengör den och dess lager.",
        "summary": "Huvudborsten har fastnat. Ta bort och rengör den och dess lager."
      }
    },
    "573": {
      "internal": "F_573"
    },
    "574": {
      "internal": "F_574"
    },
    "580": {
      "internal": "F_580"
    },
    "581": {
      "internal": "F_581"
    },
    "582": {
      "internal": "F_582"
    },
    "583": {
      "internal": "F_583"
    },
    "584": {
      "internal": "F_584"
    },
    "585": {
      "internal": "F_585"
    },
    "586": {
      "internal": "F_586"
    },
    "587": {
      "internal": "F_587"
    },
    "588": {
      "internal": "F_588"
    },
    "589": {
      "internal": "F_589"
    },
    "590": {
      "internal": "F_590"
    },
    "591": {
      "internal": "F_591"
    },
    "592": {
      "internal": "F_592"
    },
    "593": {
      "internal": "F_593"
    },
    "594": {
      "internal": "F_594",
      "zh": {
        "title": "请确认集尘袋已装好",
        "summary": "集尘袋未安装，请确认集尘袋安装到位"
      },
      "en": {
        "title": "Make sure the dust bag is properly installed.",
        "summary": "Dust bag not installed. Check that it is installed properly."
      },
      "fr": {
        "title": "Vérifiez que le sac à poussière est correctement installé.",
        "summary": "Le sac à poussière n’est pas installé. Vérifiez qu’il est installé correctement."
      },
      "de": {
        "title": "Vergewissere dich, dass der Staubbeutel ordnungsgemäß installiert ist.",
        "summary": "Staubbeutel ist nicht eingesetzt. Überprüfe, ob er korrekt installiert ist."
      },
      "es": {
        "title": "Asegúrese de que la bolsa para polvo esté correctamente instalada.",
        "summary": "La bolsa para polvo no está instalada. Compruebe que esté bien instalada."
      },
      "ko": {
        "title": "더스트백이 제대로 장착되었는지 확인하세요.",
        "summary": "더스트백이 장착되지 않았습니다. 제대로 장착하세요."
      },
      "ru": {
        "title": "Убедитесь, что мешок для пыли установлен надлежащим образом.",
        "summary": "Не установлен мешок для пыли. Установите его надлежащим образом."
      },
      "he": {
        "title": "ודאו ששקית האבק מותקנת כראוי",
        "summary": "שקית אבק לא מותקנת. וודאו שהשקית מותקנת כראוי."
      },
      "id": {
        "title": "Pastikan kantong sampah terpasang dengan benar.",
        "summary": "Kantong sampah tidak terpasang. Periksa jika kantong sampah terpasang dengan benar."
      },
      "pl": {
        "title": "Upewnij się, że worek na kurz jest poprawnie zamontowany.",
        "summary": "Worek na kurz nie został zamontowany. Sprawdź, czy został zainstalowany poprawnie."
      },
      "ro": {
        "title": "Asigurați-vă că sacul de praf este montat corect.",
        "summary": "Sacul de praf nu este montat. Asigurați-vă că este montat corect."
      },
      "th": {
        "title": "ตรวจสอบว่าติดตั้งถุงเก็บฝุ่นอย่างเหมาะสมหรือไม่",
        "summary": "ไม่ได้ติดตั้งถุงเก็บฝุ่น ตรวจสอบว่าได้ติดตั้งอย่างเหมาะสมหรือไม่"
      },
      "uk": {
        "title": "Переконайтеся, що мішок для пилу встановлено правильно.",
        "summary": "Мішок для пилу не встановлено. Перевірте, що його правильно встановлено."
      },
      "it": {
        "title": "Accertarsi che il sacchetto per la polvere sia installato correttamente.",
        "summary": "Sacchetto per la polvere non installato. Verificare che sia installato correttamente."
      },
      "ja": {
        "title": "ゴミ収集ドック用紙パックが正しく取り付けられていることを確認してください。",
        "summary": "ゴミ収集ドック用紙パックが取り付けられていません。正しく取り付けてください。"
      },
      "vi": {
        "title": "Đảm bảo túi đựng bụi đã được lắp đúng cách.",
        "summary": "Chưa lắp túi đựng bụi. Kiểm tra xem đã được lắp đúng cách chưa."
      },
      "pt": {
        "title": "Certifique-se de que o saco para o pó está corretamente instalado.",
        "summary": "Saco para o pó não instalado. Verifique se está corretamente instalado."
      },
      "ms": {
        "title": "Pastikan beg habuk telah dipasang dengan betul.",
        "summary": "Beg habuk tidak dipasang. Periksa sama ada ia telah dipasangkan dengan betul."
      },
      "tr": {
        "title": "Toz torbasının düzgün takıldığından emin olun.",
        "summary": "Toz torbası takılı değil. Düzgün takılıp takılmadığını kontrol edin."
      },
      "es-LA": {
        "title": "Asegúrese de que la bolsa de polvo esté instalada correctamente.",
        "summary": "La bolsa de polvo no está instalada. Compruebe que esté instalada correctamente."
      },
      "ar": {
        "title": "تحقق من أن كيس الأتربة مُثبت بشكل صحيح.",
        "summary": "كيس الأتربة غير مُثبت. تحقق من أنه مُثبت بشكل صحيح."
      },
      "zh-Hant": {
        "title": "請確認集塵袋已安裝妥當",
        "summary": "集塵袋未安裝，請確認集塵袋安裝到位"
      },
      "cs": {
        "title": "Zkontrolujte, zda je prachový sáček správně nainstalován.",
        "summary": "Prachový sáček není instalován. Zkontrolujte, zda je instalován správně."
      },
      "hu": {
        "title": "Győződjön meg arról, hogy a porzsák megfelelően van-e rögzítve.",
        "summary": "A porzsák nincs rögzítve. Ellenőrizze, hogy megfelelően van-e rögzítve."
      },
      "sk": {
        "title": "Uistite sa, že vrecko na prach je riadne vložené.",
        "summary": "Vrecko na prach nie je vložené. Skontrolujte, či je riadne vložené."
      },
      "da": {
        "title": "Sørg for, at støvposen er korrekt installeret.",
        "summary": "Støvpose ikke installeret. Kontroller, at den er installeret korrekt."
      },
      "fi": {
        "title": "Varmista, että pölypussi on asennettu oikein.",
        "summary": "Pölypussia ei ole asennettu. Tarkista, että se on asennettu kunnolla."
      },
      "nb": {
        "title": "Kontroller at støvposen er riktig installert.",
        "summary": "Støvpose ikke installert. Kontroller at den er riktig installert."
      },
      "nl": {
        "title": "Zorg ervoor dat de stofzak correct is geplaatst.",
        "summary": "Stofzak niet geplaatst. Controleer of deze correct is geplaatst."
      },
      "sv": {
        "title": "Kontrollera att dammsugarpåsen sitter som den ska.",
        "summary": "Dammsugarpåsen sitter inte i. Kontrollera att den sitter som den ska."
      }
    },
    "601": {
      "internal": "F_601"
    },
    "602": {
      "internal": "F_602"
    },
    "603": {
      "internal": "F_603"
    },
    "604": {
      "internal": "F_604"
    },
    "605": {
      "internal": "F_605"
    },
    "611": {
      "internal": "F_611",
      "zh": {
        "title": "定位失败，请将主机搬回基站后重新建图",
        "summary": "定位失败，请将主机搬回基站后重新建图"
      },
      "en": {
        "title": "Positioning failed. Move the robot back to the dock and remap.",
        "summary": "Positioning failed. Move the robot back to the dock and remap."
      },
      "fr": {
        "title": "Échec de positionnement. Ramenez le robot à la station et effectuez à nouveau la cartographie.",
        "summary": "Échec de positionnement. Ramenez le robot à la station et effectuez à nouveau la cartographie."
      },
      "de": {
        "title": "Positionierung fehlgeschlagen. Bringe den Roboter zurück zur Dockingstation und starte die Kartierung neu.",
        "summary": "Positionierung fehlgeschlagen. Bringe den Roboter zurück zur Dockingstation und starte die Kartierung neu."
      },
      "es": {
        "title": "Posicionamiento fallido. Lleve el robot a la base y repita el mapeo.",
        "summary": "Posicionamiento fallido. Lleve el robot a la base y repita el mapeo."
      },
      "ko": {
        "title": "위치 추적에 실패하였습니다. 본체를 도크로 옮긴 후 지도를 다시 생성하세요.",
        "summary": "위치 추적에 실패하였습니다. 본체를 도크로 옮긴 후 지도를 다시 생성하세요."
      },
      "ru": {
        "title": "Сбой позиционирования. Переместите робота на док-станцию и постройте карту заново.",
        "summary": "Сбой позиционирования. Переместите робота на док-станцию и постройте карту заново."
      },
      "he": {
        "title": "תקלת התמצאות במרחב. הזיזו את רובוט בחזרה לתחנת העגינה ומפו מחדש.",
        "summary": "תקלת התמצאות במרחב. הזיזו את רובוט בחזרה לתחנ העגינה ומפו מחדש."
      },
      "id": {
        "title": "Pencarian gagal. Arahkan robot kembali ke dok, lalu petakan ulang.",
        "summary": "Pencarian gagal. Arahkan robot kembali ke dok, lalu petakan ulang."
      },
      "pl": {
        "title": "Pozycjonowanie nie powiodło się. Przenieś robota z powrotem do stacji dokującej i powtórz mapowanie.",
        "summary": "Pozycjonowanie nie powiodło się. Przenieś robota z powrotem do stacji dokującej i powtórz mapowanie."
      },
      "ro": {
        "title": "Poziționare nereușită. Mutați robotul înapoi la stația de andocare și recartografiați.",
        "summary": "Poziționare nereușită. Mutați robotul înapoi la stația de andocare și recartografiați."
      },
      "th": {
        "title": "การกำหนดตำแหน่งล้มเหลว ย้ายหุ่นยนต์กลับไปยังแท่นชาร์จและทำแผนที่ใหม่",
        "summary": "การกำหนดตำแหน่งล้มเหลว ย้ายหุ่นยนต์กลับไปยังแท่นชาร์จและทำแผนที่ใหม่"
      },
      "uk": {
        "title": "Помилка визначення положення. Поверніть робота на базову станцію й повторно створіть карту.",
        "summary": "Помилка визначення положення. Поверніть робота на базову станцію й повторно створіть карту."
      },
      "it": {
        "title": "Posizionamento non riuscito. Riportare il robot alla stazione di ricarica e ripetere la mappatura.",
        "summary": "Posizionamento non riuscito. Riportare il robot alla stazione di ricarica e ripetere la mappatura."
      },
      "ja": {
        "title": "位置確認に失敗しました。本体を充電ドックに戻して、マップを作成し直してください。",
        "summary": "位置確認に失敗しました。本体を充電ドックに戻して、マップを作成し直してください。"
      },
      "vi": {
        "title": "Định vị thất bại. Hãy di chuyển robot về dock sạc rồi vẽ lại bản đồ.",
        "summary": "Định vị thất bại. Hãy di chuyển robot về dock sạc rồi vẽ lại bản đồ."
      },
      "pt": {
        "title": "Falha no posicionamento. Mova o robô novamente para a estação e efetue o remapeamento.",
        "summary": "Falha no posicionamento. Mova o robô novamente para a estação e efetue o remapeamento."
      },
      "ms": {
        "title": "Gagal menentukan kedudukan. Alihkan robot tersebut kembali ke dok dan lakukan pemetaan semula.",
        "summary": "Gagal menentukan kedudukan. Alihkan robot tersebut kembali ke dok dan lakukan pemetaan semula."
      },
      "tr": {
        "title": "Konumlandırılamadı. Robotu bağlantı istasyonuna geri döndürün ve yeniden harita çıkartın.",
        "summary": "Konumlandırılamadı. Robotu bağlantı istasyonuna geri döndürün ve yeniden harita çıkartın."
      },
      "es-LA": {
        "title": "Error de posicionamiento. Lleve el robot de vuelta a la base y realice un nuevo mapeo.",
        "summary": "Error de posicionamiento. Lleve el robot de vuelta a la base y realice un nuevo mapeo."
      },
      "ar": {
        "title": "فشل التموضع. حرك الروبوت إلى القاعدة وأعد إنشاء الخريطة.",
        "summary": "فشل التموضع. حرك الروبوت إلى القاعدة وأعد إنشاء الخريطة."
      },
      "zh-Hant": {
        "title": "定位失敗，請將主機搬回基座後重新建立地圖",
        "summary": "定位失敗，請將主機搬回基座後重新建立地圖"
      },
      "cs": {
        "title": "Polohování se nezdařilo. Robota dejte zpět do dokovací stanice a znovu zmapujte.",
        "summary": "Polohování se nezdařilo. Robota dejte zpět do dokovací stanice a znovu zmapujte."
      },
      "hu": {
        "title": "A pozicionálás sikertelen. Helyezze vissza a robotot a dokkba, és képezze le újra.",
        "summary": "A pozicionálás sikertelen. Helyezze vissza a robotot a dokkba, és képezze le újra."
      },
      "sk": {
        "title": "Nastavenie polohy zlyhalo. Presuňte robot naspäť do dokovacej stanice a spustite nové mapovanie.",
        "summary": "Nastavenie polohy zlyhalo. Presuňte robot naspäť do dokovacej stanice a spustite nové mapovanie."
      },
      "da": {
        "title": "Positionering mislykkedes. Flyt robotten tilbage til docken, og tilknyt den igen.",
        "summary": "Positionering mislykkedes. Flyt robotten tilbage til docken, og tilknyt den igen."
      },
      "fi": {
        "title": "Paikannus epäonnistui. Siirrä robotti takaisin telakkaan ja suorita kartoitus uudelleen.",
        "summary": "Paikannus epäonnistui. Siirrä robotti takaisin telakkaan ja suorita kartoitus uudelleen."
      },
      "nb": {
        "title": "Posisjonering mislyktes. Flytt roboten tilbake til ladestasjonen og tilordne den på nytt.",
        "summary": "Posisjonering mislyktes. Flytt roboten tilbake til ladestasjonen og tilordne den på nytt."
      },
      "nl": {
        "title": "Positionering mislukt. Verplaats de robot terug naar het dockingstation en maak een nieuwe kaart.",
        "summary": "Positionering mislukt. Verplaats de robot terug naar het dockingstation en maak een nieuwe kaart."
      },
      "sv": {
        "title": "Positionering misslyckades. Sätt tillbaka roboten på laddningsstationen och kartlägg igen.",
        "summary": "Positionering misslyckades. Sätt tillbaka roboten på laddningsstationen och kartlägg igen."
      }
    },
    "612": {
      "internal": "F_612",
      "zh": {
        "title": "地图发生变化，定位失败，请重新建图",
        "summary": "检测到新环境，地图发生变化，定位失败，请重新建图在使用。"
      },
      "en": {
        "title": "Map changed. Positioning failed. Try again.",
        "summary": "New environment detected. Map changed. Positioning failed. Try again after remapping."
      },
      "fr": {
        "title": "Carte modifiée. Échec de positionnement. Essayez à nouveau.",
        "summary": "Nouvel environnement détecté. Carte modifiée. Échec de positionnement. Essayez à nouveau après la nouvelle cartographie."
      },
      "de": {
        "title": "Karte geändert. Positionierung fehlgeschlagen. Versuche es erneut.",
        "summary": "Neue Firmware erkannt. Karte geändert. Positionierung fehlgeschlagen. Versuche es nach der erneuten Kartierung erneut."
      },
      "es": {
        "title": "Mapa modificado. Posicionamiento fallido. Inténtelo de nuevo.",
        "summary": "Nuevo entorno detectado. Mapa modificado. Posicionamiento fallido. Inténtelo de nuevo después de repetir el mapeo."
      },
      "ko": {
        "title": "지도가 변경되어 위치 추적에 실패하였습니다. 지도를 다시 생성하세요.",
        "summary": "새로운 환경으로 인해 지도가 변경되어 위치 추적에 실패하였습니다. 지도를 다시 생성하세요."
      },
      "ru": {
        "title": "Карта изменена. Сбой позиционирования. Повторите попытку.",
        "summary": "Обнаружена новая обстановка. Карта изменена. Сбой позиционирования. Повторите попытку после повторного построения карты."
      },
      "he": {
        "title": "המפה השתנתה. תקלת התמצאות במרחב. נסה שנית.",
        "summary": "סביבה חדשה זוהתה. המפה השתנתה. תקלת התמצאות במרחב. נסה שנית לאחר מיפוי מחדש."
      },
      "id": {
        "title": "Peta berubah. Pencarian gagal. Coba lagi.",
        "summary": "Lingkungan baru terdeteksi. Peta berubah. Pencarian gagal. Coba lagi setelah memetakan ulang."
      },
      "pl": {
        "title": "Zmieniono mapę. Pozycjonowanie nie powiodło się. Spróbuj ponownie.",
        "summary": "Wykryto nowe środowisko. Zmieniono mapę. Pozycjonowanie nie powiodło się. Spróbuj ponownie po ponownym mapowaniu."
      },
      "ro": {
        "title": "Hartă modificată. Poziționare nereușită. Încercați din nou.",
        "summary": "Mediu nou detectat. Hartă modificată. Poziționarea nu a reușit. Încercați din nou după o nouă cartografiere."
      },
      "th": {
        "title": "แผนที่มีการเปลี่ยนแปลง การกำหนดตำแหน่งล้มเหลว โปรดลองอีกครั้ง",
        "summary": "ตรวจพบสภาพแวดล้อมใหม่ แผนที่มีการเปลี่ยนแปลง การกำหนดตำแหน่งล้มเหลว โปรดลองอีกครั้งหลังจากทำแผนที่ใหม่"
      },
      "uk": {
        "title": "Карту змінено. Помилка визначення положення. Спробуйте ще раз.",
        "summary": "Виявлено нове середовище. Карту змінено. Помилка визначення положення. Спробуйте ще раз після повторного створення карти."
      },
      "it": {
        "title": "Mappa modificata. Posizionamento non riuscito. Riprovare.",
        "summary": "È stato rilevato un nuovo ambiente. Mappa modificata. Posizionamento non riuscito. Riprovare dopo la nuova mappatura."
      },
      "ja": {
        "title": "マップが変更されました。位置確認に失敗しました。もう一度お試しください。",
        "summary": "新しい環境が検出されました。マップが変更されました。位置確認に失敗しました。再度マッピングをしたら、もう一度お試しください。"
      },
      "vi": {
        "title": "Đã thay đổi bản đồ. Định vị thất bại. Hãy thử lại.",
        "summary": "Đã phát hiện môi trường mới. Đã thay đổi bản đồ. Định vị thất bại. Hãy thử lại sau khi vẽ lại bản đồ."
      },
      "pt": {
        "title": "O mapa foi alterado. Falha no posicionamento. Tente novamente.",
        "summary": "Novo ambiente detetado. O mapa foi alterado. Falha no posicionamento. Tente novamente após o remapeamento."
      },
      "ms": {
        "title": "Peta diubah. Gagal menentukan kedudukan. Cuba lagi.",
        "summary": "Persekitaran baharu dikesan. Peta diubah. Gagal menentukan kedudukan. Cuba lagi selepas pemetaan semula."
      },
      "tr": {
        "title": "Harita değişti. Konumlandırılamadı. Tekrar deneyin.",
        "summary": "Yeni ortam algılandı. Harita değişti. Konumlandırılamadı. Yeniden harita çıkarıldıktan sonra tekrar deneyin."
      },
      "es-LA": {
        "title": "El mapa se modificó. Se produjo un error de posicionamiento. Vuelva a intentarlo.",
        "summary": "Se detectó un entorno nuevo. El mapa se modificó. Se produjo un error de posicionamiento. Realice un mapeo nuevo y vuelva a intentarlo."
      },
      "ar": {
        "title": "تم تغيير الخريطة. فشل التموضع. حاول مرة أخرى.",
        "summary": "تم اكتشاف بيئة جديدة. تم تغيير الخريطة. فشل التموضع. أعد المحاولة بعد إعادة إنشاء الخريطة."
      },
      "zh-Hant": {
        "title": "地圖發生變化，定位失敗，請重新建立地圖",
        "summary": "偵測到新環境，地圖已發生變化，定位失敗，請重新建立地圖再使用。"
      },
      "cs": {
        "title": "Mapa se změnila. Polohování se nezdařilo. Zkuste to znovu.",
        "summary": "Zjištěno nové prostředí. Mapa se změnila. Polohování se nezdařilo. Po opětovném mapování to zkuste znovu."
      },
      "hu": {
        "title": "Térkép módosítva. A pozicionálás sikertelen. Próbálja újra.",
        "summary": "Új környezet észlelve. Térkép módosítva. A pozicionálás sikertelen. Próbálja újra az ismételt leképezést követően."
      },
      "sk": {
        "title": "Mapa sa zmenila. Nastavenie polohy zlyhalo. Skúste znova.",
        "summary": "Bolo zistené nové prostredie. Mapa sa zmenila. Nastavenie polohy zlyhalo. Po opätovnom mapovaní to skúste znova."
      },
      "da": {
        "title": "Kortet er ændret. Positionering mislykkedes. Prøv igen.",
        "summary": "Nyt miljø registreret. Kortet er ændret. Positionering mislykkedes. Prøv igen efter genkortlægning."
      },
      "fi": {
        "title": "Karttaa muutettu. Paikannus epäonnistui. Yritä uudelleen.",
        "summary": "Uusi ympäristö havaittu. Karttaa muutettu. Paikannus epäonnistui. Yritä uudelleen kartoituksen jälkeen."
      },
      "nb": {
        "title": "Kartet er endret. Posisjonering mislyktes. Prøv igjen.",
        "summary": "Nytt miljø oppdaget. Kartet er endret. Posisjonering mislyktes. Prøv på nytt etter ny tilordning."
      },
      "nl": {
        "title": "Kaart gewijzigd. Positionering mislukt. Probeer het opnieuw.",
        "summary": "Nieuwe omgeving gedetecteerd. Kaart gewijzigd. Positionering mislukt. Probeer het opnieuw na het opnieuw in kaart brengen."
      },
      "sv": {
        "title": "Karta ändrad. Positionering misslyckades. Försök en gång till.",
        "summary": "Ny miljö upptäckt. Karta ändrad. Positionering misslyckades. Försök igen efter ny kartläggning."
      }
    },
    "629": {
      "internal": "F_629",
      "zh": {
        "title": "拖布支架掉落",
        "summary": "拖布支架掉落，请安装后继续工作。"
      },
      "en": {
        "title": "Mop cloth mount fell off.",
        "summary": "Mop cloth mount fell off. Reinstall it to resume working."
      },
      "fr": {
        "title": "Le support de serpillière est tombé.",
        "summary": "Le support de serpillière est tombé. Réinstallez-le pour remettre l’appareil en marche."
      },
      "de": {
        "title": "Der Mopp-Tuchhalter ist abgefallen.",
        "summary": "Der Mopp-Tuchhalter ist abgefallen. Setze ihn wieder ein, um mit der Reinigung fortzufahren."
      },
      "es": {
        "title": "El soporte de mopa se ha caído.",
        "summary": "El soporte de mopa se ha caído. Recolóquelo para reanudar el trabajo."
      },
      "ko": {
        "title": "물걸레 받침대가 탈락되었습니다.",
        "summary": "물걸레 받침대가 탈락되었다면 다시 장착하여 작업을 계속하세요."
      },
      "ru": {
        "title": "Отсоединился держатель протирочной салфетки.",
        "summary": "Отсоединился держатель протирочной салфетки. Установите его на место, чтобы продолжить."
      },
      "he": {
        "title": "תושבת הבד למגב נפלה.",
        "summary": "תושבת הבד למגב נפלה. התקינו אותו מחדש כדי לחדש את העבודה."
      },
      "id": {
        "title": "Dudukan kain pel terjatuh.",
        "summary": "Dudukan kain pel terjatuh. Pasang kembali untuk melanjutkan pekerjaan."
      },
      "pl": {
        "title": "Mocowanie ściereczki mopa odpadło.",
        "summary": "Mocowanie ściereczki mopa odpadło. Zamontuj je ponownie, aby wznowić pracę."
      },
      "ro": {
        "title": "Suportul de mop s-a desprins.",
        "summary": "Suportul de mop s-a desprins. Remontați-l pentru a relua procesul."
      },
      "th": {
        "title": "ตัวยึดผ้าถูพื้นหลุดออก",
        "summary": "ตัวยึดผ้าถูพื้นหลุดออก ติดตั้งใหม่เพื่อทำงานต่อ"
      },
      "uk": {
        "title": "Від’єднано кріплення ганчірки для вологого прибирання.",
        "summary": "Від’єднано кріплення ганчірки для вологого прибирання. Повторно встановіть його, щоб продовжити роботу."
      },
      "it": {
        "title": "L'aggancio del panno di lavaggio è caduto.",
        "summary": "L'aggancio del panno di lavaggio è caduto. Reinstallarlo per riprendere il lavoro."
      },
      "ja": {
        "title": "モップマウントが外れました。 ",
        "summary": "モップクロスマウントが取り外されています。取り付けて掃除を再開してください。"
      },
      "vi": {
        "title": "Đế gắn giẻ lau bị rơi.",
        "summary": "Đế gắn giẻ lau bị rơi. Lắp lại để robot tiếp tục hoạt động."
      },
      "pt": {
        "title": "O suporte do pano da mopa caiu.",
        "summary": "O suporte do pano da mopa caiu. Reinstale-o para retomar a tarefa."
      },
      "ms": {
        "title": "Pelekap kain mop tertanggal.",
        "summary": "Pelekap kain mop tertanggal. Pasangkannya semula untuk menyambung semula kerja."
      },
      "tr": {
        "title": "Paspas bezi yuvası yerinden çıkmıştır.",
        "summary": "Paspas bezi yuvası yerinden çıkmıştır. Devam etmek için yeniden takın."
      },
      "es-LA": {
        "title": "El montaje de la mopa se desprendió.",
        "summary": "El montaje de la mopa se desprendió. Vuelva a instalarlo para reanudar el funcionamiento."
      },
      "ar": {
        "title": "سقط حامل قماش الممسحة.",
        "summary": "سقط حامل قماش الممسحة. أعد تركيبه لاستئناف العمل."
      },
      "zh-Hant": {
        "title": "拖布支架掉落",
        "summary": "拖布支架掉落，請安裝後繼續工作。"
      },
      "cs": {
        "title": "Držák mopové utěrky spadl.",
        "summary": "Držák mopové utěrky spadl. Nainstalujte jej zpět, aby bylo možné pokračovat."
      },
      "hu": {
        "title": "A moprögzítő leesett.",
        "summary": "A moprögzítő leesett. Helyezze vissza a működés folytatásához."
      },
      "sk": {
        "title": "Držiak mopovej utierky odpadol.",
        "summary": "Držiak mopovej utierky odpadol. Znovu ho nainštalujte, aby ste pokračovali v práci."
      },
      "da": {
        "title": "Moppekludsbeslag faldt af.",
        "summary": "Moppekludsbeslag faldt af. Geninstaller det for at genoptage arbejdet."
      },
      "fi": {
        "title": "Moppiliinan pidike irtosi.",
        "summary": "Moppiliinan pidike irtosi. Asenna se takaisin jatkaaksesi siivousta."
      },
      "nb": {
        "title": "Moppeklutfeste falt av.",
        "summary": "Moppeklutfeste falt av. Installer den på nytt for å fortsette å fungere."
      },
      "nl": {
        "title": "Dweildoekhouder is losgekomen.",
        "summary": "Dweildoekhouder is losgekomen. Installeer deze opnieuw om door te gaan met werken."
      },
      "sv": {
        "title": "Moppduksfästet har lossnat.",
        "summary": "Moppduksfästet har lossnat. Sätt tillbaka det för att fortsätta."
      }
    },
    "668": {
      "internal": "F_668",
      "zh": {
        "title": "主机异常，请重置系统",
        "summary": "风机异常，请尝试重置系统，若无法解除请联系售后客服支持。"
      },
      "en": {
        "title": "Robot error. Reset the system.",
        "summary": "Fan error. Reset the system. If the problem persists, contact customer service."
      },
      "fr": {
        "title": "Erreur du robot. Réinitialisez le système.",
        "summary": "Erreur du ventilateur. Réinitialisez le système. Si le problème persiste, contactez le Service clientèle."
      },
      "de": {
        "title": "Roboterfehler. Setze das System zurück.",
        "summary": "Gebläsefehler. Setze das System zurück. Wenn das Problem weiterhin besteht, wende dich an den Kundendienst."
      },
      "es": {
        "title": "Error en el robot. Restablezca el sistema.",
        "summary": "Error en ventilador. Reinicie el sistema. Si el problema persiste, póngase en contacto con el servicio de atención al cliente."
      },
      "ko": {
        "title": "본체 오류입니다. 시스템을 초기화하세요",
        "summary": "팬 오류입니다. 시스템을 초기화하세요. 문제가 지속되면 고객센터로 문의해 주세요."
      },
      "ru": {
        "title": "Ошибка робота. Перезагрузите систему.",
        "summary": "Ошибка вентилятора. Выполните сброс системы. Если проблема сохраняется, обратитесь в службу поддержки."
      },
      "he": {
        "title": "תקלה ברובוט. התחלו את המערכת מחדש",
        "summary": "שגיאת מאוורר. אפסו את המערכת. אם הבעיה נמשכת, פנו לשירות הלקוחות."
      },
      "id": {
        "title": "Kesalahan robot. Atur ulang sistem.",
        "summary": "Kesalahan kipas. Atur ulang sistem. Jika masalah berlanjut, hubungi layanan pelanggan."
      },
      "pl": {
        "title": "Błąd robota. Zresetuj system.",
        "summary": "Błąd wentylatora. Jeśli problem będzie się powtarzać, skontaktuj się z obsługą klienta."
      },
      "ro": {
        "title": "Eroare robot. Resetați sistemul.",
        "summary": "Eroare ventilator. Resetați sistemul. Dacă problema persistă, contactați serviciul clienți."
      },
      "th": {
        "title": "เกิดข้อผิดพลาดของหุ่นยนต์ รีเซ็ตระบบ",
        "summary": "เกิดข้อผิดพลาดของพัดลม โปรดรีเซ็ตระบบ หากยังคงเกิดปัญหา โปรดติดต่อฝ่ายบริการลูกค้า"
      },
      "uk": {
        "title": "Помилка робота. Скиньте систему.",
        "summary": "Помилка роботи вентилятора. Скиньте налаштування системи. Якщо проблема не зникне, зверніться до служби підтримки."
      },
      "it": {
        "title": "Errore del robot. Resettare il sistema.",
        "summary": "Errore della ventola. Resettare il sistema. Se il problema persiste, contattare il servizio clienti."
      },
      "ja": {
        "title": "ロボット掃除機のエラーです。システムをリセットしてください。",
        "summary": "ファンのエラーです。システムをリセットしてください。問題が解決しない場合は、カスタマーサービスまでお問い合わせください。"
      },
      "vi": {
        "title": "Lỗi robot. Đặt lại hệ thống.",
        "summary": "Lỗi quạt. Đặt lại hệ thống. Nếu sự cố vẫn tiếp diễn, hãy liên hệ với bộ phận dịch vụ khách hàng."
      },
      "pt": {
        "title": "Erro do robô. Reponha o sistema.",
        "summary": "Erro da ventoinha. Reponha o sistema. Se o problema persistir, contacte o serviço de apoio ao cliente."
      },
      "ms": {
        "title": "Ralat robot. Menetapkan semula sistem.",
        "summary": "Ralat kipas. Tetapkan semula sistem. Jika masalah berterusan, hubungi khidmat pelanggan."
      },
      "tr": {
        "title": "Robot hatası. Sistemi sıfırlayın.",
        "summary": "Fan hatası. Sistemi sıfırlayın. Sorun devam ederse müşteri hizmetlerine başvurun."
      },
      "es-LA": {
        "title": "Error del robot. Restablezca el sistema.",
        "summary": "Error del ventilador. Restablezca el sistema. Si el problema persiste, comuníquese con el servicio de atención al cliente."
      },
      "ar": {
        "title": "خطأ في الروبوت. أعد ضبط النظام.",
        "summary": "خطأ في المروحة. أعد تعيين النظام. إذا استمرت المشكلة، فاتصل بخدمة العملاء."
      },
      "zh-Hant": {
        "title": "主機異常，請重設系統",
        "summary": "風機異常，請嘗試重設系統，若仍無法解決請聯絡售後客服以獲得支援。"
      },
      "cs": {
        "title": "Chyba robota. Resetujte systém.",
        "summary": "Chyba ventilátoru. Resetujte systém. Pokud problém přetrvává, obraťte se na zákaznickou podporu."
      },
      "hu": {
        "title": "Robothiba. Állítsa alaphelyzetbe a rendszert.",
        "summary": "Ventilátorhiba. Állítsa alaphelyzetbe a rendszert. Ha a probléma továbbra is fennáll, forduljon az ügyfélszolgálathoz."
      },
      "sk": {
        "title": "Chyba robota. Resetujte systém.",
        "summary": "Chyba ventilátora. Resetujte systém. Ak problém pretrváva, kontaktujte zákaznícky servis."
      },
      "da": {
        "title": "Robot fejl. Nulstil systemet.",
        "summary": "Ventilator fejl. Nulstil systemet. Hvis problemet fortsætter, skal du kontakte kundeservice."
      },
      "fi": {
        "title": "Robottivirhe. Nollaa järjestelmä.",
        "summary": "Tuuletinvirhe. Nollaa järjestelmä. Jos ongelma jatkuu, ota yhteyttä asiakaspalveluun."
      },
      "nb": {
        "title": "Robotfeil. Tilbakestill systemet.",
        "summary": "Viftefeil. Tilbakestill systemet. Hvis problemet vedvarer, kontakt kundeservice."
      },
      "nl": {
        "title": "Fout in robot. Reset het systeem.",
        "summary": "Fout ventilator. Reset het systeem. Neem contact op met de klantenservice als het probleem aanhoudt."
      },
      "sv": {
        "title": "Robotfel. Återställ systemet.",
        "summary": "Fläktfel. Återställ systemet. Kontakta kundtjänst om problemet kvarstår."
      }
    },
    "2000": {
      "internal": "F_2000"
    },
    "2003": {
      "internal": "F_2003",
      "zh": {
        "title": "电量低于20%，本次定时任务取消",
        "summary": "电量低于20%，本次定时任务取消"
      },
      "en": {
        "title": "Battery level below 20%. Scheduled task canceled.",
        "summary": "Battery level below 20%. Scheduled task canceled."
      },
      "fr": {
        "title": "Niveau de batterie inférieur à 20 %. La tâche programmée est annulée.",
        "summary": "Niveau de batterie inférieur à 20 %. La tâche programmée est annulée."
      },
      "de": {
        "title": "Akkustand ≤ 20 %. Geplante Aufgabe abgebrochen.",
        "summary": "Akkustand ≤ 20 % Geplante Aufgabe abgebrochen."
      },
      "es": {
        "title": "Nivel de batería inferior al 20 %. Tarea programada cancelada.",
        "summary": "Nivel de batería inferior al 20 %. Tarea programada cancelada."
      },
      "ko": {
        "title": "배터리 잔량이 20% 미만이므로 이번 예약 작업을 취소합니다.",
        "summary": "배터리 잔량이 20% 미만이므로 이번 예약 작업을 취소합니다."
      },
      "ru": {
        "title": "Заряд аккумулятора ниже 20 %. Запланированное задание отменено.",
        "summary": "Заряд аккумулятора ниже 20 %. Запланированное задание отменено."
      },
      "he": {
        "title": "רמת הסוללה נמוכה מ-20%. המשימה המתוזמנת בוטלה.",
        "summary": "רמת הסוללה נמוכה מ-20%. המשימה המתוזמנת בוטלה."
      },
      "id": {
        "title": "Tingkat baterai di bawah 20%. Tugas terjadwal dibatalkan.",
        "summary": "Tingkat baterai di bawah 20%. Tugas terjadwal dibatalkan."
      },
      "pl": {
        "title": "Poziom naładowania akumulatora poniżej 20%. Zaplanowane zadanie zostało anulowane.",
        "summary": "Poziom naładowania akumulatora poniżej 20%. Zaplanowane zadanie zostało anulowane."
      },
      "ro": {
        "title": "Nivelul bateriei sub 20%. Acțiunea planificată a fost anulată.",
        "summary": "Nivelul bateriei sub 20%. Acțiunea planificată a fost anulată."
      },
      "th": {
        "title": "ระดับแบตเตอรี่ต่ำกว่า 20% ยกเลิกงานตามกำหนดเวลาแล้ว",
        "summary": "ระดับแบตเตอรี่ต่ำกว่า 20% ยกเลิกงานตามกำหนดเวลาแล้ว"
      },
      "uk": {
        "title": "Рівень заряду акумулятора нижче ніж 20%. Заплановане завдання скасовано.",
        "summary": "Рівень заряду акумулятора нижче ніж 20%. Заплановане завдання скасовано."
      },
      "it": {
        "title": "Livello della batteria < 20%. Attività programmata annullata.",
        "summary": "Livello della batteria < 20%. Attività programmata annullata."
      },
      "ja": {
        "title": "バッテリー残量が20%未満です。予約タスクがキャンセルされました。",
        "summary": "バッテリー残量が20%未満です。予約タスクがキャンセルされました。"
      },
      "vi": {
        "title": "Mức pin dưới 20%. Đã hủy tác vụ đã lên lịch.",
        "summary": "Mức pin dưới 20%. Đã hủy tác vụ đã lên lịch."
      },
      "pt": {
        "title": "Nível da bateria abaixo de 20%. Tarefa programada cancelada.",
        "summary": "Nível da bateria abaixo de 20%. Tarefa programada cancelada."
      },
      "ms": {
        "title": "Paras bateri di bawah 20% Tugasan berjadual dibatalkan.",
        "summary": "Paras bateri di bawah 20% Tugasan berjadual dibatalkan."
      },
      "tr": {
        "title": "Pil seviyesi %20'nin altında. Programlanmış görev iptal edildi.",
        "summary": "Pil seviyesi %20'nin altında. Programlanmış görev iptal edildi."
      },
      "es-LA": {
        "title": "El nivel de batería está por debajo del 20 %. La tarea programada se canceló.",
        "summary": "El nivel de batería está por debajo del 20 %. La tarea programada se canceló."
      },
      "ar": {
        "title": "مستوى البطارية أقل من 20%. تم إلغاء المهمة المجدولة.",
        "summary": "مستوى البطارية أقل من 20%. تم إلغاء المهمة المجدولة."
      },
      "zh-Hant": {
        "title": "電量低於 20%，本次排程任務取消",
        "summary": "電量低於 20%，本次排程任務取消"
      },
      "cs": {
        "title": "Úroveň baterie pod 20 %. Naplánovaný úkol zrušen.",
        "summary": "Úroveň baterie pod 20 %. Naplánovaný úkol zrušen."
      },
      "hu": {
        "title": "Az akkumulátor töltöttségi szintje 20% alatt van. Ütemezett feladat visszavonva.",
        "summary": "Az akkumulátor töltöttségi szintje 20% alatt van. Ütemezett feladat visszavonva."
      },
      "sk": {
        "title": "Úroveň nabitia batérie je nižšia ako 20 %. Plánovaná úloha je zrušená.",
        "summary": "Úroveň nabitia batérie je nižšia ako 20 %. Plánovaná úloha je zrušená."
      },
      "da": {
        "title": "Batteriniveau under 20%. Planlagt opgave annulleret.",
        "summary": "Batteriniveau under 20%. Planlagt opgave annulleret."
      },
      "fi": {
        "title": "Akun varaus alle 20 %. Ajastettu tehtävä peruttu.",
        "summary": "Akun varaus alle 20 %. Ajastettu tehtävä peruttu."
      },
      "nb": {
        "title": "Batterinivå under 20%. Planlagt oppgave avbrutt.",
        "summary": "Batterinivå under 20%. Planlagt oppgave avbrutt."
      },
      "nl": {
        "title": "Batterijniveau onder de 20%. Geplande taak geannuleerd.",
        "summary": "Batterijniveau onder de 20%. Geplande taak geannuleerd."
      },
      "sv": {
        "title": "Batterinivån är under 20 %. Schemalagd uppgift avbruten.",
        "summary": "Batterinivån är under 20 %. Schemalagd uppgift avbruten."
      }
    },
    "2007": {
      "internal": "F_2007",
      "zh": {
        "title": "无法到达目标区域，清洁结束",
        "summary": "无法到达目标区域，清洁结束，请确认目标区域房门已打开或无遮挡。"
      },
      "en": {
        "title": "Unable to reach the target. Cleaning ended.",
        "summary": "Unable to reach the target. Cleaning ended. Ensure the door to the target area is open or unobstructed."
      },
      "fr": {
        "title": "Impossible d’atteindre la cible. Nettoyage terminé.",
        "summary": "Impossible d’atteindre la cible. Nettoyage terminé. Assurez-vous que la porte de la zone cible est ouverte et non obstruée."
      },
      "de": {
        "title": "Das Ziel ist nicht anfahrbar. Reinigung beendet.",
        "summary": "Das Ziel ist nicht anfahrbar. Reinigung beendet. Stelle sicher, dass die Tür zum Zielbereich offen oder unversperrt ist."
      },
      "es": {
        "title": "No se puede llegar al objetivo. Limpieza finalizada.",
        "summary": "No se puede llegar al objetivo. Limpieza finalizada. Asegúrese de que la puerta del área objetivo esté abierta y despejada."
      },
      "ko": {
        "title": "대상 영역에 진입할 수 없어 청소를 종료합니다.",
        "summary": "대상 영역에 진입할 수 없어 청소를 종료합니다. 해당 영역의 방 문이 열려 있거나 가려지지 않았는지 확인하세요."
      },
      "ru": {
        "title": "Не удалось достичь цели. Уборка завершена.",
        "summary": "Не удалось достичь цели. Уборка завершена. Убедитесь, что дверь в указанную зону открыта и что на пути робота нет препятствий."
      },
      "he": {
        "title": "לא ניתן להגיע ליעד. הסתיים הניקוי.",
        "summary": "לא ניתן להגיע ליעד. הסתיים הניקוי. ודאו שהדלת לאזור המטרה פתוחה או אינה חסומה."
      },
      "id": {
        "title": "Tidak dapat menjangkau target. Pembersihan diakhiri.",
        "summary": "Tidak dapat menjangkau target. Pembersihan diakhiri. Pastikan pintu ke area target terbuka atau tidak terhalang."
      },
      "pl": {
        "title": "Brak możliwości dotarcia do celu. Sprzątanie zakończone.",
        "summary": "Brak możliwości dotarcia do celu. Sprzątanie zakończone. Upewnij się, że drzwi do obszaru docelowego są otwarte i nie ma w nich żadnych przeszkód."
      },
      "ro": {
        "title": "Nu se poate ajunge la țintă. Curățare finalizată.",
        "summary": "Nu se poate ajunge la țintă. Curățare finalizată. Asigurați-vă că ușa către zona țintă este deschisă, iar traseul neobstrucționată."
      },
      "th": {
        "title": "ไม่สามารถเข้าไปยังพื้นที่เป้าหมายได้ สิ้นสุดการทำความสะอาดแล้ว",
        "summary": "ไม่สามารถเข้าไปยังพื้นที่เป้าหมายได้ สิ้นสุดการทำความสะอาดแล้ว ตรวจสอบให้แน่ใจว่าประตูสู่พื้นที่เป้าหมายเปิดอยู่และไม่ถูกกีดขวาง"
      },
      "uk": {
        "title": "Не вдалося дістатися до цілі. Прибирання завершено.",
        "summary": "Не вдалося дістатися до цілі. Прибирання завершено. Перевірте, чи відкрито й не заблоковано двері до потрібної області."
      },
      "it": {
        "title": "Impossibile raggiungere l'obiettivo. Pulizia arrestata.",
        "summary": "Impossibile raggiungere l'obiettivo. Pulizia arrestata. Accertarsi che la porta che conduce all'area di destinazione sia aperta e libera da ostacoli."
      },
      "ja": {
        "title": "目的地に到達できません。掃除が終了しました。",
        "summary": "目的地に到達できません。掃除が終了しました。目的地エリアへのドアが開いていることや障害物がないことを確認してください。"
      },
      "vi": {
        "title": "Không thể đến được mục tiêu. Quá trình làm sạch đã kết thúc.",
        "summary": "Không thể đến được mục tiêu. Quá trình làm sạch đã kết thúc. Đảm bảo cửa vào khu vực mục tiêu mở hoặc không bị cản trở."
      },
      "pt": {
        "title": "Não foi possível chegar ao destino. A limpeza terminou.",
        "summary": "Não foi possível chegar ao destino. A limpeza terminou. Certifique-se de que a porta de acesso à área de destino está aberta ou desobstruída."
      },
      "ms": {
        "title": "Tidak dapat mencapai sasaran. Pembersihan ditamatkan.",
        "summary": "Tidak dapat mencapai sasaran. Pembersihan ditamatkan. Pastikan pintu ke kawasan sasaran terbuka atau tidak terhalang."
      },
      "tr": {
        "title": "Hedefe ulaşılamıyor. Temizlik sona erdi.",
        "summary": "Hedefe ulaşılamıyor. Temizlik sona erdi. Hedef alana açılan kapının açık olduğundan veya önünde herhangi bir engel bulunmadığından emin olun."
      },
      "es-LA": {
        "title": "No se puede llegar al objetivo. La limpieza finalizó.",
        "summary": "No se puede llegar al objetivo. La limpieza finalizó. Asegúrese de que la puerta hacia el área objetivo esté abierta y libre de obstrucciones."
      },
      "ar": {
        "title": "تعذر الوصول إلى الهدف. انتهى التنظيف.",
        "summary": "تعذر الوصول إلى الهدف. انتهى التنظيف. تأكد من أن الباب المؤدي إلى المنطقة المستهدفة مفتوح أو لا توجد به عوائق."
      },
      "zh-Hant": {
        "title": "無法到達目標區域，清掃結束",
        "summary": "無法到達目標區域，清掃結束，請確認目標區域房間已打開房門或無遮擋。"
      },
      "cs": {
        "title": "Nelze dosáhnout cíle. Úklid ukončen.",
        "summary": "Nelze dosáhnout cíle. Úklid ukončen. Ujistěte se, že dveře do cílové oblasti jsou otevřené nebo nic nebrání přístupu."
      },
      "hu": {
        "title": "Nem lehet elérni a célt. A takarítás véget ért.",
        "summary": "Nem lehet elérni a célt. A takarítás véget ért. Győződjön meg arról, hogy a célterületre vezető ajtó nyitva van, vagy nincs akadály."
      },
      "sk": {
        "title": "Nie je možné dosiahnuť cieľ. Čistenie je ukončené.",
        "summary": "Nie je možné dosiahnuť cieľ. Čistenie je ukončené. Uistite sa, že dvere do cieľového priestoru sú otvorené alebo voľné."
      },
      "da": {
        "title": "Kan ikke nå målet. Rengøringen sluttede.",
        "summary": "Kan ikke nå målet. Rengøringen sluttede. Sørg for, at døren til målområdet er åben eller uhindret."
      },
      "fi": {
        "title": "Kohteeseen ei päästy. Siivous päättyi.",
        "summary": "Kohteeseen ei päästy. Siivous päättyi. Varmista, että kohdealueen ovi on auki eikä sen edessä ole esteitä."
      },
      "nb": {
        "title": "Kan ikke nå målet. Rengjøring avsluttet.",
        "summary": "Kan ikke nå målet. Rengjøring avsluttet. Sørg for at døren til målområdet er åpen eller uhindret."
      },
      "nl": {
        "title": "Kan het doel niet bereiken. Reiniging beëindigd.",
        "summary": "Kan het doel niet bereiken. Reiniging beëindigd. Zorg ervoor dat de deur naar het doeldomein open of niet geblokkeerd is."
      },
      "sv": {
        "title": "Kan inte komma till målet. Städning avslutad.",
        "summary": "Kan inte komma till målet. Städning avslutad. Kontrollera att dörren till målområter är öppen och att roboten kan komma åt."
      }
    },
    "2012": {
      "internal": "F_2012",
      "zh": {
        "title": "部分区域无法到达，清洁结束",
        "summary": "部分区域无法到达，清洁结束，请确认目标区域房门已打开或无遮挡。"
      },
      "en": {
        "title": "Unable to reach the target. Cleaning ended.",
        "summary": "Unable to reach the target. Cleaning ended. Ensure the door to the target area is open or unobstructed."
      },
      "fr": {
        "title": "Impossible d’atteindre la cible. Nettoyage terminé.",
        "summary": "Impossible d’atteindre la cible. Nettoyage terminé. Assurez-vous que la porte de la zone cible est ouverte et non obstruée."
      },
      "de": {
        "title": "Das Ziel ist nicht anfahrbar. Reinigung beendet.",
        "summary": "Das Ziel ist nicht anfahrbar. Reinigung beendet. Stelle sicher, dass die Tür zum Zielbereich offen oder unversperrt ist."
      },
      "es": {
        "title": "No se puede llegar al objetivo. Limpieza finalizada.",
        "summary": "No se puede llegar al objetivo. Limpieza finalizada. Asegúrese de que la puerta del área objetivo esté abierta y despejada."
      },
      "ko": {
        "title": "일부 영역에 진입할 수 없어 청소를 종료합니다.",
        "summary": "일부 영역에 진입할 수 없어 청소를 종료합니다. 해당 영역의 방 문이 열려 있거나 가려지지 않았는지 확인하세요"
      },
      "ru": {
        "title": "Не удалось достичь цели. Уборка завершена.",
        "summary": "Не удалось достичь цели. Уборка завершена. Убедитесь, что дверь в указанную зону открыта и что на пути робота нет препятствий."
      },
      "he": {
        "title": "לא ניתן להגיע ליעד. הסתיים הניקוי.",
        "summary": "לא ניתן להגיע ליעד. הסתיים הניקוי. ודאו שהדלת לאזור המטרה פתוחה או אינה חסומה."
      },
      "id": {
        "title": "Tidak dapat menjangkau target. Pembersihan diakhiri.",
        "summary": "Tidak dapat menjangkau target. Pembersihan diakhiri. Pastikan pintu ke area target terbuka atau tidak terhalang."
      },
      "pl": {
        "title": "Brak możliwości dotarcia do celu. Sprzątanie zakończone.",
        "summary": "Brak możliwości dotarcia do celu. Sprzątanie zakończone. Upewnij się, że drzwi do obszaru docelowego są otwarte i nie ma w nich żadnych przeszkód."
      },
      "ro": {
        "title": "Nu se poate ajunge la țintă. Curățare finalizată.",
        "summary": "Nu se poate ajunge la țintă. Curățare finalizată. Asigurați-vă că ușa către zona țintă este deschisă, iar traseul neobstrucționată."
      },
      "th": {
        "title": "ไม่สามารถเข้าไปยังพื้นที่เป้าหมายได้ สิ้นสุดการทำความสะอาดแล้ว",
        "summary": "ไม่สามารถเข้าไปยังพื้นที่เป้าหมายได้ สิ้นสุดการทำความสะอาดแล้ว ตรวจสอบให้แน่ใจว่าประตูสู่พื้นที่เป้าหมายเปิดอยู่และไม่ถูกกีดขวาง"
      },
      "uk": {
        "title": "Не вдалося дістатися до цілі. Прибирання завершено.",
        "summary": "Не вдалося дістатися до цілі. Прибирання завершено. Перевірте, чи відкрито й не заблоковано двері до потрібної області."
      },
      "it": {
        "title": "Impossibile raggiungere l'obiettivo. Pulizia arrestata.",
        "summary": "Impossibile raggiungere l'obiettivo. Pulizia arrestata. Accertarsi che la porta che conduce all'area di destinazione sia aperta e libera da ostacoli."
      },
      "ja": {
        "title": "目的地に到達できません。掃除が終了しました。",
        "summary": "目的地に到達できません。掃除が終了しました。目的地エリアへのドアが開いていることや障害物がないことを確認してください。"
      },
      "vi": {
        "title": "Không thể đến được mục tiêu. Quá trình làm sạch đã kết thúc.",
        "summary": "Không thể đến được mục tiêu. Quá trình làm sạch đã kết thúc. Đảm bảo cửa vào khu vực mục tiêu mở hoặc không bị cản trở."
      },
      "pt": {
        "title": "Não foi possível chegar ao destino. A limpeza terminou.",
        "summary": "Não foi possível chegar ao destino. A limpeza terminou. Certifique-se de que a porta de acesso à área de destino está aberta ou desobstruída."
      },
      "ms": {
        "title": "Tidak dapat mencapai sasaran. Pembersihan ditamatkan.",
        "summary": "Tidak dapat mencapai sasaran. Pembersihan ditamatkan. Pastikan pintu ke kawasan sasaran terbuka atau tidak terhalang."
      },
      "tr": {
        "title": "Hedefe ulaşılamıyor. Temizlik sona erdi.",
        "summary": "Hedefe ulaşılamıyor. Temizlik sona erdi. Hedef alana açılan kapının açık olduğundan veya önünde herhangi bir engel bulunmadığından emin olun."
      },
      "es-LA": {
        "title": "No se puede llegar al objetivo. La limpieza finalizó.",
        "summary": "No se puede llegar al objetivo. La limpieza finalizó. Asegúrese de que la puerta hacia el área objetivo esté abierta o libre de obstrucciones."
      },
      "ar": {
        "title": "تعذر الوصول إلى الهدف. انتهى التنظيف.",
        "summary": "تعذر الوصول إلى الهدف. انتهى التنظيف. تأكد من أن الباب المؤدي إلى المنطقة المستهدفة مفتوح أو لا توجد به عوائق."
      },
      "zh-Hant": {
        "title": "部分區域無法到達，清掃結束",
        "summary": "部分區域無法到達，清掃結束，請確認目標區域房間已打開或無遮擋。"
      },
      "cs": {
        "title": "Nelze dosáhnout cíle. Úklid ukončen.",
        "summary": "Nelze dosáhnout cíle. Úklid ukončen. Ujistěte se, že dveře do cílové oblasti jsou otevřené nebo nic nebrání přístupu."
      },
      "hu": {
        "title": "Nem lehet elérni a célt. A takarítás véget ért.",
        "summary": "Nem lehet elérni a célt. A takarítás véget ért. Győződjön meg arról, hogy a célterületre vezető ajtó nyitva van, vagy nincs akadály."
      },
      "sk": {
        "title": "Nie je možné dosiahnuť cieľ. Čistenie je ukončené.",
        "summary": "Nie je možné dosiahnuť cieľ. Čistenie je ukončené. Uistite sa, že dvere do cieľového priestoru sú otvorené alebo voľné."
      },
      "da": {
        "title": "Kan ikke nå målet. Rengøringen sluttede.",
        "summary": "Kan ikke nå målet. Rengøringen sluttede. Sørg for, at døren til målområdet er åben eller uhindret."
      },
      "fi": {
        "title": "Kohteeseen ei päästy. Siivous päättyi.",
        "summary": "Kohteeseen ei päästy. Siivous päättyi. Varmista, että kohdealueen ovi on auki eikä sen edessä ole esteitä."
      },
      "nb": {
        "title": "Kan ikke nå målet. Rengjøring avsluttet.",
        "summary": "Kan ikke nå målet. Rengjøring avsluttet. Sørg for at døren til målområdet er åpen eller uhindret."
      },
      "nl": {
        "title": "Kan het doel niet bereiken. Reiniging beëindigd.",
        "summary": "Kan het doel niet bereiken. Reiniging beëindigd. Zorg ervoor dat de deur naar het doeldomein open of niet geblokkeerd is."
      },
      "sv": {
        "title": "Kan inte komma till målet. Städning avslutad.",
        "summary": "Kan inte komma till målet. Städning avslutad. Kontrollera att dörren till målområter är öppen och att roboten kan komma åt."
      }
    },
    "2013": {
      "internal": "F_2013"
    },
    "2015": {
      "internal": "F_2015"
    },
    "2017": {
      "internal": "F_2017"
    },
    "2100": {
      "internal": "F_2100",
      "zh": {
        "title": "电量低，补电后会继续清洁",
        "summary": "电量不足，返回基站充电，补电后会继续清洁"
      },
      "en": {
        "title": "Low battery. Resume cleaning after recharging.",
        "summary": "Low battery. Starting to recharge. Resume cleaning after charging."
      },
      "fr": {
        "title": "Batterie faible. Reprendre le nettoyage après la charge.",
        "summary": "Batterie faible. Démarrage de la charge. Reprendre le nettoyage après la charge."
      },
      "de": {
        "title": "Niedriger Akkustand. Setze die Reinigung nach dem Wiederaufladen fort.",
        "summary": "Niedriger Akkustand. Beginnt mit dem Aufladen. Setze die Reinigung nach dem Aufladen fort."
      },
      "es": {
        "title": "Batería baja. La limpieza podrá reanudarse después de recargar.",
        "summary": "Batería baja. Iniciando recarga. La limpieza podrá reanudarse después de cargar."
      },
      "ko": {
        "title": "배터리 잔량이 부족합니다. 청소는 충전 후 이어집니다.",
        "summary": "배터리 잔량이 부족하여 도크로 복귀합니다. 청소는 충전 후 이어집니다."
      },
      "ru": {
        "title": "Низкий заряд аккумулятора. Уборка продолжится после зарядки.",
        "summary": "Низкий заряд аккумулятора. Начинаю зарядку. Уборка продолжится после зарядки."
      },
      "he": {
        "title": "הסוללה חלשה . הניקוי יחודש לאחר הטעינה.",
        "summary": "הסוללה חלשה. חוזר לסף. הניקוי יחודש לאחר הטעינה."
      },
      "id": {
        "title": "Baterai lemah. Lanjutkan pembersihan setelah mengisi ulang daya.",
        "summary": "Baterai lemah. Mulai mengisi ulang daya. Lanjutkan pembersihan setelah mengisi daya."
      },
      "pl": {
        "title": "Niski poziom naładowania akumulatora. Wznów sprzątanie po naładowaniu.",
        "summary": "Niski poziom naładowania akumulatora. Rozpoczynanie ładowania. Wznów sprzątanie po naładowaniu."
      },
      "ro": {
        "title": "Baterie descărcată. Reluați procesul de curățare după încărcare.",
        "summary": "Baterie descărcată. Se începe reîncărcarea. Reluați procesul de curățare după încărcare."
      },
      "th": {
        "title": "แบตเตอรี่เหลือน้อย ทำความสะอาดต่อหลังการชาร์จไฟ",
        "summary": "แบตเตอรี่เหลือน้อย กำลังเริ่มต้นชาร์จไฟอีกครั้ง กลับมาทำความสะอาดต่อหลังการชาร์จไฟ"
      },
      "uk": {
        "title": "Низький заряд акумулятора. Продовжте прибирання після підзаряджання.",
        "summary": "Низький заряд акумулятора. Починається підзаряджання. Продовжте прибирання після заряджання."
      },
      "it": {
        "title": "Basso livello di carica della batteria. Riprendere la pulizia dopo la ricarica.",
        "summary": "Basso livello di carica della batteria. Inizio della ricarica in corso. Riprendere la pulizia dopo la ricarica."
      },
      "ja": {
        "title": "バッテリー残量が少なくなっています。充電後に掃除を再開してください。",
        "summary": "バッテリーが低下しています。充電を開始します。充電後、掃除を再開してください。"
      },
      "vi": {
        "title": "Pin yếu. Tiếp tục làm sạch sau khi sạc lại.",
        "summary": "Pin yếu. Bắt đầu sạc lại. Tiếp tục làm sạch sau khi sạc."
      },
      "pt": {
        "title": "Bateria fraca. Continue a limpeza depois de recarregar.",
        "summary": "Bateria fraca. A iniciar o recarregamento. Continue a limpeza depois do carregamento."
      },
      "ms": {
        "title": "Kuasa bateri lemah. Sambung semula pembersihan selepas pengecasan semula",
        "summary": "Kuasa bateri lemah. Mula mengecas semula. Sambung semula pembersihan selepas pengecasan."
      },
      "tr": {
        "title": "Pil seviyesi düşük. Yeniden şarj ettikten sonra temizlemeye devam edin.",
        "summary": "Pil seviyesi düşük. Şarj başlatılıyor. Şarj ettikten sonra temizliğe devam edin."
      },
      "es-LA": {
        "title": "Batería baja. Cargue el robot y reanude la limpieza.",
        "summary": "Batería baja. Se está iniciando la recarga. Reanude la limpieza cuando esté cargada."
      },
      "ar": {
        "title": "البطارية ضعيفة. استأنف التنظيف بعد إعادة الشحن.",
        "summary": "البطارية ضعيفة. بدأت إعادة الشحن. استأنف التنظيف بعد الشحن."
      },
      "zh-Hant": {
        "title": "電量低，充電後會繼續清潔",
        "summary": "電量不足，返回 基座充電，充電後會繼續清潔"
      },
      "cs": {
        "title": "Baterie je téměř vybitá. Po dobití znovu spusťte úklid.",
        "summary": "Baterie je téměř vybitá. Spuštění nabíjení. Po nabití znovu spusťte úklid."
      },
      "hu": {
        "title": "Alacsony töltöttség. Folytassa a takarítást a töltést követően.",
        "summary": "Alacsony töltöttség. Elkezdődik a töltés. Folytassa a takarítást a töltést követően."
      },
      "sk": {
        "title": "Slabá batéria. Po dobití pokračujte v čistení.",
        "summary": "Slabá batéria. Spustenie nabíjania. Po nabití pokračujte v čistení."
      },
      "da": {
        "title": "Lavt batteri. Genoptag rengøringen efter genopladning.",
        "summary": "Lavt batteri. Begynder at genoplade. Genoptag rengøringen efter opladning."
      },
      "fi": {
        "title": "Akun varaus on alhainen. Jatka siivousta lataamisen jälkeen.",
        "summary": "Akun varaus on alhainen. Aloitetaan lataus. Jatka siivousta latauksen jälkeen."
      },
      "nb": {
        "title": "Lavt batteri: Gjenoppta rengjøringen etter nylading.",
        "summary": "Lavt batteri: Begynner å ny lade opp. Fortsett rengjøringen etter lading."
      },
      "nl": {
        "title": "Batterij bijna leeg. Hervat het reinigen na het opladen.",
        "summary": "Batterij bijna leeg. Start met opladen. Hervat het reinigen na het opladen."
      },
      "sv": {
        "title": "Lågt batteri. Fortsätt städning efter laddning.",
        "summary": "Lågt batteri. Börjar ladda. Fortsätt städning efter laddning."
      }
    },
    "2101": {
      "internal": "F_2101"
    },
    "2102": {
      "internal": "F_2102",
      "zh": {
        "title": "清洁完成，开始返回基站",
        "summary": "清洁完成，开始返回基站"
      },
      "en": {
        "title": "Cleaning completed. Returning to the dock",
        "summary": "Cleaning completed. Returning to the dock"
      },
      "fr": {
        "title": "Nettoyage terminé. Retour vers la station",
        "summary": "Nettoyage terminé. Retour vers la station"
      },
      "de": {
        "title": "Reinigung abgeschlossen. Kehre zur Dockingstation zurück",
        "summary": "Reinigung abgeschlossen. Kehre zur Dockingstation zurück"
      },
      "es": {
        "title": "Limpieza completa. Regresando a la base.",
        "summary": "Limpieza completa. Regresando a la base."
      },
      "ko": {
        "title": "청소가 완료되었습니다. 도크로 복귀하기 시작합니다.",
        "summary": "청소가 완료되었습니다. 도크로 복귀하기 시작합니다."
      },
      "ru": {
        "title": "Уборка завершена. Возвращаюсь на док-станцию",
        "summary": "Уборка завершена. Возвращаюсь на док-станцию"
      },
      "he": {
        "title": "הניקוי הושלם. חוזר לתחנת העגינה",
        "summary": "הניקוי הושלם. חוזר לתחנת העגינה"
      },
      "id": {
        "title": "Pembersihan selesai. Kembali ke dok.",
        "summary": "Pembersihan selesai. Kembali ke dok."
      },
      "pl": {
        "title": "Sprzątanie zakończone. Powrót do stacji dokującej",
        "summary": "Sprzątanie zakończone. Powrót do stacji dokującej"
      },
      "ro": {
        "title": "Curățare finalizată. Revenire la stația de andocare",
        "summary": "Curățare finalizată. Revenire la stația de andocare"
      },
      "th": {
        "title": "ทำความสะอาดเสร็จเรียบร้อยแล้ว กำลังกลับไปที่แท่นชาร์จ",
        "summary": "ทำความสะอาดเสร็จเรียบร้อยแล้ว กำลังกลับไปที่แท่นชาร์จ"
      },
      "uk": {
        "title": "Прибирання завершено. Повернення на базову станцію",
        "summary": "Прибирання завершено. Повернення на базову станцію"
      },
      "it": {
        "title": "Pulizia completata. Ritorno alla stazione di ricarica in corso",
        "summary": "Pulizia completata. Ritorno alla stazione di ricarica in corso"
      },
      "ja": {
        "title": "掃除が完了しました。充電ドックに戻ります",
        "summary": "掃除が完了しました。充電ドックに戻ります"
      },
      "vi": {
        "title": "Đã làm sạch xong. Đang quay trở về dock sạc",
        "summary": "Đã làm sạch xong. Đang quay trở về dock sạc"
      },
      "pt": {
        "title": "Limpeza concluída. A regressar à estação",
        "summary": "Limpeza concluída. A regressar à estação"
      },
      "ms": {
        "title": "Pembersihan selesai. Kembali ke dok.",
        "summary": "Pembersihan selesai. Kembali ke dok."
      },
      "tr": {
        "title": "Temizleme tamamlandı. Bağlantı istasyonuna geri dönülüyor",
        "summary": "Temizleme tamamlandı. Bağlantı istasyonuna geri dönülüyor"
      },
      "es-LA": {
        "title": "Limpieza completa. Regresando a la base.",
        "summary": "Limpieza completa. Regresando a la base."
      },
      "ar": {
        "title": "اكتمل التنظيف. العودة إلى القاعدة",
        "summary": "اكتمل التنظيف. العودة إلى القاعدة"
      },
      "zh-Hant": {
        "title": "清潔完成，開始返回 基座",
        "summary": "清潔完成，開始返回 基座"
      },
      "cs": {
        "title": "Úklid dokončen. Návrat do dokovací stanice.",
        "summary": "Úklid dokončen. Návrat do dokovací stanice."
      },
      "hu": {
        "title": "Takarítás befejezve. Visszatérés a dokkolóhoz",
        "summary": "Takarítás befejezve. Visszatérés a dokkolóhoz"
      },
      "sk": {
        "title": "Čistenie je dokončené. Návrat do doku",
        "summary": "Čistenie je dokončené. Návrat do doku"
      },
      "da": {
        "title": "Rengøring afsluttet. Tilbage til docken",
        "summary": "Rengøring afsluttet. Tilbage til docken"
      },
      "fi": {
        "title": "Siivous valmis. Palataan telakalle.",
        "summary": "Siivous valmis. Palataan telakalle."
      },
      "nb": {
        "title": "Rengjøring fullført. Tilbake til ladestasjonen",
        "summary": "Rengjøring fullført. Tilbake til ladestasjonen"
      },
      "nl": {
        "title": "Reiniging voltooid. Keert terug naar het dockingstation",
        "summary": "Reiniging voltooid. Keert terug naar het dockingstation"
      },
      "sv": {
        "title": "Städning slutförd. Återvänder till laddningsstationen",
        "summary": "Städning slutförd. Återvänder till laddningsstationen"
      }
    },
    "2103": {
      "internal": "F_2103"
    },
    "2104": {
      "internal": "F_2104"
    },
    "2105": {
      "internal": "F_2105"
    },
    "2108": {
      "internal": "F_2108"
    },
    "2109": {
      "internal": "F_2109"
    },
    "2110": {
      "internal": "F_2110"
    },
    "2111": {
      "internal": "F_2111"
    },
    "2112": {
      "internal": "F_2112"
    },
    "2113": {
      "internal": "F_2113"
    },
    "2114": {
      "internal": "F_2114"
    },
    "2115": {
      "internal": "F_2115"
    }
  },
  "device_states": {
    "1": {
      "internal": "IDEL"
    },
    "2": {
      "internal": "SLEEP"
    },
    "3": {
      "internal": "WAIT_INSTRUCTION"
    },
    "5": {
      "internal": "CLEANNING"
    },
    "7": {
      "internal": "REMOTE_CONTROl"
    },
    "8": {
      "internal": "CHARGING"
    },
    "10": {
      "internal": "PAUSE"
    },
    "12": {
      "internal": "ERROR"
    },
    "14": {
      "internal": "UPGRADING"
    },
    "22": {
      "internal": "DUSTING"
    },
    "26": {
      "internal": "RECHARGING"
    },
    "29": {
      "internal": "BUILD_MAP"
    },
    "40": {
      "internal": "CLEAN_REPEAT"
    },
    "41": {
      "internal": "BREAK_CHARGING"
    },
    "42": {
      "internal": "BREAK_RECHARGING"
    },
    "43": {
      "internal": "SELF_CHECK"
    },
    "44": {
      "internal": "RELOCTION"
    },
    "45": {
      "internal": "CHARGE_FULL"
    },
    "46": {
      "internal": "WORKING_DUSTING"
    },
    "50": {
      "internal": "WORKING_SLEEP"
    }
  },
  "robot_modes": {
    "0": {
      "internal": "STANDBY"
    },
    "1": {
      "internal": "WORKING"
    },
    "2": {
      "internal": "CHARGING"
    },
    "3": {
      "internal": "LOW_BATTERY"
    },
    "4": {
      "internal": "ALERT"
    },
    "5": {
      "internal": "MOP_CLEANING"
    },
    "6": {
      "internal": "MOP_AIRDRYING"
    },
    "4294967295": {
      "internal": "SLEEP"
    }
  }
}